{"word": "aafes", "def": "AAFES is the Army &amp; Air Force Exchange Service, the retailing service on US Army and Air Force installations worldwide. They provide commissary outlets and stores that sell clothing and household goods to active duty and retired members and family."}, {"word": "afbb", "def": "AFBB is an acronym standing for alpha fux beta bux, used in the incel community. It is meant to describe a woman who dates higher status alpha males, but will marry a timid beta."}, {"word": "afc", "def": "AFC is an acronym that means average frustrated chump. It's a term associated with self-identified incels and implies that men might only be frustrated because women and feminism are destroying their sex lives."}, {"word": "afk", "def": "Frequently found in chat rooms of massively multiplayer online games (MMOG), AFK is short for away from keys ... for when you aren't actively on a computer."}, {"word": "amog", "def": "AMOG is an acronym that means alpha male of the group. It's used in the \"manosphere\" and by self-identified pick up artists and incels to mean the guy in the group who commands the most attention, and who is likely having the most sex."}, {"word": "aoty", "def": "AOTY is an acronym standing for album of the year. It is used as a hashtag on social media to discuss opinions on music and which release deserves the title."}, {"word": "apm", "def": "APM is an acronym that means actions per minute. It's most commonly used in real-time video games such as Starcraft and refers to how many actions a player can perform in a minute. The best players have high APM rates."}, {"word": "ar", "def": "AR can stand for hundreds of things, but here are three of the big ones: augmented reality, alternate reality and ArmaLite rifle."}, {"word": "asf", "def": "ASF is a text and chat acronym that usually means as fuck, like \"extremely so.\""}, {"word": "asl", "def": "Asl is an internet abbreviation for “age, sex, and location,” usually asked as a question in romantic or sexual contexts online. It’s also used as internet slang for the intensifying expression “as hell.”"}, {"word": "atf", "def": "ATF is an acronym standing for the Bureau of Alcohol, Tobacco, and Firearms, a United States law enforcement agency."}, {"word": "awalt", "def": "AWALT is an acronym used by men in the pick up artist and red pill world to mean all women are like that. It's the counter to NAWALT (not all women are like that), expressing the theory that all women are predisposed to certain behaviors in certain situations."}, {"word": "bb", "def": "In text messages and online, bb can be short for baby, especially as it's used as a term of endearment for significant others or friends."}, {"word": "bbc", "def": "Sherlock fans and Whovians, you may be in for a bit of a shock. In addition to standing for the British Broadcasting Corporation, BBC is an acronym for big black cock, or \"penis.\" "}, {"word": "bbg", "def": "BBG is an acronym that means beautiful baby girl. "}, {"word": "bbw", "def": "BBW is an acronym that stands for Big Beautiful Women."}, {"word": "bde", "def": "BDE is an acronym. We all pretty much know what it stands for ..."}, {"word": "bdm", "def": "BDM is an acronym that has many meanings."}, {"word": "bdsm", "def": "BDSM is an acronym that refers to a specific type of erotic behavior or play, that may involve any of the following: bondage and discipline (B&amp;D), dominance and submission (D&amp;S), and sadism and masochism (S&amp;M)."}, {"word": "bfe", "def": "BFE is an acronym meaning bum fuck, Egypt (or, bumfuck, Egypt). The phrase is used to say something is taking place in the middle of nowhere."}, {"word": "bgm", "def": "BGM is an acronym that means background music. It's used in social media, gaming, and texting."}, {"word": "bhm", "def": "BHM is an acronym that stands for Black History Month. It is often used as the hashtag \"#bhm.\" February is Black History Month in the United States."}, {"word": "bih", "def": "Bih (or BIH) is an abbreviation of the word bitch."}, {"word": "bmf", "def": "BMF is an acronym with a few common usages: bad motherfucker (popularized by Quentin Tarantino's film Pulp Fiction), Black Mafia Family (a drug trafficking gang), and Blowin' Money Fast (a song by rapper Rick Ross)."}, {"word": "bml", "def": "BML is an acronym meaning Bling My Line. It can sometimes also mean Bless My Life, or Biting My Lip."}, {"word": "bms", "def": "BMS is an internet acronym for “broke my scale,\" used in support of a user, often a woman, posting a picture of herself and asking for a numerical rating from her online followers."}, {"word": "bmt", "def": "In slang, BMT can be an acronym for Big Man Ting, a Jamaican English phrase meaning \"grown-up thing\" and referring to adult matters or concerns. Jamaican speakers may use big man ting with the effect of \"for real,\" \"seriously,\" or \"no joke,\" e.g., Big man ting, that new single from Drake is the greatest. A related phrase is big people ting."}, {"word": "bmw", "def": " BMW is the acronym for luxury automobile producer BMW, which stands for Bavarian Motor Works."}, {"word": "boe", "def": "BoE is short for Bind on Equip, a phrase used in the online role-playing game World of Warcraft, among others, for items that players can sell but not barter."}, {"word": "bos", "def": "BOS is a common shortening of the city of Boston, Massachusetts and an internet acronym, often standing for boyfriend or boss over shoulder."}, {"word": "bri", "def": "BRI is an acronym that stands for China's Belt and Road Initiative, a massive new trade corridor project that is also sometimes referred to as the New Silk Road."}, {"word": "bsf", "def": "BSF is textspeak and internet slang for best friend. Others, however, may know it as short for Bible Study Fellowship, India's Border Security Force, the Venezuelan currency the Strong Bolivar, and the German reality TV series Bauer sucht Frau (Farmer Seeks Wife)."}, {"word": "bsm", "def": "BSM is an acronym most commonly used to mean Business Service Management."}, {"word": "btdt", "def": "BTDT is a textspeak acronym shortening the popular phrase been there, done that."}, {"word": "btfo", "def": "To BTFO is a vulgar internet acronym for “blown the fuck out.” It’s used to emphasize an extraordinary or embarrassing defeat, especially in a sports or a political argument."}, {"word": "btsd", "def": "BTSD is an acronym used commonly by teenagers to refer to a high-school back to school dance."}, {"word": "bhy", "def": "BYH is a texting and chat acronym that means bless your heart, and for some metal fans, it may mean bang your head."}, {"word": "cba", "def": "CBA is an acronym that means can't be arsed, meaning, essentially, that a person can't be bothered to find the energy or willingness to do something."}, {"word": "cbh", "def": "CBH is an acronym for child-bearing hips, a reference to wide hips that are said to be good for bearing children."}, {"word": "ccap", "def": "CCAP is an acronym used in various countries for Climate Change Action Plan."}, {"word": "cfmn", "def": "CFMN is an acronym with two usages, both relating to sexuality: come fuck me now, and clothed females, naked male. The latter is a kink, or practice, in the BDSM community."}, {"word": "cte", "def": "CTE stands for chronic traumatic encephalopathy, a degenerative brain disease caused by repeated trauma to the head. The disease is especially prevalent among military veterans and professional athletes like American football players."}, {"word": "ctfo", "def": "CTFO is a webspeak acronym that means chill the fuck out."}, {"word": "ctfu", "def": "Sometimes written in all capital letters, ctfu is a slang initialism most commonly standing for “crack(ing) the fuck up,” used to express laughter and mark tone in digital communication. Among other variations, the abbreviation can also mean “cheer the fuck up,” chiding individuals perceived as unduly dejected."}, {"word": "cvh", "def": "CVH is an acronym used to stand for a variety of things, including Community Voices Heard (a community organization in New York), Christan Van Hoose (a twitch streamer), and Chris Van Hollen (a politician)."}, {"word": "daca", "def": "DACA is an acronym for Deferred Action for Childhood Arrivals, a 2012 Obama immigration policy that allows people brought to the United States illegally as children to defer deportation and live and work legally."}, {"word": "ddf", "def": "DDF is an acronym, used on dating websites or personal ads, that stands for drug disease free or drug and disease free."}, {"word": "ddlg", "def": "DDLG, or DD/LG, is an acronym for daddy dom/little girl, a sexual relationship where the dominant male is the daddy figure and a woman plays the role of a young girl."}, {"word": "deat", "def": "DEAT is usually used in the plural, and is a slang word for details, as in phone numbers and addresses."}, {"word": "dhv", "def": "DHV is an acronym used in the incel community. It stands for a display of higher value, or an action displayed by someone in a public setting that increases their sexual value."}, {"word": "diaf", "def": "DIAF is an internet slang acronym meaning die in a fire."}, {"word": "dilf", "def": "DILF is an acronym that stands for Dad I'd Like to Fuck, a term applied to sexy fathers or just men of middle age. DILF is definitely meant as a compliment, dads ... even if it's a little creepy."}, {"word": "djia", "def": "DJIA stands for the Dow Jones Industrial Average."}, {"word": "dm", "def": "Slide into...this definition. DM stands for direct message, or a private message with a person on social media, especially Twitter. For you role players, DM can also stand for the Dungeon Master in a game of Dungeons &amp; Dragons."}, {"word": "dnb", "def": "DNB is an acronym meaning drum 'n' bass."}, {"word": "dot", "def": "DOT is an acronym for damage over time, and it's used in computer gaming to refer to acts that slowly cause damage to a character, such as poisoning or a spell."}, {"word": "dps", "def": "DPM is an acronym that means damage per second in multiplayer online gaming. It's used both as a noun (a weapon type, class, or a character capable of massive damage) and as an adjective to describe a weapon's capability."}, {"word": "dt", "def": "The abbreviation DT can variously stand for delirium tremens, a symptom of withdrawal; double tap, a reference to liking someone's post on Instagram; detective; defensive tackle in football; or school detention."}, {"word": "dtf", "def": "DTF is an initialism standing for down to fuck, meaning that someone is willing to engage in a short-term sexual relationship."}, {"word": "dtm", "def": "DTM is an internet slang acronym meaning doing too much or do too much, in reference to the poster's behavior."}, {"word": "dtr", "def": "DTR is an acronym that means define the relationship. Used in chat and texting, it implies a critical point in a relationship in which one person wants clear answers from the other."}, {"word": "dvda", "def": "DVDA is an acronym mainly used in the porn community for double vaginal, double anal."}, {"word": "dw", "def": "Sure, DW can stand for everything from devil worshipper to Doctor Who, but on the internet, it's usually short for don't worry."}, {"word": "dws", "def": "DWS is an acronym that means driving while suspended, in reference to a driver's license. It can also refer to Congresswoman Debbie Wasserman Schultz of Florida."}, {"word": "dwu", "def": "DWU is an internet acronym  for “don’t wait up,” which literally means \"don't stay awake waiting for someone to arrive or make contact.\" Don’t wait up is also casually used to mean “don’t worry about me.”"}, {"word": "ebitda", "def": "EBITDA is a financial acronym standing for Earnings Before Interest, Tax, Depreciation, and Amortization."}, {"word": "ebt", "def": "EBT is an acronym that means Electronic Benefits Transfer. It pertains to general welfare benefits or food stamp benefits (the Supplemental Nutrition Assistance Program known as SNAP), the cash value of which is carried on a magnetically encoded card similar to a debit card, issued by the government."}, {"word": "egot", "def": "EGOT is an acronym for Emmy, Grammy, Oscar, and Tony, used in reference to someone with the rare distinction of winning all four major entertainment awards."}, {"word": "f4f", "def": "F4F is an acronym used on social media, mainly on Instagram, to stand for follow for follow. Users will post this after following other users in the hopes they will follow back. It is most frequently used as a hashtag."}, {"word": "faang", "def": "FAANG is an acronym used in reference to the stocks of the five tech companies Facebook, Amazon, Apple, Netflix and Alphabet (the G refers to Alphabet's core company Google)."}, {"word": "fbf", "def": "FBF is an acronym for flashback Friday. On social media, \"#FBF\" is a common hashtag used in captions of old photos shared on Fridays."}, {"word": "ffs", "def": "FFS is an acronym used mostly online that means for fuck's sake, an expression of annoyance, disbelief, or exasperation. It is similar to \"are you serious?\" or \"oh, come on!\""}, {"word": "fiy", "def": "FIY is a hashtag on social media that means fix it yourself."}, {"word": "fka", "def": "FKA is an acronym that means formerly known as."}, {"word": "flotus", "def": "FLOTUS is an acronym for First Lady of the United States. It's a common, informal acronym. First Lady Melania Trump uses the Twitter handle @FLOTUS. Michelle Obama just used @MichelleObama ..."}, {"word": "fof", "def": "FOF is an acronym and hashtag used on the internet for fuck off or flip off Friday. It is often associated with the American television show The Walking Dead due to the hand gestures certain characters use ... often."}, {"word": "fomo", "def": "Short for fear of missing out, FOMO is an anxious feeling you get when you feel other people might be having a good time without you."}, {"word": "fts", "def": "FTS is an acronym that means fuck this (or that) shit, implying intense exasperation. It is similar to \"forget this\"!"}, {"word": "fupa", "def": "FUPA is an acronym for Fat Upper Pelvic (or Pubic) Area, and it is slang for fat in the lower abdomen area, the result of either the medical condition panniculus, or just a pronounced lower belly."}, {"word": "fw", "def": "In email, FW typically refers to forwarding a message. In internet slang, FW stands for fuck with."}, {"word": "fwb", "def": "A fwb or friend with benefits is a friend someone occasionally has casual sex with."}, {"word": "fwm", "def": "FWM is an acronym meaning fuck with me. Often, this phrase is used casually to mean talk with me or get with me. Sometimes, FWM is used in the more negative sense, meaning mess with me."}, {"word": "fym", "def": "FYM is a textspeak acronym standing for fuck you mean? or fuck you motherfucker(s)."}, {"word": "gt", "def": "G&amp;T is a shortening of gin and tonic, a cocktail made out of gin and tonic water."}, {"word": "gbo", "def": " GBO is an acronym standing for Go Big Orange, the motto for the athletic teams of the University of Tennessee."}, {"word": "gby", "def": "GBY is an acronym used on social media and texting to mean God bless you."}, {"word": "gdp", "def": "Let's get economical. GDP is the total monetary value of everything produced within a country and is used a measurement of a country’s economic status and growth."}, {"word": "geotus", "def": "GEOTUS is an acronym standing for \"God Emperor of the United States,\" used to reference Donald Trump. It is mainly used by his supporters in a semi-joking way."}, {"word": "gfg", "def": "GFG is an acronym that means good fucking game, and it is used sarcastically in online gaming. A more sincere version is GG, or good game."}, {"word": "gftow", "def": "GFTOW is an acronym that means go fuck/find ten other women. It's used in the \"manosphere\" and by self-identified pick up artists as a method of forgetting a woman who is causing emotional pain."}, {"word": "ggg", "def": "GGG is an abbreviation for “good, giving, and game.” The acronym refers to the advice that those seeking healthy sexual relationships should strive to be good in bed, willing to give equal time and energy to their partner’s pleasure, and game for anything (within reason)."}, {"word": "gilf", "def": "Grandma, what big, um, eyes you have ... GILF usually stands for Grandmother I'd Like to Fuck, less often Grandfather I'd Like to Fuck. Outside its use as a porn genre, it can be meant as a compliment or used as a cruel joke about older women."}, {"word": "gmfu", "def": "GMFU is an internet slang acronym that means got me fucked up. It's used when something has you all out of sorts and feeling a lot of feels, usually negative ones."}, {"word": "gmh", "def": "GMH is an acronym standing for gives me hope. It grew in popularity with the now defunct site givesmehope.com, which was made in response to other popular site and acronym FML (fmylife.com)."}, {"word": "gmt", "def": "GMT is short for Greenwich Mean Time, an international reference point for time zones."}, {"word": "gno", "def": "GNO is an acronym that means girls' night out. It's occasionally used to mean guys' night out."}, {"word": "gomd", "def": "GOMD is an acronym for get off my dick, meaning \"get off my back,\" or \"get lost.\" GOMD is also the name of a popular 2014 song by rapper J.Cole that may have helped popularize the acronym."}, {"word": "gomi", "def": "An acronym for “Get Off My Internets,” GOMI is a blog and message board notorious for its sharp and often cruel criticism of lifestyle bloggers."}, {"word": "gote", "def": "GOTE is the acronym for an eSports charity based in Tampa, Florida called Gamers on the Edge."}, {"word": "goty", "def": "GOTY is an acronym used in the gaming community and industry. It means Game of the Year. This is typically a list or a single game named at the end of the year by publications or fans of video-game entertainment."}, {"word": "gtfo", "def": "Gtfo is an internet slang acronym meaning “Get the fuck out.” It is used, with varying degrees of force and humor, to dismiss someone or something. It’s also used to express disbelief."}, {"word": "gtg", "def": "GTG is an acronym for got to go, going to go, or good to go."}, {"word": "gtl", "def": "GTL is an acronym that defines a daily ritual of gym, tan, laundry. It originated on the reality television show The Jersey Shore, and is occasionally alluded to in the online \"manosphere\" or the world of men focused on picking up women."}, {"word": "hamb", "def": "The H.A.M.B. is an internet forum dedicated to creating and modifying hot rods, classic cars modified for speed."}, {"word": "h t", "def": "The acronym H/T (also sometimes used without the diagonal slash) means hat tip, or tip of the hat—a way of recognizing the original source of a meme, expression, image, or idea on social media."}, {"word": "h2p", "def": "H2P is an acronym used by supporters of the University of Pittsburgh, meaning Hail to Pitt. Hail to Pitt is also a name for their spirit song at sporting events."}, {"word": "hb", "def": "HB is an acronym used in male-dominated online arenas to mean hot babe. It may sometimes be used with a number between 1 and 10 to indicate \"hotness.\""}, {"word": "hbcu", "def": "HBCU stands for historically black colleges and universities, which were established before the landmark Civil Rights Act in 1964 with the ongoing mission of educating black Americans."}, {"word": "hbd", "def": "HBD is an acronym for Happy Birthday. It's often seen as a lazy way of messaging someone on their birthday."}, {"word": "hbic", "def": "HBIC is an acronym meaning Head Bitch in Charge."}, {"word": "hmd", "def": " HMD is a slang acronym standing for hold my dick."}, {"word": "hmk", "def": "HMK is an acronym that means hit my Kik. Kik is an anonymous messaging app."}, {"word": "hml", "def": "HML is an internet acronym short for hate my life or hit my line."}, {"word": "hmp", "def": "HMP is an acronym that means both hit my phone and help me please."}, {"word": "hmu", "def": "Hmu is an abbreviation for the phrase “hit me up.” It’s a request for social invitation, often posted online to announce that you’re looking for something to do and to encourage others to reach out to you. In a one-on-one exchange, it’s an invitation for continued contact, meaning “text me” or “call me” or simply “let’s talk again.”"}, {"word": "hoco", "def": "HOCO is an acronym used for homecoming, as in a high-school homecoming dance. It has also been used to refer to the film Spider-Man: Homecoming."}, {"word": "hru", "def": "HRU is an acronym meaning how are you? The R in HRU is shorthand for the word are."}, {"word": "hwp", "def": "In the online dating world, HWP means height weight proportionate."}, {"word": "hxc", "def": "HXC (sometimes stylized as hXc) is an acronym meaning hardcore. It can be used in reference to the music genre and the people who listen to it."}, {"word": "hyb", "def": "HYB is a textspeak acronym standing for two phrases: how you been? and handle your business."}, {"word": "hyu", "def": "HYU is slang acronym meaning hit you up. It is used in both texting and on social media. It's the counterpart to HMU (hit me up)."}, {"word": "ib", "def": "IB is an acronym that stands for International Baccalaureate. IB (formerly IBO) is a foundation in Geneva, Switzerland, that develops international education programs for children between the ages of 3 and 19."}, {"word": "ibm", "def": "IBM stands for International Business Machines, a multinational computer and information technology company."}, {"word": "ice", "def": "ICE is an acronym that stands for \"(United States) Immigration and Customs Enforcement.\""}, {"word": "ico", "def": "ICO is an acronym that means Initial Coin Offering, which is how funds are raised for a new cryptocurrency offering. It's similar to an IPO (Initial Public Offering) which raises funds when a new company ventures onto the stock market."}, {"word": "idek", "def": "IDEK is an acronym used in texting and social media that means I don't even know. It expresses sheer puzzlement over something that seems inexplicable."}, {"word": "idgt", "def": "IDGT is an acronym that means I don't get tired. Its popularity was boosted by the 2014 Kevin Gates song, \"I Don't Get Tired (IDGT).\" Gates also created an energy drink with the same name in 2015."}, {"word": "idm", "def": "IDM is an acronym for intelligent dance music, a genre of electronic music that is more complex than simple dance music."}, {"word": "idr", "def": "IDR is a textspeak acronym standing for I don't remember."}, {"word": "idts", "def": "IDTS is an acronym that means I don't think so. It's used in social media and texting to convey sarcasm."}, {"word": "ify", "def": "IFY is an acronym for I feel you. It's occasionally used for I forgive you."}, {"word": "ig", "def": "Online, IG can stand for I guess or Instagram."}, {"word": "ihy", "def": "IHY is an internet acronym that often stands for I hate you ... typically used with irony. "}, {"word": "iirc", "def": "As an internet slang term and an acronym, IIRC is short for “if I recall correctly” or “if I remember correctly.”"}, {"word": "ijs", "def": "IJS is a textspeak acronym standing for I'm just saying. It is often used after a differing opinion or blunt truth the user has just given."}, {"word": "ikea", "def": "IKEA is the name of a popular Scandinavian-founded, worldwide furniture store. The acronym that makes up the name stands for Ingvar Kamprad (the founder's name), Elmtaryd (the farm where the founder grew up), and Agunnaryd (the founder's hometown)."}, {"word": "imao", "def": "IMAO is an internet acronym for in my arrogant opinion and is usually used with a sense of irony or self-deprecation."}, {"word": "imdb", "def": "IMDB is the acronym for the Internet Movie Database, or imdb.com, a website that contains general information about movies, ratings, and industry members."}, {"word": "imho", "def": "IMHO is an acronym used mostly in texting, email, and social media that means in my humble opinion. It was first used in the 1980s in online forums, and decades later, some began erroneously attributing the H to the word honest."}, {"word": "imig", "def": "IMIG is an acronym used in social media and texting that stands for I mean, I guess. It's similar to \"Well, if you say so,\" implying doubt of a statement. It can also imply apathy. It's often used as a hashtag."}, {"word": "infp", "def": "INFP is one of the 16 personality types within the Myers-Briggs Type Indicator. The letters stand for introverted, intuitive, feeling, and perspective. People who test into this type are thought to be sensitive, creative, idealist, and classified as dreamers."}, {"word": "ishygddt", "def": "&gt;current year &gt;not knowing internet acronyms &gt;ISHYGDDT"}, {"word": "isk", "def": "ISK stands for InterStellar Kredits, the in-game currency of the online role-playing game EVE Online."}, {"word": "istg", "def": "ISTG is an acronym that means I swear to God. It can be used to convey extreme seriousness, exasperation, or surprise, and is usually used outside of a serious religious context."}, {"word": "jfc", "def": "JFC (jfc) is a vulgar slang initialism that stands for “jesus fucking christ.” It’s usually used as an exasperated exclamation in times of frustration or for emotional emphasis in a variety of informal contexts, especially in digital communication."}, {"word": "jkl", "def": "JKL is an acronym that means just kidding loser, or just kidding LOL (or just kidding laugh)."}, {"word": "joi", "def": "An acronym for “jerk-off instructions,” joi is a category of pornographic audio or video content featuring a woman giving explicit instructions to a male viewer or listener on how to masturbate."}, {"word": "jomo", "def": "JOMO is an acronym for joy of missing out and describes the pleasure of taking a break from social activity–especially social media–to enjoy personal time."}, {"word": "js", "def": "JS is short for just sayin.' It's used to put emphasis on a stated opinion or fact ... JS."}, {"word": "jw", "def": "JW is a textspeak acronym standing for just wondering."}, {"word": "khhv", "def": "KHHV is an acronym standing for kissless, handholdless, hugless virgin. This is used primarily in the incel community, a group of men who are \"involuntarily celibate.\""}, {"word": "kmsl", "def": "KMSL is an acronym used in chat and messaging for killing myself laughing. It is often used as a hashtag to mark a funny moment."}, {"word": "kotd", "def": "KOTD is an acronym that stands for kicks of the day. In this context, kicks refers to shoes."}, {"word": "kys", "def": "KYS is an internet acronym standing for “kill yourself,” used as a taunt or form of harassment issued after someone has done something considered embarrassing or pathetic."}, {"word": "lc", "def": "L&amp;C is short for like and comment, and is widely used on Instagram."}, {"word": "lbnl", "def": " LBNL is a textspeak acronym standing for the phrase last but not least."}, {"word": "lbs", "def": "LBS is a textspeak acronym standing for laughing but serious."}, {"word": "ldk", "def": "LDK is an acronym standing for the Lenadoon Dog Killers, a youth gang in Belfast, Ireland."}, {"word": "ldw", "def": "LDW is an acronym for a type of insurance coverage that means Loss Damage Waiver."}, {"word": "lel", "def": "Lel is a playful or ironic variation of the common internet acronym LOL or lol, for laugh out loud."}, {"word": "lgo", "def": "LGO is an acronym that means life goes on. It is often used as a hashtag."}, {"word": "lgtm", "def": "LGTM is an acronym meaning looks good to me, frequently used when reviewing documents."}, {"word": "lhh", "def": "LHH is an acronym that stands for laughing hella hard."}, {"word": "lhm", "def": "LHM is a acronym used in text and social media that means Lord have mercy! It can be used in a spiritual sense, or ... not."}, {"word": "llf", "def": "LLF is a texting acronym that means laughing like fuck."}, {"word": "llh", "def": "LLH is a textspeak acronym for laughing like hell."}, {"word": "lmk", "def": "LMK is an acronym meaning Let Me Know."}, {"word": "lml", "def": "LML is an internet slang acronym standing for, depending on context, laughing mad loud or love my life."}, {"word": "lmp", "def": "LMP is an acronym used on social-media sites like Facebook, Twitter, and Instagram that stands for like my picture, like my post, or like my profile."}, {"word": "lmr", "def": "LMR is an acronym frequently used in the incel community. Meaning last minute resistance, it is what they've named the moment a woman revokes her consent to sexual activity, usually just before the event."}, {"word": "lmy", "def": "LMY is a textspeak acronym standing for love and miss you."}, {"word": "lol", "def": "LOL is an acronym meaning Laugh Out Loud. It is used to denote humor on social media or in text communication. LOL can also be used as the acronym for the popular game League of Legends."}, {"word": "lpt", "def": "LPT is an acronym meaning Life Pro Tip. LPT is most often used before giving simplified advice meant to make life easier."}, {"word": "lya", "def": "LYA is a textspeak acronym used for love you always or love you all."}, {"word": "mbn", "def": "MBN is an acronym that means must be nice. It can be meant as a serious reminder to be polite or as a way of expressing dissatisfaction or envy. It's often used as a hashtag."}, {"word": "mcm", "def": "Man Crush Monday refers to a social media trend dedicated to posting pictures of and expressing affection for attractive or admirable men on Mondays."}, {"word": "mf", "def": "MF can stand for many things: mutual friends, Millennium Falcon, mezzo forte, mad flow, and medium frequency, to name a few. But we're pretty sure you came here for its most common meaning: motherfucker or motherfucking."}, {"word": "mff", "def": "In the furry community, MFF is an acronym standing for the Midwest FurFest, one of the largest furry conventions in the world."}, {"word": "mfw", "def": "The acronym mfw is short for my face when. It often appears in a single sentence or in a story, followed by a reaction image that communicates how the poster feels."}, {"word": "mgtow", "def": "MGTOW is an acronym for Men Going Their Own Way, an online social movement and backlash to feminism where men renounce interactions with women and seek to define and live out their masculinity on their own terms."}, {"word": "milf", "def": "MILF is an acronym that stands for Mom I'd Like to Fuck, which is often said by teenage boys about their friends' attractive mothers or just about women in general who are considered of middle age."}, {"word": "mmsl", "def": "MMSL is an acronym meaning married man sex life. It is the website for marital coach Athol Kay, and it is widely read by those in the incel community."}, {"word": "moab", "def": "MOAB is an acronym referring to a large bomb in the US military, the Massive Ordnance Air Blast or Mother of All Bombs."}, {"word": "moc", "def": "MOC is an acronym that means masculine of center. It refers mostly to lesbians and trans men and women who tilt toward the masculine side of the gender scale."}, {"word": "mra", "def": "MRA is an acronym that stands for men's rights activism (or activist), an anti-feminist movement which argues that men are discriminated against in society."}, {"word": "mrw", "def": "MRW is a textspeak acronym used on the internet, often in conjunction with an image or GIF, that means my reaction when."}, {"word": "msm", "def": "MSM means \"mainstream media.\" It is often used to describe media outlets, like newspapers and news shows, that are widely viewed and accepted by most people and that are generally seen as reliable. Some people believe they are all skewed either right or left, in terms of political viewpoints, but they all claim to be neutral."}, {"word": "mua", "def": "MUA is an acronym found mostly on social media that means makeup artist."}, {"word": "mwf", "def": "MWF is an acronym that stands for married white female. It is often used in personal ads, message boards, and chat rooms."}, {"word": "nawalt", "def": "NAWALT is an acronym that means not all women are like that. It's used in the \"manosphere,\" by self-identified pick up artists and incel members as a way of defining a seemingly perfect woman."}, {"word": "ndn", "def": "NDN is a shortening of Native Indian. This is usually used by Native Americans in the United States to refer to themselves."}, {"word": "nfg", "def": "NFG is an acronym standing for American rock band New Found Glory."}, {"word": "nfsw", "def": "NFSW is an acronym used in texting, email, and elsewhere online, meaning not for showing wife. It's used to imply something sexual or offensive in some way to women, or something that would be offensive to the recipient's wife."}, {"word": "nfw", "def": "NFW is an acronym that means no fucking way, to express disbelief or an adamant point of view."}, {"word": "nm", "def": "NM is internet slang for not much or nevermind."}, {"word": "nmu", "def": "NMU is an acronym used to mean Not much, you. It's used in reply to the question, \"What's up?\" or \"What are you doing?,\" often expressed as WYD (what you doing)."}, {"word": "nola", "def": "NOLA is short for New Orleans, Louisiana."}, {"word": "npo", "def": "NPO is a medical term that means “(take) nothing by mouth.”"}, {"word": "nsips", "def": "NSIPS is an acronym for the Navy Standard Integrated Personnel System, an electronic personnel system for all USN/USNR Sailors."}, {"word": "nsv", "def": "NSV is an acronym typically used on weight loss forums, meaning non-scale victory."}, {"word": "nvm", "def": "NVM is an acronym that means never mind. It's often used as a hashtag."}, {"word": "oc", "def": "The acronym OC can stand for all kinds of things: Orange County (California), original character, OxyContin, of course, offensive coordinator, officer commanding, and original content ... you name it, OC stands for it."}, {"word": "ofc", "def": "OFC, short for Original Female Character, refers to a female character in a fanwork that doesn’t exist in the source material, and is instead invented by the creator of the fanwork."}, {"word": "ofn", "def": "OFN is a slang acronym meaning on foe and 'nem (enemies), as \"I swear on my foes and enemies.\" It also stands for oh fuck no or naw."}, {"word": "oml", "def": "OML is an acronym in texting that means oh my Lord, and it's also a social-media hashtag for the Linkin Park song, \"One More Light.\""}, {"word": "omsn", "def": "OMSN is used by Grateful Dead fan's (or Deadheads), to refer to their song \"One More Saturday Night.\""}, {"word": "omw", "def": "OMW is an acronym that means on my way. It can also be used to imply that a person is moving toward a goal, an event, or an adventure of some kind."}, {"word": "omw2fyb", "def": "OMW2FYB is a joke acronym and meme standing for on my way to fuck your bitch. It's perfect for making your whereabouts known."}, {"word": "ontd", "def": "ONTD, an acronym for Oh No They Didn’t, is a celebrity gossip community on the blogging platform LiveJournal."}, {"word": "onw", "def": "ONW is an acronym that is used to mean omit needless words, used by editors or anyone making suggestions on a piece of writing."}, {"word": "ooc", "def": "OOC is an acronym that stand for out of character. It is often used in role-playing when a person wants to break character or in fanfiction when a writer is expressing concern that a character was not himself in a certain scene or instance of dialogue. The opposite of OOC is BIC (back in character). Sometimes, it stand for out of context, as well."}, {"word": "oomf", "def": "Oomf is an acronym standing for “one of my friends” or “one of my followers.” This is a way to mention someone without directly naming them."}, {"word": "oop", "def": "OOP has several meanings."}, {"word": "oos", "def": "OOS is an acronym most commonly meaning out of stock. In some cases it can also be out of service."}, {"word": "ootd", "def": "Ootd, an internet abbreviation for outfit of the day, refers to what someone’s wearing on a particular day, usually in the context of fashion blogging. It can also mean a particularly fashionable outfit, or the photoshoot involved in taking an ootd photo for a social network."}, {"word": "opp", "def": "OPP is an acronym that refers to sexual infidelity, meaning other people's pussy. It is the title and topic of a 1991 song by the rap group Naughty by Nature."}, {"word": "osrs", "def": "OSRS is a slang acronym that means on some real shit, implying something along the lines of \"for real.\""}, {"word": "otf", "def": "OTF is an acronym often used in social media that means only the family."}, {"word": "oti", "def": "OTI is a textspeak acronym for on the internet."}, {"word": "otp", "def": "OTP, which stands for One True Pairing, is a term that signifies a person’s favorite fictional romantic relationship."}, {"word": "otr", "def": "OTR is an acronym that can be used in two ways."}, {"word": "ottno", "def": "OTTNO is an acronym that stands for On To The Next One, expressing a sense of resilience or aspiration for continued success."}, {"word": "otw", "def": "OTW is a textspeak acronym for on the way."}, {"word": "pawg", "def": "Pawg stands for phat ass white girl. In this context, phat is an alternative slang spelling for fat. A pawg is a woman who has a big—though it’s not necessarily fat—butt."}, {"word": "pch", "def": "PCH is an acronym that is used for several things: reference to the Pacific Coast Highway in California and also Publisher's Clearing House. In real-estate listings, PCH indicates a price change."}, {"word": "pfp", "def": "PFP is an acronym in texting and social media. It means both picture for proof and profile pic."}, {"word": "pmo", "def": "PMO is an internet slang acronym for pisses me off, and its different verb forms."}, {"word": "pmoys", "def": "If you're looking to extend your popularity by showing how you're buddy-buddy with someone cool or just want to feel the love from a friend, you might tell them to PMOYS."}, {"word": "pmsl", "def": "PMSL is internet textspeak for pissing myself laughing. It is more commonly used among those who speak British English."}, {"word": "pnw", "def": "PNW is an acronym for Pacific Northwest, which includes Oregon, Washington, Idaho, and British Columbia in Canada."}, {"word": "po", "def": "PO is an acronym that has several popular meanings. It can refer to a police officer, a parole officer, or a probation officer. And then there's the post office."}, {"word": "poms", "def": "POMS is an acronym standing for prisoners of mother England ... it's what Australians sometimes call the British."}, {"word": "pos", "def": "POS is an acronym most commonly used to mean piece of shit. "}, {"word": "potus", "def": "POTUS is an acronym for President of the United States."}, {"word": "ppu", "def": "PPU is an acronym common on reselling sites like Craigslist that stands for pending pick up. It is used to notate that while an item has been promised to a buyer, if they do not pick it up it will be put up for sale again."}, {"word": "psl", "def": "PSL is short for pumpkin spice latte. This seasonal caffeinated drink is typically sold at Starbucks during fall, featuring autumnal flavors such as cinnamon and nutmeg."}, {"word": "ptl", "def": "PTL is an acronym used in texting and social media that means praise the Lord. It can be used religiously, or as a way of saying finally! or hallelujah!"}, {"word": "pwo", "def": "In the fitness world, PWO refers to post-workout ... or the drink mix PWO (pre workout energy and focus activator) by Efectiv."}, {"word": "pyt", "def": "PYT is an acronym standing for pretty young thing, popularized by the Michael Jackson song \"P.Y.T (Pretty Young Thing).\""}, {"word": "qvc", "def": "QVC is the name of an American broadcast television network and channel that offers the viewer a televised, in-home shopping experience. The acronym stands for Quality Value Convenience."}, {"word": "qwop", "def": "QWOP is a notoriously challenging Flash computer game in which the user controls a runner using the keys q, w, o, and p."}, {"word": "rbf", "def": "RBF is an acronym that means resting bitch face, a term that refers to a woman's face when she is thinking, resting, or simply not trying to look pleasant. Many consider it an offensive, sexist concept and term."}, {"word": "rih", "def": "RIH is a textspeak acronym used on the internet for rot in hell or rest in heaven."}, {"word": "rino", "def": "RINO stands for “Republican in Name Only,” used by Republicans to accuse other Republicans of being insufficiently conservative."}, {"word": "rko", "def": "RKO is a wrestling move famously performed by professional wrestler Randy Orton."}, {"word": "rns", "def": "RNS is an acronym that stands for real nigga shit. It can be used when someone is trying to express that what they are saying is truth or legit."}, {"word": "rotf", "def": " ROTF is a textspeak acronym meaning to roll on the floor in laughter. Some people say this version (instead of ROFL) means there is no laughter involved."}, {"word": "sad", "def": "SAD is an acronym for Seasonal Affective Disorder, a type of depression most often exacerbated by the fall and winter seasons and their darker days."}, {"word": "sb", "def": "Short for snapback, SB is used on social media platform Snapchat for when you want a user to respond back to a snap, or \"message.\""}, {"word": "sbf", "def": "SBF is an acronym used for both straight best friend and single black female."}, {"word": "scotus", "def": "SCOTUS is an acronym for Supreme Court of the United States."}, {"word": "sfb", "def": "SFB is an acronym with a few meanings. When used in textspeak, it means shit for brains."}, {"word": "sfs", "def": "SFS is an acronym with a few different meanings."}, {"word": "shtf", "def": "Any responsible person tries to be ready in case of emergency, but only a true prepper is ready for when SHTF. That is, when shit hits the fan. At the very least, they've probably got a six-month stockpile of canned beans."}, {"word": "sil", "def": "SIL is an acronym for sister-in-law and son-in-law."}, {"word": "sjw", "def": "SJW is an acronym that means social justice warrior."}, {"word": "sm", "def": "While SM can refer to many things, three prominent meanings are sadomasochism, the South Korean entertainment company SM Entertainment, and the internet slang so much."}, {"word": "smbt", "def": "SMBT is a textspeak acronym standing for suck my big toe, usually used when you've had enough of someone."}, {"word": "smh", "def": "Standing for shaking my head, SMH is an internet slang initialism variously used to convey disappointment, disapproval, frustration, or impatience."}, {"word": "smilf", "def": "SMILF, a take on MILF, stands for Single Mother I’d Like to Fuck. It also serves as the name of a TV comedy starring Frankie Shaw and Rosie O'Donnell."}, {"word": "sml", "def": "SML is an online and texting acronym that means various things. It can mean screw my life, so much love, or sometimes so much laughter."}, {"word": "smp", "def": "SMP is an acronym for the term sexual marketplace, and is often used in male-dominated conversations, or in the \"manosphere.\""}, {"word": "smth", "def": "SMTH is short for something. It's one of many words that have been shortened from texting, similar to brb for \"be right back\" and ty for \"thank you.\""}, {"word": "smud", "def": "The Sacramento Municipal Utility District, or SMUD, is no ordinary electric company. Formed by the citizens of Sacramento County, California, SMUD is community-owned, long reputed for its efforts to use renewable energies."}, {"word": "snm", "def": "SNM is an acronym that means say no more, meaning it would be pointless or unnecessary to say anything more."}, {"word": "sohcahtoa", "def": "SOHCAHTOA is a mnemonic device used to remember the ratios of sine, cosine, and tangent in trigonometry."}, {"word": "soml", "def": "SOML is an acronym in text and chatting that means story of my life. It can imply either good or bad things."}, {"word": "srsly", "def": "SRSLY is a textspeak acronym used to shorten the incredulous-toned or hyperbolic seriously."}, {"word": "ssbbw", "def": "SSBBW is an acronym for super-sized, big, beautiful woman. The acronym and hashtag are generally used in social media and online for personal ads ... but Twitter hashtags generally led to porn sites ..."}, {"word": "stfu", "def": "The acronym STFU stands for shut the fuck up. It's often used when people are angry or upset with someone, usually online."}, {"word": "swag", "def": "The acronym swag means stuff we all get, and it usually refers to free promotional or marketing items. Yup, it's an acronym!"}, {"word": "swerf", "def": "SWERF is an acronym standing for Sex Worker-Exclusionary Radical Feminist, a label for a woman who supports mainstream feminism but opposes sex work, believing it is ultimately oppressive."}, {"word": "swm", "def": "SWM is an acronym standing for straight white male or men, which gained popularity after comedian Josh Denny proclaimed it to be \"this century's N-word.\" Many condemned this comparison."}, {"word": "syl", "def": "SYL is a texting acronym that means see ya later."}, {"word": "tbc", "def": "TBC is an acronym that means both to be confirmed and to be continued. "}, {"word": "tbf", "def": "TBF is a texting and social media acronym that can mean to be fair or frank, as well as throwback Friday. Throwback Friday is a term that refers to posting or recalling something from the past, often from one's personal history, such as a grade school photo or wedding day memory."}, {"word": "tbr", "def": "TBR is an acronym that stands for to be read. Many people use it to refer to their reading lists."}, {"word": "tct", "def": "TCT is often used as a hashtag and it means total crush Tuesday."}, {"word": "tdh", "def": "TDH is an acronym that means tall, dark, and handsome. It's mostly used jokingly."}, {"word": "tds", "def": "TDS is an acronym for Trump Derangement Syndrome, a term applied to people who express deep loathing and fear of President Donald Trump. It's usually used by Trump supporters for liberals."}, {"word": "terf", "def": "TERF is an acronym for \"trans-exclusionary radical feminism\" or \"trans-exclusionary radical feminist.\""}, {"word": "tf", "def": "TF stands for the fuck, a handy, all-purpose internet swear for questions, exclamations, and declarations. It's often used on its own to show emotions like disbelief or disgust."}, {"word": "tfti", "def": "TFTI is a texting and social-media acronym that means thanks for the invite, and is usually used sarcastically, when someone has not been invited."}, {"word": "tftl", "def": "TFTL is a text and chat acronym that means thanks for the link, used after receiving a website link."}, {"word": "tfw", "def": "tfw or that feel when is an expression that people use to frame a statement and express their emotions. These can range from relatable to not so relatable situations. It places emphasis on the emotional content of the sentence. Typically, it can be used to highlight awkward, ridiculous, uncomfortable, annoying, or odd things that happen to someone."}, {"word": "tkm", "def": "TKM is from the Spanish \"te quiero mucho,\" which is a friendly way of expressing affection, similar to love ya!. Here, in texting slang, \"quiero\" becomes \"kiero.\""}, {"word": "tldr", "def": "Tl;dr stands for \"too long; didn't read.\""}, {"word": "tmls", "def": "TMLS is an acronym used to shorten the word timelines, as used on Twitter or other social-media sites."}, {"word": "tmr", "def": "TMR is a shortening of the word tomorrow, used mostly on the internet."}, {"word": "tna", "def": "TNA is an acronym for Total Nonstop Action Wrestling (now renamed Impact Wrestling), an American professional wrestling promotion."}, {"word": "tpb", "def": "TPB is an acronym for The Pirate Bay, an online index of digital entertainment files (movies, games, etc.) available for free downloading. The legality of the site is always under scrutiny, and it is widely considered to bend or break copyright laws."}, {"word": "tpp", "def": "TPP is an acronym for the Trans Pacific Partnership trade deal, a proposed agreement between 12 Pacific Rim countries and the US. As of 2017, Trump has pulled the US out of this trade partnership. The rest of the countries in the deal have forged ahead with the trade terms under the name Comprehensive and Progressive Trans-Pacific Partnership (CPTPP)."}, {"word": "tsa", "def": "TSA is the acronym for the Transportation Security Administration, an American governmental agency that is responsible for travel safety, especially air travel."}, {"word": "ttc", "def": "TTC is an acronym mainly used for the Toronto Transit Commission. On fertility discussion spaces, it is also used for trying to conceive. "}, {"word": "ttg", "def": "TTG is textspeak for trained to go, as in ready to fight, or argue, at any notice."}, {"word": "twd", "def": "TWD is an acronym that stands for The Walking Dead. The Walking Dead is a popular TV series on AMC."}, {"word": "twf", "def": "TWF is an acronym that means that was funny or that was fun."}, {"word": "ty", "def": "TY is an acronym meaning Thank You."}, {"word": "ucla", "def": " UCLA is an acronym abbreviating the University of California, Los Angeles."}, {"word": "ufc", "def": "UFC is an acronym standing for the Ultimate Fighting Championship, an American mixed martial arts organization."}, {"word": "uya", "def": "UYA is an acronym that refers to the online game Ratchet &amp; Clark: Up Your Arsenal."}, {"word": "vbg", "def": "VBG is a textspeak acronym for very big grin. It is sometimes stylized as &lt;vbg&gt; or *vbg* when used in roleplaying games or sites like World of Warcraft."}, {"word": "vgl", "def": "VGL is an acronym that stands for very good looking. It's commonly seen on dating websites."}, {"word": "wb", "def": "WB is a slang acronym for would bang. It gets a lot of usage in the incel community."}, {"word": "wby", "def": "WBY is a text and chat acronym that means what about you? (or what 'bout you?)."}, {"word": "wce", "def": "WCE is an acronym and hashtag used on social media standing for Woman Crush Everyday, named after Woman Crush Wednesday."}, {"word": "wcw", "def": "WCW is an acronym and hashtag frequently used on the internet to mean Woman Crush Wednesday."}, {"word": "wfh", "def": "WFH is a text and social-media acronym that means working or work from home."}, {"word": "wih", "def": "WIH is an acronym that can mean when I'm high and can also refer to women in horror. The latter is frequently seen on Twitter as a hashtag, referring to women involved in the horror film business."}, {"word": "wiw", "def": "WIW is an acronym used in social media that means what I wore. It's used by people interested in fashion and is usually used to document their daily style."}, {"word": "wlw", "def": "WLW is an acronym that stands for either woman-loving-woman or women who love women. It is used by the LGTBQ+ community for a relationship involving two female presenting people."}, {"word": "woc", "def": "WOC is an acronym standing for women of color, in terms of race and ethnicity."}, {"word": "wod", "def": "WOD is an acronym used for the NBC television show World of Dance, and also for workout of the day in reference to CrossFit training."}, {"word": "womp", "def": "WOMP has several meanings."}, {"word": "wrol", "def": "WROL stands for Without Rule of Law, doomsday prepper lingo for the complete breakdown of governance after a major environmental or other disaster. On a less dystopian note, is also the call sign for a Boston-area radio station."}, {"word": "wtd", "def": "WTD is an internet slang acronym used for what to do, as in what to do about a situation or what to do with the poster's time."}, {"word": "wtp", "def": "WTP is a textspeak acronym for what's the plan? or what's the play? It's usually used for an evening outing."}, {"word": "wtv", "def": "WTV is short for whatever, and it is used in texting and chat to imply not caring, being bored, or just being uninspired."}, {"word": "wtw", "def": "WTW is a textspeak acronym used to ask what's the word, meaning what's up. It can also mean what the what, kind of like what the fuck."}, {"word": "wwe", "def": "WWE stands for World Wrestling Entertainment, an American media company. #WWE is their handle on Twitter."}, {"word": "wwtd", "def": "WWTD is a social-media acronym that can mean What would Tebow do? (in reference to the NFL quarterback Tim Tebow), or it can be used with other famous names, such as (President) Trump or the character Titus (from the Netflix show Unbreakable Kimmy Schmidt), or really any T name."}, {"word": "wwwy", "def": "WWWY is used on the internet to talk about Adele's 2016 song \"When We Were Young.\" It is also used for other songs that bear the same name."}, {"word": "wya", "def": "WYA is an acronym that means where you at, and it is used mostly in texting and social media."}, {"word": "wyd", "def": "Wyd is a texting and internet acronym that stands for What (are) you doing? or What (would) you do?"}, {"word": "wym", "def": "WYM is an acronym for what you mean, as in  what do you mean? It is used mostly in texting and social media."}, {"word": "wys", "def": "WYS is an acronym that means what you sayin'?."}, {"word": "wywta", "def": "WYWTA is a textspeak acronym that means what you wanna talk about? It was mostly used in IM (the good ol' days), but continues to be used over text messaging."}, {"word": "xox", "def": "XOX, or XOXO, means hugs and kisses, with the x representing kisses and the o representing hugs. It's usually used as a lighthearted way of expressing affection, sincerity, or deep friendship."}, {"word": "ymcmb", "def": "YMCMB is an acronym that stands for Young Money Cash Money Billionaires. It is used to refer to the artists represented by Young Money Entertainment and Cash Money Records, such as Lil Wayne and Drake, and their respective lifestyles."}, {"word": "yot", "def": "YOT is an acronym for Youth Offending Team, a crime prevention program in England and Wales for at-risk youth."}, {"word": "ytb", "def": "YTB is a shortening of the name of video-content website Youtube. It can also be used to say you're the best."}]}