{"definition": [{"word": "ad hoc", "def": "Something ad hoc is put together on the fly for one narrow or pressing purpose. For example, a government committee arranged to address one specific problem, would be an ad hoc committee. More loosely, it can mean \"spontaneous,\" \"unplanned,\" or \"on the spot.\""}, {"word": "adderall high", "def": "An Adderall high refers to the energetic, focused feeling people get when they use (or abuse) the ADHD stimulant Adderall. 🙇"}, {"word": "adulting", "def": "Adulting is an informal term to describe behavior that is seen as responsible and grown-up. This behavior often involves meeting the mundane demands of independent and professional living, such as paying bills and running errands."}, {"word": "afternoon delight", "def": "Afternoon Delight is the name of a 1976 song by the Starland Vocal Band. The song, which contains innuendo about casual daytime sex (or an afternoon delight) was a hit. Because of the song’s popularity, afternoon delight has become well-recognized as a term for a midday sexual encounter, often between or instead of scheduled events."}, {"word": "aggy", "def": "Aggy is a slang term that means \"aggravated\" or \"aggravating\" ... like \"irritated\" or \"irritating.\""}, {"word": "alpha", "def": "Alpha refers to a dominant person or their behavior, especially with respect to socially aggressive, hyper-masculine men. Some dudebros see alpha as a compliment and aspiration. Others people see right into the small, sad, insecure hearts of the trying-too-hard alpha."}, {"word": "alpha female", "def": "An alpha female is a powerful and successful woman, often in a leadership role. Alpha females are often described as intimidating by men and women alike."}, {"word": "alternative facts", "def": "Alternative facts have been called many things: falsehoods, untruths, delusions. A fact is something that actually exists—what we would call “reality” or “truth.” An alternative is one of the choices in a set of given options; typically the options are opposites of each other. So to talk about alternative facts is to talk about the opposite of reality (which is delusion), or the opposite of truth (which is untruth)."}, {"word": "amirite", "def": "Amirite is an internet slang spelling of the rhetorical tag question am I right? Amirite is often sarcastic in tone, amirite?"}, {"word": "amourshipping", "def": "Amourshipping refers to fan theories, fiction, and art about a romantic relationship between the characters Ash and Serena in the anime series Pokémon."}, {"word": "an hero", "def": "An hero is used by the dark parts of the internet as a mocking synonym for the act of suicide or for someone who has died by suicide."}, {"word": "anchor baby", "def": "An anchor baby is a child who was purposefully brought while in the womb to the United States by a foreigner so that they would receive US citizenship upon their birth. It is widely considered to be an offensive term to immigrants, especially Asian-Americans."}, {"word": "anime freak", "def": "Anime freak is a term applied to people who are extreme fans of Japanese cartoons, called anime."}, {"word": "another one", "def": "Started as a catchphrase by popular music producer and media personality DJ Khaled, another one is a humorous way of repeatedly asking for another of something."}, {"word": "ard", "def": "For those residing in Philadelphia, ard is slang for \"alright.\""}, {"word": "arms", "def": "Arms are literally the appendages most people have on either side of their bodies, bet you didn't know that ..."}, {"word": "asdf", "def": "Asdf are the first four letters from the left in the home row on a QWERTY keyboard, often used as filler text when typing or programming or to express high emotion as a “keysmash.”"}, {"word": "asdfmovie", "def": "Pronounced “ass-duff movie,” asdfmovie is a quirky, online, animated series starring simple, stick figures with emoticon-inspired faces."}, {"word": "asmr", "def": "Autonomous sensory meridian response (ASMR) is a calming, pleasurable feeling often accompanied by a tingling sensation. This tingle is said to originate in a person’s head and spread to the spine (and sometimes the limbs) in response to stimulation. The stimuli that trigger ASMR vary from person to person. Some of the most common ones include whispers, white noise, lip smacking, having a person’s complete attention (as in having one’s hair cut by a hairdresser), as well as brushing, chewing, tapping, scratching, and crinkling."}, {"word": "assalamu alaikum", "def": "Assalamu alaikum literally means “peace be upon you.” It is used as a greeting within Muslim communities."}, {"word": "asshat", "def": "Asshat is a vulgar slang term for a stupid, obnoxious, or contemptible person, used much like the word asshole. "}, {"word": "at a glance", "def": "At a glance means \"with a brief look,\" mostly used to indicate that content is a quick and handy snapshot of its fuller, more complicated whole."}, {"word": "awesomesauce", "def": "Awesomesauce is a playful slang expression for \"something spectacular\" or \"excellent.\""}, {"word": "awkward turtle", "def": "Ever talk trash about someone only to discover that they're actually sitting right by you? *awkward turtle*"}, {"word": "b", "def": "B is an affectionate term for a loved one. It is often times used to address a homie, ya girl, or ya moms."}, {"word": "b dubs", "def": "B-Dubs is a nickname for the US restaurant and sports bar Buffalo Wild Wings, which specializes in chicken wings."}, {"word": "baby doll", "def": "In the literal, a baby doll is just that—a toy baby doll."}, {"word": "baby fever", "def": "Baby fever is a colloquial term for the intense desire to have a baby."}, {"word": "baby mama", "def": "Your baby mama is the mother of your baby, whether you are in a relationship with her or not. Alas, the popular connotation of the term is that you're not in a relationship, often making baby mama disparaging or offensive, depending on the context."}, {"word": "back dimples", "def": "Back dimples refer to the indentations on the lower back that appear naturally on some people. They are often considered sexy, especially on women."}, {"word": "back to the future day", "def": "Back to the Future Day is October 21, 2015. It marks the day on which the character Marty McFly arrives in the future in the 1989 film Back to the Future Part II."}, {"word": "bad to the bone", "def": "Inspired by the title and lyrics of American musician George Thorogood’s 1982 song, bad to the bone can mean rebellious in an exciting, attractive way as well as irredeemably bad."}, {"word": "badd", "def": "No, it's not a typo. If someone is badd, they aren't actually bad, they're so cool that they're great. It's often seen in the complimentary compound badd bitch."}, {"word": "bae", "def": "Bae is a slang term for a significant other or an object of affection."}, {"word": "bairn", "def": "Bairn is a Scottish or northern English word for child."}, {"word": "ball is life", "def": "Ball is life is a phrase used by basketball devotees to show their passion for the sport of basketball."}, {"word": "ballbusting", "def": "Ballbusting is a form of torture that causes pain to a man’s genitals. The term is often associated with a woman torturing a man for her own pleasure (either literally or figuratively) or with difficult, nonsexual situations that metaphorically mimic the pain of this type of torture."}, {"word": "baller", "def": "A baller is a basketball player or a successful person who lives a lavish lifestyle similar to a professional basketball player’s. It can also be used to describe someone who or something that is skillful or excellent. The term is often pronounced and written as balla in African American Vernacular English."}, {"word": "balloon juice", "def": "Balloon juice is a slang phrase that primarily means “hot air.” It inspired the name of an influential political blog."}, {"word": "bama", "def": "Bama, a clipped form of Alabama, is a nickname of the University of Alabama, the state, and the people who live there. Bama also popularly refers to the university’s successful SEC (Southeastern Conference) football program."}, {"word": "banana hammock", "def": "A banana hammock is a revealing, tight-fitting men’s bathing suit, or sometimes a similarly fashioned pair of men’s briefs. The name refers to the shape of the penis and the resemblance of the front pouch of the garment to a hammock."}, {"word": "bare", "def": "Bare is UK slang for very or lots of."}, {"word": "bars", "def": "In hip-hop slang, bars refers to a rapper's lyrics, especially when considered extremely good."}, {"word": "bartle skeet", "def": "Have you ever enjoyed a frosty Mountain Dew? That green-colored soda pop is sometimes called Bartle Skeet."}, {"word": "based", "def": "Based is a slang term that originally meant to be addicted to crack cocaine (or acting like you were), but was reclaimed by rapper Lil B for being yourself and not caring what others think of you—to carry yourself with swagger."}, {"word": "bash", "def": "Bash means \"to strike\" something with great force. It's been adopted as slang for hurling insults or verbal abuse at someone. "}, {"word": "basic", "def": "In slang, basic characterizes someone or something as unoriginal, unexceptional, and mainstream. A basic girl—or basic bitch as she is often insulted—is said to like pumpkin spice lattes, UGG boots, and taking lots of selfies, for instance."}, {"word": "basic bitch", "def": "Basic bitch is a term used to condescendingly refer to women who have predictable or unoriginal style, interests, or behavior. The term has been criticized as misogynistic, though it has been reclaimed, to some extent, by women who have been labeled basic bitches."}, {"word": "basketball head", "def": "A basketball head is an avid fan or hobbyist player of the sport of basketball. The term can also be used as an insult for someone perceived to have a large head."}, {"word": "battletoads", "def": "Battletoads refers to a 1991 video game for Nintendo. It’s also the name of a prank, wherein people call game stores asking if they have a copy of Battletoads."}, {"word": "bazinga", "def": "Bazinga! It's an interjection used to rub a good joke in someone's face or cheer yourself on after a personal win, popularized as the catchphrase of the character Sheldon Cooper on the sitcom The Big Bang Theory."}, {"word": "beam me up scotty", "def": "Beam me up, Scotty is a catchphrase from the television show and film series Star Trek. It can stand on its own as an allusion to the show, point out that something looks retrofuturistic, or serve as a humorous request to escape a certain situation."}, {"word": "beast mode", "def": "Beast mode refers to a state of performing something, especially difficult activities, with extreme power, skill, or determination."}, {"word": "bebe", "def": "Bebe is an alternate spelling and pronunciation of baby, usually used playfully or affectionately."}, {"word": "beef curtains", "def": "Beef curtains is vulgar slang for the vulva. It's typically used for vaginal lips that are ... particularly pronounced."}, {"word": "betches", "def": "Betches is a slang variant of bitch, used to mock or as a term of endearment among young, usually white women."}, {"word": "beyond compare", "def": "To be beyond compare is to lack an equal or to be unrivaled in a specific quality."}, {"word": "biddy", "def": "Bitty describes something small or fragmentary. Additionally, it and a variant term, biddy, refer to a woman, particularly a nosy, old woman or a sexualized young woman. It can also be a slang term for breasts."}, {"word": "big booty judy", "def": "A woman is a Big Booty Judy if she has a large butt. While men may use the term to flatter a woman, it often only offends her."}, {"word": "big brother", "def": "A big brother is an older male, related or not, who protects a younger person."}, {"word": "bigly", "def": "Bigly is a word popularly believed to have been made up and used by US President Donald Trump, meaning \"to a large amount\" or \"with great intensity.\" It is most often used in mockery of Donald Trump's speech, mannerisms, and behavior."}, {"word": "billie", "def": "There are any number of famous Billies out there—Billie Jean King, Billie Holiday, and Billie Eilish, to name a few. But when it isn't a name, billies variously refer to a good friend, a policeman's nightstick, money, or a pipe or bong for smoking marijuana."}, {"word": "binch", "def": "Binch is an alternative, usually playful form of the coarse slang bitch, used especially online."}, {"word": "bing bong", "def": "Bing bong is a nonsense phrase once used by President Donald Trump, which is now repeated as a shorthand criticism of his idiosyncratic speaking style."}, {"word": "bish", "def": "Bish, sometimes spelled as beesh, is an alternative form of the coarse slang bitch, often used as a playful term among black women or in black drag culture."}, {"word": "bits and pieces", "def": "The phrase bits and pieces refers to small fragments of something or a miscellaneous assortment of things"}, {"word": "blaccent", "def": "Blaccent, a blend of black and accent, is the imitation of Black English by non-black people."}, {"word": "black girl magic", "def": "Black Girl Magic and #blackgirlmagic were created to celebrate the accomplishments and general amazingness of black women. It is used as an expression of positivity and empowerment."}, {"word": "black heart", "def": "A black heart describes someone or something seen as innately evil or fundamentally corrupt."}, {"word": "black twitter", "def": "Black Twitter is a word to describe the collective identity of black users on Twitter. In a sense, Black Twitter is a digital community that allows people to connect and bond over what it means to be black. This includes both the lighthearted and grim aspects. The focus tends to be reflective of African Americans’ experience, though not exclusively."}, {"word": "blem", "def": "Blem is a slang word that can mean \"cigarette,\" \"marijuana,\" \"a joint,\" or just being really, really \"high.\""}, {"word": "blep", "def": "Who's the chonky boi doin' a blep?"}, {"word": "blerd", "def": "It is time, brothers and sisters, to binge on some...Star Trek! A blerd is slang term for black nerd."}, {"word": "blick", "def": "Blick is a racial slur against very dark-skinned black people. Some black users have taken to the term to describe when the sun darkens their skin or have altogether re-appropriated it, embracing the beauty and pride of their skin tone. Unrelated, blick is slang for a gun and the name of major art supplies store."}, {"word": "blood horse", "def": "A blood horse is either a Thoroughbred or a purebred horse, bred especially for racing."}, {"word": "blow the brains out the coupe", "def": "It may sound grotesque, but blowing the brains out the coupe is harmless. It's just slang for adding a sunroof to your car or opening an existing top."}, {"word": "blue balls", "def": "Blue balls is a slang term to refer to a mildly painful feeling in the testicles of unrelieved sexual arousal. It can also refer to “sexual frustration” in general."}, {"word": "blue waffle", "def": "Blue Waffle is a fictional sexually transmitted infection (STI) that’s believed to both turn the vagina blue and disfigure it. It’s also said to originate from women who “get around” and/or their lack of hygiene. People say it only transmits from women to men. 😒"}, {"word": "bluepilled normalfag", "def": "Bluepilled normalfag is an offensive term used in male internet spaces for a man who lives a conventional life, unwoke to the \"realities\" of men's oppression by women. It's closely associated with incel and alt-right culture online."}, {"word": "blumpkin", "def": "You might want to sit down for this one. Preferably not on the toilet. "}, {"word": "bofa", "def": "Bofa is a slang shortening of “both of,” and, in this colorful internet era, it's generally followed by deez nuts. As in testicles. Bofa deez nuts is a popular online meme."}, {"word": "boi", "def": "Boi is an alternate spelling of boy used to describe boys, yes, but also men, girls, women, and things that aren’t even human ..."}, {"word": "boing", "def": "Boing is onomatopoeia for a springing, twanging sound or action, like a diving board or ... an erection."}, {"word": "bompton", "def": "Bompton is a nickname for the Los Angeles-area city of Compton, California used by members of the Bloods gang. It can also be used to describe neighborhoods in Compton associated with the Bloods."}, {"word": "boo", "def": "Boo is the sound we pretend ghosts make .... and just a little term of endearment for one's significant other. Oh yea, people also boo things they really don't like."}, {"word": "boofing", "def": "Boofing is slang for anal sex."}, {"word": "boolin", "def": "Boolin’ means “hanging out” or “chilling.” It comes from gang culture."}, {"word": "boomshakalaka", "def": "LeBron charges toward the basket and—BOOMSHAKALAKA!—slams down a dunk! Boomshakalaka is an interjection that expresses dominance, triumph, or joy. It is especially used when commenting on big dunks in basketball."}, {"word": "bootch", "def": "Bootch is an alternative pronunciation or spelling of botch, butch, or bitch. It can also be an alternative form of booch, a slang word for \"cocaine.\""}, {"word": "booty shorts", "def": "Booty shorts are very short shorts, typically worn by women, and intended to highlight or display the butt. Booty shorts generally refer to one of two things: tiny shorts intended for streetwear that can be made of various materials from denim and spandex, or a style of underwear similar to boyshorts, but higher cut in the rear."}, {"word": "bosom buddy", "def": "A bosom buddy is a very close, intimate friend, one who's always got your back and who you do and share everything with—a BFF."}, {"word": "boujee", "def": "Boujee is hip-hop slang for something \"luxurious in lifestyle yet humble in character,\" influenced by and often interchanged with the slang bougie."}, {"word": "bounce back", "def": "Taken any L’s recently? Time to bounce back."}, {"word": "brake check", "def": "A brake check is the unsafe action of applying a car's brakes to dissuade a driver who is following too closely. To brake check someone is to perform such an action."}, {"word": "brick wall", "def": "A brick wall is variously used as a metaphor for a challenging obstacle or obstruction."}, {"word": "broccoli", "def": "Eat your...vegetables? When not referring to the actual vegetable, broccoli is slang for \"marijuana.\""}, {"word": "brony", "def": "A brony is a male fan of the television series My Little Pony: Friendship is Magic, and member of the brony fandom."}, {"word": "broscience", "def": "Dude, maxing out your squats will make your pecs huge! "}, {"word": "brothe", "def": "Brothe is a corruption, often humorous, of the past tense of breathe. It sometimes appears as an alternative spelling or misspelling of brother."}, {"word": "brothers in arms", "def": "Brothers in arms are men who serve together in a conflict, especially war. By extension, brothers in arms are also men who share a very close, strong relationship."}, {"word": "brownout", "def": "A brownout is like a blackout, just not as bad."}, {"word": "bubble butt", "def": "🍑 Like bubbles, butts are round and they pop. The end."}, {"word": "bukkake", "def": "Bukkake is Japanese word which roughly translates to \"to splash with liquid\" and refers to a popular cold noodle dish. "}, {"word": "bumbaclot", "def": "Bumbaclot, or bumboclaat, is Jamaican slang equivalent to \"douchebag\" or \"motherfucker,\" often used as an interjection to express disgust or dismay."}, {"word": "bump", "def": "Bump is an online slang term for the practice of posting filler comments to move a post to the top of a discussion thread, increasing a message or thread’s status and visibility."}, {"word": "bust a nut", "def": "No nutcracker necessary. The expression bust a nut variously means \"to ejaculate or orgasm,\" \"to be excited about something,\" \"to lose your temper,\" or \"to work hard.\""}, {"word": "butt plug", "def": "A butt plug is a sex toy that is inserted into the butt for pleasure—and occasionally a little sexy-time flair. Hey, whatever floats your butt, er, boat."}, {"word": "butterface", "def": "Butterface is derogatory, it just is. Usually it's used for a woman whose body is attractive but whose face is ugly."}, {"word": "butterfly kisses", "def": "A butterfly kiss is an affectionate gesture made by fluttering the eyelashes against someone’s skin or eyelashes."}, {"word": "bye felicia", "def": "Bye, Felicia is a dismissive term which can be used in a number of different contexts. Most simply and frequently, it is used as a cold way to bid someone a less-than-fond farewell."}, {"word": "c suite", "def": "C-suite refers to the group of the highest-level executive positions within a corporation."}, {"word": "cake by the ocean", "def": "Cake by the ocean is a euphemism for having sex at the beach. It comes from the title of the band DNCE's 2015 debut single, \"Cake by the Ocean.\""}, {"word": "call of booty", "def": "Calm down is a widely used verb phrase meaning \"to make someone or something less agitated.\""}, {"word": "caping", "def": "A cape is a sleeveless garment, tied around the neck from everyone from bullfighters to superheroes. Caping is slang for \"defending or supporting\" someone, especially someone considered unworthy of it."}, {"word": "catch 22", "def": "To get a job, you need experience. But to get experience you, you need to have had a job. It's a Catch 22."}, {"word": "catfish", "def": "Aside from being a delicious kind of river fish, a catfish is a slang term for someone who seduces a person with a false identity online."}, {"word": "charley horse", "def": "A charley horse is an involuntary muscle spasm or cramp, usually occurring in the larger muscles of the limbs. It can last anywhere from a few seconds to more than a day. And it hurts, like makes-you-have-to-stop-everything-you're-doing-and-want-to-curl-up-in-a-ball hurts."}, {"word": "charlie foxtrot", "def": "Ten-hut, soldier! We drop boots at 0-800 and it is a Charlie Foxtrot down there."}, {"word": "chav", "def": "Oi, mate, you askin' 'bout chavs? Chavs is a UK derogatory slang word for a young hooligan who wears designer clothes and start fights, usually seen as lower class."}, {"word": "cheeky nandos", "def": "In British slang, a cheeky Nando's means popping in for a bite at the chicken restaurant Nando's, often with your mates after you've had a couple of pints and are having a good time."}, {"word": "chiraq", "def": "Chiraq is a nickname for Chicago, Illinois. It combines Chicago with Iraq, and is used to refer to certain violent areas in Chicago, likening them to a warzone."}, {"word": "chocolate rain", "def": "Chocolate Rain is an original song by Youtuber, Tay Zonday. It became a viral meme in 2007, thanks to sites like 4chan and Digg. In the lyrics of the song, the term Chocolate Rain itself is intended to be a stand-in for institutional racism."}, {"word": "chode", "def": "Chode is slang for a penis wider than it is long. It can also refer to the perineum. The term is generally used for humor or as a mild insult."}, {"word": "chonky", "def": "Look at that chonky boi!"}, {"word": "choob", "def": "Choob is gaming slang for a high-level player that acts like a noob, or \"a newbie,\" to annoy or disrespect other players."}, {"word": "chucky egg", "def": "A chucky egg is a British regional term for a chicken egg, especially when it is soft-boiled and chopped up. It is also used as a term of endearment."}, {"word": "circle game", "def": "The Circle Game is an activity where one person makes a “circle” with their fingers and holds it below their waist, convincing a second person to look at it. If the second person looks, they receive a punch to the shoulder."}, {"word": "circle jerk", "def": "A circle jerk is when a group of men sit or stand in a circle and masturbate. "}, {"word": "cleverbot", "def": "Cleverbot is the name of an online artificial intelligence technology that chats with real people in a simulation of human conversation, making its replies by drawing on its database of previous conversations."}, {"word": "climax", "def": "A climax is the most intense, decisive point of something, especially in a story or film. In the bedroom, that point is the orgasm."}, {"word": "clout", "def": "To have clout is to have influence or power. In popular culture, people with clout are seen as popular and cool."}, {"word": "clutch", "def": "In slang, clutch refers to something done (well) in crucial situation, such as clutch play in sports that pushes a team into victory. More broadly, clutch can characterize something as \"excellent\" or \"effective.\""}, {"word": "cock on", "def": "Looking for a fun new dirty slang term? Well, this isn’t it."}, {"word": "cock ring", "def": "A cock ring is a ring, usually made of metal or rubber, for the penis. Yup."}, {"word": "cock block", "def": "Cock-blocking is the action of preventing someone (usually a man) from having sex by intentionally or unintentionally stopping (blocking) someone else's cock from reaching its intended destination. This behavior could be driven by jealousy, competition, genuine concern for one of the people involved, or simple obliviousness."}, {"word": "coger", "def": "Literally meaning \"to grab or \"to take\" in Spanish, coger is used as a Latin American vulgar slang term for \"to fuck.\""}, {"word": "coin flip", "def": "We call heads."}, {"word": "come to jesus", "def": "In the name of the father, the son, and the holy spirit. Amen. 🙏 Uhh ... "}, {"word": "concern troll", "def": "Concern trolling involves someone opposing an idea or viewpoint, yet acting like they’re an advocate for the cause. A concern troll offers undermining criticisms under the guise of concern. Their goal is to sabotage the cause being discussed, and to inspire doubt among group members. This occurs in groups rallied around a particular issue, especially in political parties, and the goal of concern trolling is to cause dissent within a community."}, {"word": "conversion therapy", "def": "Conversion therapy refers to the widely discredited practice that attempts to change a person’s sexual orientation or gender identity."}, {"word": "cool story bro", "def": "\"This one time at band camp ...\" Cool story, bro. \"So I tied an onion to my belt, which was the style at the time.\" Cool story, bro.\"... and then I found five dollars.\" Cool story, bro. "}, {"word": "cop", "def": "A cop is an informal term for a police officer. As a verb, cop is used in a variety of slang expressions meaning \"grab\" or \"obtain,\" from copping a feel on someone (not recommended) to copping out on going to a party (= not going) to copping to (confessing to) eating the last slice of pizza."}, {"word": "copypasta", "def": "The term copypasta refers to a block of text which is repeatedly copied and pasted by individuals over various online forums and social media sites. It is often used interchangeably with “copy and paste.”"}, {"word": "couged it", "def": "Couged it refers to the Washington State University Cougars football team. If a team has couged it, they've squandered all their chances for victory and have lost the game. The expression is sometimes used for salvaging a win at the last minute."}, {"word": "coulters law", "def": "Named after a 2015 tweet from provocative conservative political commentator, Ann Coulter, Coulter's Law states that the longer it takes the news media to identify a mass shooter in the United States, the less likely it is to be a white male."}, {"word": "coyote ugly", "def": "Coyote ugly refers to a popular film from the year 2000 featuring sexy female bartenders. It takes its name from slang for a one-night-stand partner later regretted because they are unattractive."}, {"word": "crazy shit", "def": "Charlie Sheen interviews, the news in 2018, the fact that adults have fewer bones in their bodies than babies do, you know—crazy shit."}, {"word": "creampie", "def": "A creampie is vulgar. It's sexual slang for a shot in pornography showing semen dripping from a vagina, anus, or mouth."}, {"word": "creepshot", "def": "Creepshot typically refers to a photo taken by a man of a woman or girl in public without her consent. Creepshots typically focus on a woman’s backside, legs, or cleavage."}, {"word": "crine", "def": "On social media, especially Twitter, crine is used as an alternate spelling of cryin' (crying), as in \"for crine out loud\". Crine can also refer to \"hair\" or a \"head of hair.\" In Scottish English, crine means \"to shrink or shrivel,\" especially with age or heat, or \"to dry up.\""}, {"word": "cringey", "def": "When your parents kiss. When Hillary Clinton dabbed. These things are cringey. "}, {"word": "crit", "def": "Things were looking bad but then I got a crit and killed the dragon! Crit is gaming slang for a \"critical hit,\" which is a blow that does a great amount of damage to an opponent."}, {"word": "crop dusting", "def": "Crop dusting is the act of farting while walking, dragging the smell around with you and spreading its stank-y love."}, {"word": "cuck", "def": "A cuck is a weak, effeminate, unmanly, or inadequate man, who is often dominated by their female partner. It is considered derogatory slang."}, {"word": "cuff", "def": "Cuff can refer to the ends of sleeves or rolled pants, handcuffs, or, in the world of modern love, the act of going steady with someone over the winter months."}, {"word": "cum shot", "def": "This is ... a messy term. In pornography, a cum shot is when someone ejaculates (cums), usually on a partner's face or body."}, {"word": "cunnilingus", "def": "Cunnilingus is the oral stimulation of female genitalia. While many women highly enjoy it as a form of oral sex, it has a popular reputation for being difficult to accomplish (say many men) or performed lousily (say many more women)."}, {"word": "curve", "def": "To curve someone is \"to reject\" them, that is, veer away from their romantic interests and advances in an indirect, non-confrontational way.  "}, {"word": "dfuq", "def": "D'fuq is a slang form of the fuck, commonly used as a quick reaction to a confusing, shocking, or objectionable situation."}, {"word": "dab", "def": "In slang, dab can be a highly concentrated marijuana extract, a type of hip-hop dance, or touching the ground with your foot while you ride a bicycle. Doing any of these actions is called dabbing, and yes, you could feasibly do all three at once—not that we recommend it."}, {"word": "dab of ranch", "def": "This dab of ranch doesn’t go on a salad ... it goes on your wrist. "}, {"word": "dad joke", "def": "A dad joke is a joke so corny or lame that only a tragically unhip dad would think it's funny."}, {"word": "daddy issues", "def": "Daddy issues is an informal phrase for the psychological challenges resulting from an absent or abnormal relationship with one's father, often manifesting in a distrust of, or sexual desire for, men who act as father figures."}, {"word": "damn gina", "def": "Damn, Gina is a catchphrase from Martin Lawrence's 1990s sitcom, Martin. Martin used it whenever his girlfriend Gina was being especially frustrating, or was looking particularly good. It's been adopted into slang to convey awe, surprise, or appreciation."}, {"word": "dance with the devil", "def": "To dance with the devil is to engage in risky, reckless, or potentially immoral behavior."}, {"word": "dank meme", "def": "Dank meme refers to viral internet content that, due to overuse or passing trends, has lost its value or currency. It can also refer to exceptionally unique or odd memes."}, {"word": "dayt", "def": "A dayt is a romantic date that occurs during the daytime."}, {"word": "deadass", "def": "Deadass is slang for \"seriously.\" That is, no kidding, for real, we're deadass not lying to you."}, {"word": "deal with it", "def": "Appearing in popular memes in the 2010s, the phrase deal with it is a bold, self-assured declaration ordering someone to put up with something they may object to or to make do with a challenging but ultimately manageable situation."}, {"word": "debbie downer", "def": "Debbie Downer is a name for someone who is constantly making others feel bad or dampening the mood of a group with negative comments."}, {"word": "deep throat", "def": "Deep Throat is the pseudonym of the key informant in the Watergate scandal who provided information to journalists Bob Woodward and Carl Bernstein, eventually leading to the resignation of President Nixon in 1974."}, {"word": "deez nuts", "def": "Deez nuts is an expression used to deliberately interrupt or divert a conversation. It is not a literal reference to testicles; rather it is used figuratively to disrupt and show disrespect to whatever discussion is currently occurring."}, {"word": "delish", "def": "Delish is a shortened form of the word delicious, colloquially used for tasty food, attractive people, or other things that provide great pleasure."}, {"word": "demotional", "def": "Are you really passionate yet don't let things get under your skin?"}, {"word": "der", "def": "Der is a slang interjection used to characterize a comment as stupid or obvious."}, {"word": "dick appointment", "def": "Dick appointment is a slang term for arranging a time to have sex with a man. Deeper, emotional connections are left at the door; dick appointments are about a woman getting laid."}, {"word": "dick chicken", "def": "While dick chicken has previously been used as a nickname, insult, or just funny word combination, the game of dick chicken is where two men, usually straight, lower their pants and walk toward each other on a path that would cause their penises to collide ... until one loses by veering from the path, or \"chickening out.\" "}, {"word": "dick pic", "def": "Dick pic is slang for an image of a penis, typically sent and received via electronic devices."}, {"word": "dick print", "def": "A dick print is the outline of a penis as seen bulging through clothing."}, {"word": "diddy bop", "def": "There are times when you are so 🔥 that no ordinary walk will do. My friend, times like these call for the diddy bop. A diddy bop is a walk or dance that resembles a bouncing strut or swagger."}, {"word": "dingleberry", "def": "Yes, there's an actual berry called a dingleberry. It's a kind of cranberry. In slang, though, a dingleberry is a term for a small piece of poop clinging to the butt of a human or animal, sometimes used as a mild way to call someone \"stupid.\""}, {"word": "dipped", "def": "Dipped literally refers to something dunked in some kind of substance. But as a slang term, dipped means \"to leave\" or \"to be well-dressed.\" On a slightly more violent note, it can also refer to getting stabbed."}, {"word": "dirty sprite", "def": "Dirty Sprite, also known as \"lean\" or \"purple drank,\" is a slang term for a mixture of clear soda and prescription cough medicine that contains codeine and promethazine. It’s commonly referenced in hip-hop culture."}, {"word": "disco stick", "def": "🎶 Let's have some fun, this beat is sick / I wanna take a ride on your disco stick. 🎶 "}, {"word": "disturbia", "def": "A blend of the words disturbing (or disturbed) and suburbia, disturbia is used to convey a perceived sense of distress about modern life, especially middle-class consumerism in American suburbs."}, {"word": "dog walk", "def": "Time to get the leash. The slang dog walk is \"to overpower\" or \"outsmart\" someone, as if in utter control of them, as when walking a dog. The slang verb own is a close synonym."}, {"word": "dog pile", "def": "A dog-pile is formed when a group of people jump on each other, often done as a children's game or in athletic celebrations."}, {"word": "dogecoin", "def": "Who's a good boy? Dogecoin is a form of digital currency featuring the doge dog, a popular internet meme, as its mascot."}, {"word": "doggo", "def": "Doggo and pupper are affectionate terms for dog and puppy used in the internet slang called DoggoLingo. Heckin good words, 13/10!"}, {"word": "doggy style", "def": "Doggy style is a colloquial term for vaginal or anal sex from behind, typically with one partner crouched on all fours."}, {"word": "dont tread on me", "def": "Don’t tread on me is a historic expression of American patriotism and freedom."}, {"word": "donkey punch", "def": "Donkey punch is a coarse sex act where a man punches his partner in the back of the head (or elsewhere) during ejaculation, usually while having sex from behind. It's falsely said to cause a tightening of the anus and vagina—but will be sure to cause injury ... and even criminal charges."}, {"word": "dope", "def": "As far as words go, dope is a pretty dope word because it can mean many, many things."}, {"word": "double down", "def": "To double down is take a further risk in a situation or passionately re-commit one’s efforts to a cause or course of action."}, {"word": "double penetration", "def": "Double penetration, or DP, is a sexual act wherein a woman's vagina and anus are penetrated at the same time, whether by multiple penises, dildos, or other sex toys."}, {"word": "double standard", "def": "Ideally, we should all be judged according to the same criteria. But ... when someone is treated differently than someone else in the same situation, especially when women are treated differently than men, we have ourselves a double standard."}, {"word": "douchebag", "def": "You know the dude, that collar-popping, suns-out-guns-out, last-piece-of-pizza-stealing specimen of bro-dom."}, {"word": "drip", "def": "Leaks drip, yes, but when you've got the drip or are dripping, it means in slang that your look or style is extremely fashionable or sexy."}, {"word": "drop it like its hot", "def": "Drop it like it’s hot is a phrase often associated with hip-hop, rap, and dance music. It’s used most commonly as a command or request. Specifically, it refers to a dance move where a person (usually a woman) bends over or bends her knees and “drops” towards the floor, emphasizing her butt."}, {"word": "dry humping", "def": "Dry humping is sexual activity that doesn’t involve direct contact between genitals (dry referring to the lack of bodily fluid exchanged). It can involve various sexual behaviors, including (but not limited to) rubbing or touching a partner through their clothing."}, {"word": "dub", "def": "Dub has many meanings in English. It can variously mean \"to nickname\" and \"to voice a film in a different language.\" It can be short for double and the letter W. It can be slang for a marijuana \"joint\", or $20 worth of drugs. Dub also refers to a popular genre of music derived from reggae."}, {"word": "dudebro", "def": "A dudebro is a humorous or derisive slang term stereotyping a young, usually white man as a partying prep or jock who is unaware of his own privilege."}, {"word": "duff", "def": "Standing for designated ugly fat friend, duff is a rude, though often humorous term people use for that one friend who makes you look better."}, {"word": "dutch oven", "def": "In the kitchen, a Dutch oven is a type of heavy cooking pot."}, {"word": "e621", "def": "E621 is an imageboard focused on furry artwork. Do you know what furries are? You should."}, {"word": "easy peasy lemon squeezy", "def": "Easy peasy lemon squeezy is a playful way to describe a task or activity as extremely easy or simple to perform."}, {"word": "eating out", "def": "No, we're not talking about going to the Cheesecake Factory here ... The act of eating out, or eating (someone) out, means performing oral sex on another's vagina or, occasionally, anus."}, {"word": "edgelord", "def": "An edgelord is someone on an internet forum who deliberately talks about controversial, offensive, taboo, or nihilistic subjects in order to shock other users in an effort to appear cool, or edgy."}, {"word": "egotastic", "def": "People who are egotastic believe the world revolves all around them, and they're not afraid to be showy about it. They're fantastically egotistical."}, {"word": "eli5", "def": "ELI5 is short for \"Explain Like I'm 5,\" a request for a simple explanation to a complicated question or problem."}, {"word": "epic fail", "def": "When someone spectacularly messes up at something—especially little or simple things done or shared in public, like misspelling one's own name on an official form or getting rejected for a kiss on the Jumbotron—people might joke about it as an epic fail. "}, {"word": "erin go bragh", "def": "Based on an Irish phrase meaning “Ireland forever,” Erin go Bragh is a popular expression of loyalty to, or affection for, Ireland and its people and culture."}, {"word": "ermahgerd", "def": "Ermahgerd is a humorous version of the phrase oh my god, written as though pronounced with a heavy influence of extra Rs. It’s meant to imitate the sound of someone speaking through a retainer."}, {"word": "eskimo brothers", "def": "Eskimo brothers is a term that refers to men who have had sex with the same partner at different points in time. It can sometimes be considered offensive."}, {"word": "esskeetit", "def": "Esskeetit is a 2018 song and catchphrase of rapper Lil Pump. It is his way of saying a pumped-up \"Let's get it.\""}, {"word": "ever after", "def": "... and they lived happily ever after. Ever after is a phrase that means \"from this on.\" It often appears in the phrase happily ever after, a conventional ending for fairy tales associated with lasting love."}, {"word": "evol", "def": "Evol is wordplay on the word love spelled backwards. It is also commonly used as an abbreviation for evolution."}, {"word": "facepalm", "def": "Facepalm refers to the physical gesture of putting one's hand up against the face, used mainly to express feelings of stupidity and frustration about oneself or others."}, {"word": "fafa", "def": "Fafa is a nonsense word parodying French. It can also be a pet form of father or papa."}, {"word": "faith hilling", "def": "Faith Hilling is a fictional, satirical meme featured in a 2012 episode of the adult cartoon South Park. It involves boys pulling their shirts to resemble having breasts."}, {"word": "fap", "def": "Fap is a slang term for male masturbation. It's often found on the internet and seen in repetition (e.g., fap fap fap)."}, {"word": "fapusation", "def": "A fapusation is an accusation made about somebody that specifically exposes the people, things, or materials they allegedly masturbate to. Often times, the things they're masturbating to are strange ... really strange."}, {"word": "fauxhawk", "def": "A fauxhawk is a hairstyle that resembles a mohawk, with relatively short sides and a longer hair on top."}, {"word": "fav", "def": "Fav or fave is short for “favorite.” In addition to usage as an adjective or noun, it can be used as a verb, meaning “to mark a piece of content as a favorite on a website.”"}, {"word": "feels", "def": "Cute puppy dogs, a bad break-up, some really good pizza: These things give us all the feels. The slang term describes an overwhelming emotional reaction, often with a humorous tone in the phrase all the feels."}, {"word": "feminazi", "def": "Feminazi is an offensive slur for a feminist whose views are considered radical or extreme."}, {"word": "festivus", "def": "Festivus is the name of a secular and non-commercial holiday characterized by the raising of an aluminum pole, the serving of a dinner, the airing of grievances, and the demonstration of feats of strength."}, {"word": "fetch", "def": "Oh, it's like slang, from...England."}, {"word": "ffff", "def": "FFFF is a vulgar slang acronym that refers to the misogynist motto, \"find 'em, feel 'em, fuck 'em, and forget 'em.\" The 'em in this case? You guessed it: women-in-general. There are variations on FFFF, including the total number of Fs and what specifically they stand for (e.g., fool, feed, etc). It can also be a self-censoring euphemism for that classic four-letter F word."}, {"word": "fifi", "def": "Fifi is a prison slang term for an artificial vagina made from whatever materials are available."}, {"word": "finna", "def": "Finna, a contraction of fixing to, means “getting ready to do something.”"}, {"word": "finsta", "def": "A finsta is a secondary, usually private, Instagram account where users are more lax in deciding what they post. It’s a private space that might be more personally authentic and is shared with close friends. This is a contrast to someone’s main account, which might have more heavily curated content."}, {"word": "fire crotch", "def": "No, fire crotch is not a medical condition, thankfully. It means having red pubic hair. A person with naturally red hair might be said to have a fire crotch or be insulted as a fire crotch."}, {"word": "first responder", "def": "A first responder is a real-life superhero. They're someone whose job is to respond immediately (first) when there is an accident or emergency. Emergency Medical Technicians (EMTs), paramedics, firefighters, and police officers are all considered first responders."}, {"word": "fish", "def": "Fish, or fresh fish, is prison slang for new, first-time inmates, usually considered naive and vulnerable."}, {"word": "flex", "def": "Flex is a slang term meaning \"to show off,\" whether it be your physique, your belongings, or some other thing you consider superior to others. The act of flexing is often criticized as a power move, considered arrogant and insincere. "}, {"word": "florida man", "def": "Breaking news: Florida man attempts to rob circus performers but is subdued by clowns."}, {"word": "flounce", "def": "Ever had a group chat that drove you nuts? Maybe you just wanted to say bye Felicia to your extended family Facebook group or office GroupMe? Well, if you did it with enough flair, you flounced it."}, {"word": "fluffer", "def": "Despite what it sounds like, a fluffer isn't someone who stuffs toy animals. A fluffer is—or at least is said to be—someone on a pornographic film set that keeps a male performer's penis erect in between scenes."}, {"word": "fml", "def": "FML is an acronym meaning “fuck my life,” usually said at the conclusion of a negative story."}, {"word": "food baby", "def": "Food baby refers to the bloated appearance of the stomach area after eating a large amount of food, giving the person the appearance of being pregnant."}, {"word": "footjob", "def": "A foot job is a sexual act in which one person uses their feet to masturbate another—if you're into that sort of thing."}, {"word": "friend zone", "def": "We really, really like you, but what we already have—it's so good and we don't want to ruin that. Sorry, but we've got to friend zone you. "}, {"word": "friends with benefits", "def": "Friends with benefits enjoy all the pleasures of sexual activity without the burdens of a committed relationship ... or so they like to claim."}, {"word": "frisco", "def": "Frisco is a nickname for the city of San Francisco, California. "}, {"word": "fronking", "def": "Fronking is a joke slang term referring to farting in water and then \"biting\" the resulting bubbles. It's also a euphemism for fucking, as in this fronking guy."}, {"word": "fuck shit im", "def": "Fuck this shit I'm out is a phrase said, and often sung, when commenting on a confusing, embarrassing, exasperating, or even exciting situation."}, {"word": "fuck up some commas", "def": "To fuck up some commas is to recklessly spend an excessive amount of money."}, {"word": "fuckboy", "def": "A fuckboy is that guy … the one who doesn’t respect women, but relies on them heavily. He’s distant, doesn’t care about other people’s time, and won’t commit. He’s self-absorbed, does stupid things, and fucks with others’ emotions."}, {"word": "fuego", "def": "Borrowed from the Spanish word for fire, fuego is used in English as a slang term for something “excellent” or “sexy,” with the phrase en fuego expressing something “on fire,” or “performing extremely well.”"}, {"word": "fugazi", "def": "Fugazi can be used to describe a situation as “fucked up” or to describe an item as fake."}, {"word": "full send", "def": "YOLO! If you do something full send, especially in extreme sports, you're doing it it full-throttle and with 100% commitment—even if you end up failing. In extended, popular slang, full send has the sense of \"intense,\" \"hardcore,\" or \"without regard to consequences.\""}, {"word": "fumble the bag", "def": "Fumble the bag comes from a lyric in the 2017 hip-hop song \"I Get the Bag\" by Gucci Mane, featuring Migos. To fumble the bag is to lose the money (the bag) you made or to make unwise investments with the money you already have, i.e. the bag. It's also used for fumbling, or botching or bungling, something more generally."}, {"word": "fun fact", "def": "Fun fact: Forget sharks and snakes, mosquitoes kill more humans than any other animal every year. Maybe that wasn't so fun ..."}, {"word": "furries", "def": "Furries are fans of anthropomorphic animals. These are animals with human characteristics, like Mickey Mouse, Sonic the Hedgehog, and many mascots for sports teams. Furries are part of the greater furry fandom. Besides referring to fans of anthropomorphic characters, furries are also the anthro characters themselves."}, {"word": "fux", "def": "Fux is an internet slang form of fuck."}, {"word": "fwp", "def": "First World Problems or fwps are issues that are only seen as such by people in wealthy parts of the world. The term is generally used in a tongue-in-cheek way online by people in wealthy nations to poke fun at themselves."}, {"word": "fya", "def": "Fya is slang form of fire, used for anything that's, well, lit. It means something is amazing, extremely good, or on point, especially said of how someone feels or looks."}, {"word": "fye", "def": "Fye is a slang expression used to describe someone or something that is excellent or in a state of excitement."}, {"word": "g o a t", "def": "Not many people can claim to be the G.O.A.T., but those who can are the Greatest Of All Time in their field. Most often, the acronym G.O.A.T. praises exceptional athletes but also musicians and other public figures."}, {"word": "g3722", "def": "G3722 is the trade identifier imprinted on the 2-milligram pill of the painkiller Xanax, colloquially referenced by recreational abusers of the drug."}, {"word": "galentine", "def": "Observed on February 13, the day before Valentine’s Day, Galentine’s Day celebrates platonic friendships, usually among women."}, {"word": "game on", "def": "Game on is an expression variously used to kick off a contest, issue a challenge, or express general enthusiasm."}, {"word": "gangnam style", "def": "Oppa most views ever style. Gangnam Style is the name of pop song by South Korean musical artist, Psy. The phrase can also refer to his massively viral music video and the famous, much-imitated dance performed in it."}, {"word": "gank", "def": "We aren't trying to gank you—which is to say, steal from you, con you, or to take you out in a video game. We wouldn't gang up with our friends to gank you, either."}, {"word": "gay adjacent", "def": "Gay adjacent can describe a straight person who has interests or behaviors stereotyped as gay—very often meant in a good way, like not being a total slob or you sincerely dig Carly Rae Jespen. It can also refer to straight people who enjoy gay media and culture as well as support gay rights."}, {"word": "gen pop", "def": "Gen pop, short for general population, is a prison term for the main body of prisoners that haven't been segregated into special housing for disciplinary or protective measures.  Gen pop is also used to mean \"the mainstream\" outside prison contexts."}, {"word": "get air", "def": "Get air is a sports term for becoming temporarily airborne. Getting air can be done with the help of a ramp, as in skateboarding, ski jumping, or snowboarding, or through the springiness of your own legs, as in basketball."}, {"word": "get gully", "def": "Get gully is a slang expression for \"acting tough,\" especially to defend your honor in a fight, or sometimes it just means \"excited\" more generally."}, {"word": "get hashtagged", "def": "If something or someone gets hashtagged, that generally means they are trending on the internet, especially the social media site Twitter in the form of a hashtag (#)."}, {"word": "get jail free card", "def": "A get out of jail free card is a metaphorical way to refer to anything that will get someone out of an undesirable situation or allow them to avoid punishment."}, {"word": "gibsmedat", "def": "Gibsmedat is a disgusting, derogatory term for social welfare programs and the people who need them. It is often used by racists to refer to black people."}, {"word": "giffy", "def": " "}, {"word": "girl crush", "def": "A girl crush is a non-sexual, non-romantic admiration that one woman has for another."}, {"word": "git gud", "def": "Git gud, a slang rendering of get good, refers to getting better at a task or skill, used especially among video gamers online."}, {"word": "glomp", "def": "A glomp is a lunging, enthusiastic, over-the-top, and potentially dangerous hug that often begins with a running start, like a tackle. "}, {"word": "glory hole", "def": "A glory-hole is sexual slang for a slot in a wall in which a man inserts his penis for sexual stimulation by someone on the other side ... often used by politicians of a certain party."}, {"word": "goat rodeo", "def": "A goat rodeo is a slang term for something going totally, unbelievably, disastrously wrong, and there’s nothing left to do but to sit back and watch the trainwreck. "}, {"word": "gogle", "def": "Gogle is a common misspelling of the internet search engine Google, occasionally used as a slang term for looking at pornography accessed from a Google search."}, {"word": "goin brazy", "def": "Goin' brazy is hip-hop slang way of saying going crazy, as popularized by members or affiliates of the Los Angeles-based gang the Bloods."}, {"word": "going dutch", "def": "Do you want me to pick up the bill or do you want to go Dutch?"}, {"word": "gooch", "def": "Gooch is slang for the perineum, or the area between the anus and genitals, usually on a man. It’s also Laguna Beach, California area slang for \"excellent\" or \"awesome.\""}, {"word": "good vibes", "def": "Good vibes is a slang phrase for the positive feelings given off by a person, place, or situation."}, {"word": "google it", "def": "Google it is an instruction, often humorous, to look up any given question on the leading internet search engine, Google."}, {"word": "goombah", "def": "Among Italian-Americans, a goombah is a slang term for a “close friend.” When directed at Italian-Americans, a goombah can be an ethnic slur or a gangster stereotype."}, {"word": "goon", "def": "Don't be a goon! That is, don't be a \"fool\" or an \"oaf.\""}, {"word": "gorger", "def": "A gorger is a Romani word for a non-Romani person. A gorger is also a synonym for \"glutton,\" or someone who gorges on a great amount of food."}, {"word": "got em", "def": "Often used in conjunction with memes, got em is a phrase said in triumph after successfully tricking someone, pulling off a prank, or making a joke at someone else’s expense."}, {"word": "gots", "def": "Gots is get in certain forms of American English, especially historical Black English. People sometimes use gots for emphatic, commanding, humorous, or mocking effect."}, {"word": "gravity bong", "def": "A gravity bong is a homemade device for smoking marijuana. It is made by submerging a modified plastic bottle into a larger container of water. It is said to harness gravity in order to pull smoke down into the bottle’s chamber as the bottle is lifted from the water."}, {"word": "griefer", "def": "A griefer or grief player, is a participant in an online multiplayer computer game who makes a point to harass other participants in the game."}, {"word": "gringo 2", "def": "While not always the case, gringo is frequently an insult. If you're white and use Cinco de Mayo as an excuse to drink too many margaritas at your local, inauthentic Tex-Mex restaurant, all while wearing a sombrero, you might get called a gringo."}, {"word": "gritty", "def": "Gritty describes something that is rough and tough. It is often used to describe creative content that is realistic and raw."}, {"word": "grom", "def": "Grom, shortened from grommet, is Australian and Californian slang for a young, often precocious surfer. Gremmie is a common synonym."}, {"word": "growing pains", "def": "Originally a reference to the physical pains many children experience when going through a growth spurt, growing pains has come to refer to the hardships experienced at the early stages of some endeavor."}, {"word": "guala", "def": "Guala is Latin-American Spanish slang used for someone who shows their Latin heritage through clothes, mannerisms, and language."}, {"word": "guap", "def": "Guap is slang for a lot of money—cash money. Unlike some of the other many slang terms for money (e.g., rack or milli), guap is an unspecified amount. It's just a lot of dough, moolah, bones."}, {"word": "guido", "def": "Guido is an Italian given name used in the US as a slang term to insult, and sometimes celebrate, East Coast Italian-American men. "}, {"word": "guilty pleasure", "def": "A guilty pleasure is an activity or piece of media that someone enjoys but would be embarrassed by if other people found out about it. These might be books, movies, TV shows, foods, etc. Generally the guilty pleasure is something that might be viewed as shameful by some people, like trashy novels or overdone rom coms."}, {"word": "gummy bear song", "def": "The Gummy Bear Song is a viral novelty song and video featuring a sentient gummy bear."}, {"word": "gunt", "def": "Gunt is slang for a fatty area below the bully button and above the pubic area of a woman, often as a result of childbirth, weight gain, or just having a totally normal body."}, {"word": "gurlfriend", "def": "Gurlfriend is an alternative spelling of the word girlfriend typically used by women and gay men as a term of endearment for their platonic friends. Sometimes people use it whether they know the other person or not. It might be used as a fun word to encourage or compliment others, whether they’re other women or gay men. It’s also been used as an alternative spelling to describe one’s actual partner."}, {"word": "habibi", "def": "Habibi is an Arabic word that literally means “my love” (sometimes also translated as “my dear,” “my darling,” or “beloved.”)"}, {"word": "hag", "def": "Historically, a hag is an old, ugly women with evil powers. Much like witches, crones, and banshees, hag has become a sexist insult degrading women."}, {"word": "hakuna matata", "def": "Hakuna matata roughly translates to \"there are no troubles\" in Swahili. The phrase was popularized in English by the 1994 Disney movie The Lion King, where it’s translated as \"no worries.\" It has a connotation of not worrying about things outside a person's control."}, {"word": "half your age plus seven", "def": "How young is too young to hook up with someone? Do the math. If they are older than half your age plus seven years, then you are all good—at least as far as this rule of thumb is concerned. The age, here, is usually the man's. Because double standards."}, {"word": "hall pass", "def": "A hall pass is a note or other object that gives a student permission to walk through the halls of a school unsupervised, usually for a specific purpose, like going to the bathroom or the nurse's office."}, {"word": "ham", "def": "Ham isn't just a staple for Christmas dinners or sandwiches. It can also stand for hard as a motherfucker."}, {"word": "hand job", "def": "A hand job is a sexual act in which one person uses their hand to stimulate another person's genitals—the key being not your own hand, fellas."}, {"word": "happy ending massage", "def": "A happy ending massage is a massage that starts with the usual full-body rubdown but ends with a sex act, usually a hand job or a blowjob."}, {"word": "happy hump day", "def": "Happy hump day is a phrase variously issued to people on Wednesday, popularly called hump day in office environments."}, {"word": "happy trail", "def": "A happy trail is a vertical strip of hair running from the belly button down to the pubic region, usually associated with men."}, {"word": "hard in the paint", "def": "All in, baby! If you tackle something head on and give it 110%, then you are going hard in the paint."}, {"word": "hard times", "def": "If you've fallen on hard times, you're experiencing a period of great difficulty, especially financially. It can also refer to challenging circumstances more generally, like with personal or health struggles."}, {"word": "hardcore", "def": "Hardcore means \"extreme\" or \"intense,\" like a hardcore gym routine, or a fan of Justin Bieber. It is especially used to reference hardcore punk music or pornography."}, {"word": "haters gonna hate", "def": "Haters gonna hate is an informal way to express consolation, voice encouragement, or dismiss criticism. The phrase implies that criticism says more about the critic, or “hater,” than the person being criticized, i.e., that they are making judgements out of jealousy or their own negativity."}, {"word": "haze", "def": "Haze is a noun or adjective referring to a type of LSD (acid) or marijuana ... typically purple haze."}, {"word": "headdesk", "def": "When a simple facepalm won't do, try a headdesk. Referring to the act of lowering your forehead to your desk, headdesk is an expression of extreme frustration, aggravation, or resignation."}, {"word": "heads up", "def": "As an exclamation, Heads up! is used to call attention to danger or another important matter. As a basic noun, a heads-up is an advance notice or warning."}, {"word": "heal slut", "def": "Heal slut is a humorous but vulgar term for healer characters in video games or the players controlling them."}, {"word": "hell to the naw", "def": "Hell to the naw is an expressive and intensive slang way to say \"no.\""}, {"word": "hey hey hey", "def": "Hey hey hey! Check it out: Hey hey hey is a way of getting someone's attention or announcing oneself, often used playfully and popularly known as the catchphrase of the cartoon character Fat Albert. It can also be used more sternly to call out bad behavior."}, {"word": "high key", "def": "In slang, high-key is the opposite of the more commonplace low-key, or \"secretive\" or \"restrained.\" So something high-key is \"intense\" and \"out in the open.\" It's often used as an adverb for \"very,\" \"really,\" or \"clearly.\""}, {"word": "hit the quan", "def": "Hit the Quan is a hip-hop dance and song by rapper iHeartMemphis. Key movements include stepping, squatting, and swinging of the arms, mimicking the lyrics “I said get down low and swing your arm.”"}, {"word": "hmm", "def": "Hmm is an interjection and exclamation widely and variously used to indicate reflection, express suspicion, and request clarification, among many other senses."}, {"word": "hobknocker", "def": "Hobknocker is, originally, a piece of construction equipment similar to a jackhammer, but people sometimes use it as an insult ... because it sounds dirty."}, {"word": "holler", "def": "Holla at your dictionary! To holler is \"to shout,\" extended to \"say hello\" or \"hit on\" in Black English."}, {"word": "home away home", "def": "Home away from home refers to a location where one does not reside but one in which they feel as comfortable as they would in their own abode."}, {"word": "honeymoon handshake", "def": "Honeymoon handshake is a humorous, vaguely defined sex act apparently made up by the sitcom Modern Family."}, {"word": "hopeless romantic", "def": "A hopeless romantic is a person who holds sentimental and idealistic views on love, especially in spite of experience, evidence, or exhortations otherwise."}, {"word": "hosehead", "def": "A hosehead or hoser is a derogatory slang term for an “idiot” or “loser,” especially stereotyped as Canadian beer-drinking bumpkins."}, {"word": "hot mess", "def": "You might be hot and you might be a mess, but are you a hot mess?"}, {"word": "hotep", "def": "Hotep is used as a greeting among many Afrocentrists. Afrocentrists themselves are sometimes called hoteps, usually derisively."}, {"word": "hotwife", "def": "A hotwife is a married woman who has sexual relationships outside of her marriage, with the full knowledge and consent of her husband, who himself doesn’t have affairs."}, {"word": "how you doing", "def": "How you doing is an informal greeting like How's it going. It is most commonly known as the signature pickup line of character Joey Tribbiani from the sitcom Friends."}, {"word": "hugs and kisses", "def": "Grandma, you're pinching my cheeks too hard! Hugs and kisses is an expression of love, physical and emotional affection, and well wishes, often written as XOXO when signing off on a message."}, {"word": "hulk smash", "def": "Hulk smash is the trademark slogan of the Incredible Hulk, a Marvel Comics Universe character."}, {"word": "humblebrag", "def": "Ugh, my phone is so old! I'm embarrassed to take it with me during my dates with supermodels and actors."}, {"word": "hun", "def": "While hun is a general term of endearment (short for honey), it's also used as dismissive slang for people peddling multi-level marketing, or pyramid schemes."}, {"word": "hunh", "def": "Hunh is an interjection that conveys annoyance, confusion, or curiosity. It also adds emphasis at the end of the question."}, {"word": "hunty", "def": "Hunty, a blend of honey and cunt(y), is a sassy term of endearment used in the drag community."}, {"word": "hurt locker", "def": "Hurt locker is a slang term for a place of deep pain and discomfort. To be put in the hurt locker signifies that something profoundly troubling or painful has happened to you."}, {"word": "hypebeast", "def": "A hypebeast is a mostly derogatory slang word for someone, usually a man, who follows trends in fashion, particularly streetwear, for the purpose of making a social statement."}, {"word": "i cant even", "def": "I can’t even is an emotional exclamation in response to an event. Its abrupt ending implies something is too amazing, frustrating, surprising, exciting (or any other adjective imaginable) to handle, which renders a person speechless because they’re so incredulous."}, {"word": "i digress", "def": "I digress is a phrase used when someone realizes they've been rambling ... for a long time ... about something that isn't even relevant to the original question or topic. It can also call attention to a smart observation."}, {"word": "i have a dream speech", "def": "The I Have a Dream speech is a famous and influential speech delivered by civil rights activist Martin Luther King Jr. in 1963."}, {"word": "i know", "def": "When used as an exclamation, I know! indicates perfect agreement, empathy, or understanding. The phrase can also communicate frustration, contrition, or an idea."}, {"word": "love moon back", "def": "I love you to the moon and back, sometimes shortened to love you to the moon and back, is used to express the vastness of one’s affection for another."}, {"word": "i mean", "def": "The expression I mean is variously used in conversation as a filler phrase; an emphasis marker; a way to reorganize, clarify, or qualify a thought; or to express disbelief or disapproval."}, {"word": "i see what you did there", "def": "I see what you did there is a colloquial expression acknowledging, with appreciation or sarcasm, that one gets a clever joke or witty remark."}, {"word": "i swear", "def": "I swear is used to make an oath of honesty, particularly in legal settings. In less formal use, I swear is used for emphasis or exaggeration when sharing something exciting, frustrating, or hard to believe."}, {"word": "im bored", "def": "I'm bored is a common way for kids (and internet users) to complain about their lack of interest in what's going on around them. It's often seen in expressions like I'm bored by/to/of/with (something)."}, {"word": "im feeling lucky", "def": "I’m feeling lucky conveys hope for or optimism about a chance outcome, especially gambling."}, {"word": "iconic", "def": "If something or someone is considered iconic, they're very influential, recognizable, and revered (e.g., Rembrandt is an iconic painter)."}, {"word": "ight", "def": "If you're hanging in there, having a good time, or if you're just a decent human, you're ight. Ight is black colloquial English for all right."}, {"word": "ignant", "def": "Ignant is a form of \"ignorant\" or \"an ignorant person\" in Black English. It's a slang way of calling someone \"stupid\" or \"ridiculous,\" or saying \"going wild and crazy.\""}, {"word": "immoral minority", "def": "Immoral Minority is used by opponents of the Christian conservative group: the Moral Majority, both as an ironic label of self-identification and criticism of the Moral Majority or those with similar views."}, {"word": "in a jiffy", "def": "Before we did everything in a hot second, we did them in a jiffy, an informal expression for \"in a very short time.\""}, {"word": "in the field", "def": "In the field is an idiom with several, related meanings. When someone's in the field, they're \"in direct contact with a source of data or subject of interest,\" as in doing work outside an office or laboratory. It can also mean \"in actual use,\" like a product release after R&amp;D, or it can have the more literal sense of \"within a given profession or area of expertise.\" It's also slang for working hard or enduring the challenges of real life."}, {"word": "in the meantime", "def": "The expression in the meantime variously refers to a period of time between two events. "}, {"word": "incel", "def": "Short for involuntary celibacy, incel refers to an internet subculture of men who blame women for the fact that they are not having sex."}, {"word": "ion", "def": "In science, an ion is an atom or molecule with an electric charge. Outside of the Chemistry classroom, though, ion is a black slang rendering of I don't. As in ion wanna take another Chemistry class."}, {"word": "irish goodbye", "def": "Bad party? Too drunk? Or, just hate long goodbyes? Then, the Irish goodbye may be for you!"}, {"word": "irish twins", "def": "Irish twins is a slang expression for siblings born less than a year apart from each other. While some people intend it affectionately, it does stereotype Irish culture, making it mildly offensive."}, {"word": "issa", "def": "Issa is a contraction of it's and a, as in \"issa contraction of it's and a.\" The term was made popular by a 2016 interview with rapper 21 Savage."}, {"word": "its a jersey thing", "def": "There is a strange, dark land along the Atlantic Ocean where the people have terrible fake tans and actually enjoy Bon Jovi. Why do they act this why? You wouldn’t understand: It’s a Jersey thing."}, {"word": "its lit", "def": "Its lit means that something is really good, intense, fun, or exciting, similar to other slang terms such as poppin’ or off the chain."}, {"word": "jagoff", "def": "A jagoff is a jerk, idiot, or really any kind of irritating or unlikeable person, not unlike douchebag. It's closely associated with the city of Pittsburgh, ya jagoff."}, {"word": "janky", "def": "Janky is a slang term for something run down, of poor quality, or unreliable. It can also be used for someone considered undesirable in some way."}, {"word": "jawn", "def": "Jawn is Philadelphia slang for anything ... literally anything."}, {"word": "jeebus", "def": "Help us, Jeebus! Jeebus (or Jebus) is a humorous substitute for Jesus, sometimes used to avoid blaspheming, other times to poke fun at believers, and most often just as a playful interjection."}, {"word": "jeepers creepers", "def": "People still say jeepers creepers?"},{"word": "jesus take the wheel", "def": "Jesus take the wheel is a request for divine intervention. It is sometimes used seriously, and sometimes used humorously."}, {"word": "jive turkey", "def": "A jive turkey is someone who is unreliable, makes exaggerations or empty promises, or who is otherwise dishonest. The phrase is so associated with 1970s culture."}, {"word": "joe sixpack", "def": "A Joe Sixpack is an average, working-class American male. He is often characterized—sometimes positively, sometimes negatively—as a guy who isn't very highly educated, who likes sports, and who enjoys putting back a couple of beers."}, {"word": "jonesing", "def": "If a person has an insatiable craving for someone or something, they are said to be jonesing for it."}, {"word": "juggalo", "def": "A Juggalo is a fan of the Detroit-based rap duo Insane Clown Posse (ICP) or the other groups on their Psychopathic Records label. Female Juggalos are sometimes called Juggalettes."}, {"word": "juice", "def": "Do you got the juice? One has juice if they have respect, influence, power, authority, or sexual desirability. It can also be slang for alcohol and electric power, among other things."}, {"word": "jump out boys", "def": "Sometimes carrying a derogatory tone, jump out boys is slang for \"the police\" or \"law enforcement officers.\""}, {"word": "kavanaseous", "def": "Kaya is a slang word for marijuana closely associated with Bob Marley."}, {"word": "keep calm and carry on", "def": "Commonly featured on posters, clothing, novelty items, and internet memes, keep calm and carry on is a popular slogan calling for persistence in the face of challenge. It was first used on a British propaganda poster during World War II but now enjoys general currency as an expression of resilience."}, {"word": "keep it 100", "def": "Keep it 100 is a slang phrase that means being authentic and truthful, akin to \"keeping it real.\""}, {"word": "kek", "def": "Kek is an online term with similar meanings to LOL or haha, used especially by gamers. Since the 2016 US presidential election, the Egyptian god Kek, portrayed as Pepe the Frog, has become a symbol of the so-called “alt-right.”"}, {"word": "kiki", "def": "A kiki is a social gathering, usually for the purpose of casually “kicking back,” gossiping, and sharing stories. It is historically connected to LGBTQ communities."}, {"word": "kino", "def": "Kino variously refers to a category of art-house cinema on internet message boards, an experimental film movement, or a term for intimate touch among certain men trying to seduce women."}, {"word": "kissanime and chill", "def": "Want to Netflix and chill but watch anime instead and, you know, do other stuff? No, we're not asking you. We're just explaining what it means to KissAnime and chill."}, {"word": "kite", "def": "These aren’t the kites they sing about at the end of Mary Poppins. In US prison slang, a kite is a message or note, historically contraband notes passed between prisoners or smuggled out of prison."}, {"word": "kumbaya", "def": "Rooted in an American spiritual and folk song of the same name, kumbaya refers, often disparagingly, to moments of or efforts at harmony and unity."}, {"word": "lalaland", "def": "Lalaland is a colloquial term for \"being out of touch with reality,\" usually due to bliss or ignorance."}, {"word": "laldy", "def": "In Scottish slang, a laldy is a \"beating\" or \"thrashing.\" The expression to give it laldy means doing something with lots of energy and vigor, e.g., with gusto."}, {"word": "lamo", "def": "Don't be a lamo! Lamo is an occasional spelling of the insult lame-o, or \"pathetic (person or thing).\" It can also be used as an ironic take on the acronym LMAO (laughing my ass off)."}, {"word": "larry stylinson", "def": "Larry Stylinson is the nickname given to the pairing of One Direction members Louis Tomlinson and Harry Styles, who some fans believe have a secret relationship."}, {"word": "laying pipe", "def": "The expression laying pipe is a very visual euphemism for using one's penis to \"have vigorous sex with\" another. Tl;dr: Pipe is slang for \"penis.\""}, {"word": "lean", "def": "Lean is a slang term for prescription cough syrup infused with codeine and promethazine. It’s popularly known in hip-hop culture by several nicknames including “purple drank” or “sizzurp.”"}, {"word": "left on read", "def": "In internet slang, a person is left on read when a recipient has read, but not responded to, a sender's message. The expression is often used to express feeling ignored."}, {"word": "lets go", "def": "Let's go is an expression variously and widely used to take leave, show excitement, cheer, express impatience, or challenge someone."}, {"word": "lil", "def": "Li’l is an abbreviation of the word little. It’s often used in names or titles to emphasize youth or physical size."}, {"word": "libtard", "def": "Libtard is an insult usually used by conservative trolls online to characterize liberals as stupid."}, {"word": "like a boss", "def": "To do something like a boss is to do it with stylish confidence or authority. This can be applied, tongue in cheek, even to fairly mundane tasks."}, {"word": "lmgtfy", "def": "Lmgtfy is an internet acronym standing for let me Google that for you, used when someone requests information that they could have easily found themselves."}, {"word": "lurking", "def": "Lurking is lying hidden or moving about secretly, as if to ambush someone. In internet culture, it specifically refers to browsing social media sites or forums without engaging with other users."}, {"word": "mac 10", "def": "MAC-10 is the nickname for a submachine gun, officially designated the M10, and originally manufactured by the Military Armament Corporation."}, {"word": "mad dog", "def": "Mad dog is slang term used to describe someone as \"wild and crazy.\" It is often used as a nickname or to describe a kind of mean stare. "}, {"word": "mafa", "def": "We have had it with these mafa snakes on this mafa plane! Like mofo and muhfuh, mafa is a shortening of the slang, motherfucker."}, {"word": "make it rain", "def": "To make it rain is to freely give out cash or other items, make a lot of money, or become a big success."}, {"word": "mancelled", "def": "Before the #MeToo movement took off in 2017, mancelled was sometimes used to refer to dudes being flakey and cancelling their plans. In the post-#MeToo era, problematic or offensive men can expect to get mancelled, a blend of man and cancelled, i.e., shunned."}, {"word": "mandela effect", "def": "The Mandela Effect refers to when a large number of people share a false memory, originally attributed to the existence of multiple universes."}, {"word": "mangina", "def": "Mangina is a derogatory term for any man perceived as effeminate, especially used online to put down men who identify as feminists. It can also insult the genitals of persons of all gender identities."}, {"word": "mannequin challenge", "def": "The mannequin challenge refers to a viral video trend in which a group of people are filmed frozen in position like mannequins."}, {"word": "manojob", "def": "A manojob is the name of a pornography website and a slang coinage for the sexual act of a hand job."}, {"word": "manosphere", "def": "Are you a meninist? Advocate of men’s rights? Just plain hate womankind? Then the manosphere might be the place for you! As for the rest of the population, y'all probably wanna steer clear …"}, {"word": "mansplain", "def": "To mansplain is for a man to explain something to a woman in a condescending manner, particularly when the woman is an expert in the subject."}, {"word": "mayo", "def": "Typically, mayo is short for mayonnaise, a classic condiment made of oil, vinegar, and egg yolks. When not, it can also be a slur against white people or a slang term for drugs."}, {"word": "mean the world", "def": "To mean the world to someone is an idiomatic way of saying they are exceptionally valued and important, often used for love."}, {"word": "mean mugging", "def": "Have you ever seen someone look at you a little funny, or give you a dirty look? That's mean-mugging, or the act of glowering at someone with an intimidating, irritated, or judgmental facial expression."}, {"word": "meninist", "def": "A meninist is someone who—wait for it—believes men are victimized by feminism and that attention needs to be called to what they believe are the struggles of being a man in the 21st century."}, {"word": "merkin", "def": "A merkin is a pubic wig. It is placed over the genitals to simulate pubic hair and to keep the private body parts from full exposure."}, {"word": "middle finger", "def": "Middle finger means fuck you. The end."}, {"word": "mile high club", "def": "The mile high club is a slang term for people who’ve had sex during a flight. Mile high alludes to the high altitude of air travel and club refers to the act’s rarity and exclusivity."}, {"word": "milkshake", "def": "From a 2003 pop song of the same name, milkshake is a slang term for an attribute that makes a woman stand out."}, {"word": "milkshake duck", "def": "A Milkshake Duck is a person (or thing) who becomes extremely popular on the internet for some positive reason, but as their popularity takes off and people dig into their past, they quickly become an object of outrage and hatred."}, {"word": "millennials", "def": "The millennial years range from the early 1980s to the early 2000s. Millennials are people that were born at any time during this period."}, {"word": "mind blown", "def": "Mind blown is used as an exclamatory response to surprising or interesting facts or enlightening information."}, {"word": "mist", "def": "A mist is, literally speaking, a cloud of fine liquid droplets, but in slang it can variously refer to drugs and the experience of being on them. Mist can also be an alternative spelling or misspelling of missed."}, {"word": "mlem", "def": "Is that peanut butter on my nose? Mlem!"}, {"word": "mmk", "def": "Mmk is a casual, half-humming way to say OK. It is a versatile sound, used to express mild disproval and suspicion ... or warm affirmation. Be careful, though, as mmk can come across as a little patronizing or rude."}, {"word": "moar", "def": "Moar is an intentional misspelling of more, used online as a humorous demand."}, {"word": "molly percocet", "def": "Molly Percocet isn't the name of that girl next door. Nope, it's the name of two drugs, molly (MDMA) and Percocet (oxycodone), often taken together recreationally and referenced in rap artist's Future's hit 2017 song, \"Mask Off.\""}, {"word": "molon labe", "def": "From the Greek for “come and take them,” molon labe is a slogan used to express defiance, and is frequently employed by gun-rights advocates in the US."}, {"word": "mondaze", "def": "Mondaze is a blend of Monday and daze, a humorous term for the stupor some find themselves in at the start of the work week."}, {"word": "mongo", "def": "Mongo can be a slang term for \"huge\" or \"extremely.\""}, {"word": "moon crickets", "def": "Though it may sound fanciful and innocent, this term is absolutely not. "}, {"word": "moon rocks", "def": "Yes, moon rocks can refer to rocks from the actual moon, but nobody is smoking those (as far as we know)."}, {"word": "moonbat", "def": "A moonbat sounds more like some something from a science-fiction novel than a political insult for people with left-leaning political views. In fact, that's exactly where the term comes from ..."}, {"word": "moose knuckle", "def": "Moose knuckle is a slang term for when the outline of man’s genitalia are visible through particularly tight or hiked-up clothing."}, {"word": "more cowbell", "def": "More cowbell is a pop-culture catchphrase that stems from a comedy sketch about 1970s rock music. The sketch centers around a character who seems to believe that the cowbell, a simple percussion instrument, is the secret ingredient to make a song work. More cowbell can stand in for anything that a person is longing for or feels is lacking. The phrase may also be used as a simple shout-out to other fans of the sketch."}, {"word": "mormon underwear", "def": "Mormon underwear refers to a conservative type of underwear, considered sacred, worn at all times by members of the Church of Jesus Christ of Latter-day Saints (LDS), or the Mormon Church."}, {"word": "morning skinny", "def": "Let's face it: Getting out of bed in the morning is the worst. But if you're body-conscious, there might be one perk: morning skinny."}, {"word": "morning wood", "def": "Morning wood is a slang term for an erection experienced first thing in the morning."}, {"word": "mud shark", "def": "Warning: This article features information about a racial slur that is highly offensive and that should not be used ... ever."}, {"word": "muff cabbage", "def": "Muff cabbage is a vulgar, vagina-based insult popularized by a 2010 South Park episode."}, {"word": "mufo", "def": "Mufo is short for mutual follower, referring to someone you follow on social media who follows you back."}, {"word": "muh", "def": "Muh is a pronunciation of the pronoun my found in some dialects of English. Online, it can be used to portray someone as ignorant or just to sound cute and silly."}, {"word": "mula", "def": "Mula is a common and widespread slang term for money, used much like other monetary slang items such as dough or bones."}, {"word": "murica", "def": "If your a beer-swillin', gun-totin', freedom-lovin', flag-wavin', red-blooded person from the U S of A, you might say you live in Murica."}, {"word": "murphys law", "def": "Murphy's Law is the idea that if something can go wrong, it will. Because ¯_(ツ)_/¯."}, {"word": "n2o", "def": "N2O, NOS, and nitrous are all used as shorthand by car and racing enthusiasts for the gas nitrous oxide."}, {"word": "nailed it", "def": "Nailed it is an expression used to comment on the successful, skillful, or clever completion or performance of something. It’s often used sarcastically in reference to efforts that comically failed."}, {"word": "naked otter", "def": "Outside occasional literal references to hairless or shaved otters, a naked otter is a slang term for nude pictures of a slim, hairy gay man."}, {"word": "nappy hair", "def": "Nappy hair is historically used as a derogatory term to describe the hair of black people, especially women, many of whom have re-appropriated the term."}, {"word": "nasty girl", "def": "A nasty girl variously refers to an ill-tempered, sexually adventurous, or self-empowered young woman."}, {"word": "national send a nude day", "def": "National Send a Nude Day is a joke hashtag and holiday dedicated to sending nude photographs. The ambiguity of the intended recipients of the photos and the broader public reaction to it helped transform it into a trend on social media."}, {"word": "nawf", "def": "Nawf is a dialectical pronunciation and spelling of \"north,\" commonly associated with Black English. The popular rap group Migos to refer to north Atlanta, Georgia as the Nawf."}, {"word": "nd", "def": "Nd is a typo or short form of and, common in digital communication. "}, {"word": "neckbeard", "def": "A neckbeard is an informal term for facial hair on the neck, usually ungroomed, and sometimes accompanied by little or no hair on the rest of the face. It is often used to stereotype nerds or geeks."}, {"word": "negging", "def": "Negging is the practice of giving backhanded compliments and generally making comments that express indifference toward another person (usually a woman) in an attempt to seduce that person."}, {"word": "netflix and chill", "def": "Netflix is the popular TV- and movie-streaming service. Chill is a verb that, in this context, means relaxing. Netflix and chill, as a distinct phrase, means to watch Netflix with a romantic prospect, with the eventual expectation of sexual activity."}, {"word": "nice guy", "def": "He's a nice guy, but ..."}, {"word": "nickel", "def": "Nickel is a slang term for \"five\" of anything, most commonly a five-dollar or small bag of drugs ... but it could also be a five-year prison sentence."}, {"word": "nifoc", "def": "Enjoyed by nudists and masturbators alike, NIFOC stands for naked (or nude) in front of computer. It is often used humorously and facetiously online, but you can never be too sure when it comes to the internet."}, {"word": "no cap", "def": "The expression no cap is slang meaning \"no lie\" or \"for real,\" often used to emphasize someone is not exaggerating about something hard to believe."}, {"word": "no mames", "def": "No mames is crude Spanish slang used to express disbelief (both positive and negative) or excitement. Used especially among Mexican Spanish speakers, the exclamation corresponds to “No way!”, “You’re kidding me!”, or “Stop messing with me!”. For instance, a statement of “I won the lottery” might be followed by “no mames.”"}, {"word": "no new friends", "def": "No new friends is a motto coined by the hip-hop artist Drake, taken from the song of the same name. It describes the stance that someone is going to stick with the friends they already have. They don’t need #NoNewFriends."}, {"word": "no shave november", "def": "No-Shave November refers to an annual charity event where men don’t shave, groom, or cut their facial hair for the entire month of November as a way of raising awareness and money to fight cancer."}, {"word": "noice", "def": "Noice, or nice pronounced with an exaggerated Australian accent, is a synonym for awesome. This spelling is helpful for internet users to convey the pronunciation in text."}, {"word": "noob", "def": "Get wrekt, n00b! In internet slang, noobs are hapless, unskilled beginners who don't know what they are doing. As far as gamers are concerned, a noob is a nothing more than an easy kill—or a real nuisance as a teammate."}, {"word": "nootropics", "def": "Nootropics, also known as smart drugs, are drugs or other supplements used by cognitively healthy individuals in an effort to increase their cognitive functioning."}, {"word": "og", "def": "OG is a slang term for someone who's incredibly exceptional, authentic, or \"old-school.\" It can be earnestly used for a legend like Michael Jordan or more ironically, like for that friend who can unwrap a Starburst with their mouth."}, {"word": "oh my", "def": "How many meanings and uses you have, oh my. This common interjection variously expresses surprise, concern, and admiration. It's sometimes used for quaint or humorous effect."}, {"word": "oh my god", "def": "Oh my god is an exclamation variously expressing disbelief, frustration, excitement, or anger. Its abbreviation, OMG, is widely used in digital communication."}, {"word": "oh my lord", "def": "Oh my lord is an exclamation variously and widely used to express surprise or frustration. It's commonly abbreviated as OML online."}, {"word": "oh", "def": "Oh. is a reaction showing various feelings such as annoyance, sadness, surprise, or disappointment, especially in text messages or social media posts. Oh.'s tone can range from sincere to sarcastic. It's also used in the construction Oh. My. God., an emphatic text form of oh my god."}, {"word": "old king clancy", "def": "You say you have a Canadian girlfriend? Oh yeah? Did she give you an Old King Clancy? "}, {"word": "omega wolf", "def": "An omega wolf or male can refer to an independent man who succeeds outside of social hierarchies. It can also refer to a weak, unsuccessful “loser.”"}, {"word": "on fleek", "def": "'Bout to crunk. Eyebrows on fleek. Dafuq."}, {"word": "on point", "def": "On point is \"exactly right\" or \"perfect.\" In slang, the expression often describes someone as \"on their game\" or \"looking sharp.\""}, {"word": "on smash", "def": "The expression on smash means to have something under your control, like you're completely in charge of it or \"owning\" it. When the club is on smash, everyone is having a great time partying."}, {"word": "on the clock", "def": "Working hard or hardly working? If you're on the clock, it should be the former."}, {"word": "on the house", "def": "On the house is an idiom meaning \"free of charge.\""}, {"word": "one step ahead", "def": "One step ahead is an expression used to describe someone who or something that is more prepared, advanced, or skilled."}, {"word": "oogle", "def": "An oogle is a panhandler who lives on the streets, most frequently a new or unserious one who is perceived as homeless by choice, rather than by necessity."}, {"word": "op", "def": "On internet forums and message boards, OP is short for original poster, or the person who started the thread that users comment on. "}, {"word": "open relationship", "def": "An open relationship is one where an established couple has mutually agreed to share a non-monogamous lifestyle. This includes either or both parties having other sexual and/or romantic partners. This type of relationship is carried out with the consent and knowledge of all parties involved. Otherwise, it is considered infidelity."}, {"word": "oppai", "def": "From the Japanese word for “breasts,” oppai refers to a female character’s oversized “tits” in manga and anime."}, {"word": "or nah", "def": "Or nah, or “or not,” is a colloquial expression used to form to yes-or-no questions."}, {"word": "otaku", "def": "Borrowed from Japanese, otaku refers to a person who is obsessed with manga, anime, and other forms of Japanese or East Asian popular culture."}, {"word": "oxycotton", "def": "Oxycotton is a slang way to refer to the drug oxycodone, a pain-reliever known for its addictive qualities and abuse."}, {"word": "pack of squares", "def": "A pack of squares is slang for a \"pack of cigarettes.\""}, {"word": "papi", "def": "Borrowed by English, papi is a Spanish colloquialism for “daddy,” extended as a general term of endearment like “buddy” for a friend or “my man” for a romantic partner."}, {"word": "papi chulo", "def": "In Latin-American Spanish slang, a papi chulo is an attractive man. While the term originally names a pimp, it has broadened to refer to a ladies’ man."}, {"word": "party hats", "def": "A party hat is a pointed and colorfully decorated cardboard hat, worn over someone's head and usually at birthday parties. It's also slang for a condom."}, {"word": "passive aggressive", "def": "Passive aggressive behavior is a way to express feelings of anger or annoyance, but in a non-forthcoming way. Instead of communicating openly, people who engage in this type of behavior share their negative feelings through actions."}, {"word": "pay to play", "def": "Pay-to-play refers situations where one must exchange money to engage in an activity or to earn favors or influence."}, {"word": "peace of mind", "def": "Peace of mind is a mental state of calmness or tranquility, a freedom from worry and anxiety."}, {"word": "pegan", "def": "Pegan is a combination of the paleo and vegan diets, featuring a lot of vegetables, a moderate amount of lean proteins and healthy fats, and few sugars, starches, and processed foods."}, {"word": "pegging", "def": "Pegging is a sex act where a woman performs anal sex on a man with a strap-on dildo. "}, {"word": "phan", "def": "Phan can variously refer to the ship name of popular British YouTubers Dan Howell and Phil Lester, a superfan of the band Phish, and a ceremonial tray used in Southeast Asian Buddhism."}, {"word": "phat ass", "def": "🎶 You other brothers can't deny 🎶. A phat ass is a big booty, a woman's butt that is appealingly rotund—juicy or thicc, as it were. The adjective phat-ass can refer to anything attractively thick or big, like a steak or marijuana joints, or just otherwise excellent."}, {"word": "pick and roll", "def": "A pick and roll is an offensive play in basketball where a teammate screens off a defender and then breaks free so the ball-carrier can pass it to them."}, {"word": "pickup line", "def": "A pickup line is a planned effort (which usually doesn't work) to start a conversation with a stranger in romantic or sexual pursuit of them."}, {"word": "pics", "def": "Pics is an informal shortening of \"pictures,\" usually used in reference to sharing images online or through text messages."}, {"word": "picture perfect", "def": "Something described as picture perfect is considered flawless or ideal in appearance or character."}, {"word": "pie", "def": "To most of us, pie conjures up an image of a pastry with fruit filling, yum ... but to drug dealers (or users) pie refers to a kilogram of drugs, usually cocaine."}, {"word": "pillow princess", "def": "A pillow princess is a slang phrase that describes someone, mostly an LGBTQ woman, who prefers to receive sexual stimulation more than they do to give it."}, {"word": "pillow talk", "def": "🎶 I love to hold you close, tonight and always / I love to wake up next to you 🎶 Ah, how the melodious lyrics of Zayn Malik perfectly capture the post-coital cuddling and honest, affectionate conversation, called pillow talk. "}, {"word": "pingers", "def": "Pingers are tablets of the illegal drug MDMA, commonly known as ecstasy. The term is associated with Australian slang."}, {"word": "pink clouding", "def": "Pink clouding, or Pink Cloud Syndrome, is a phenomenon many recovering addicts experience when they first go into recovery. When pink clouding, they feel a sense of euphoria that's then followed by a crash once reality sets in."}, {"word": "pink sock", "def": "Isn't it fun to look up a seemingly innocent term only to find something weird instead? Well, we've got you covered: Pink sock is a slang term for rectal prolapse. That's when parts of your rectum protrudes ... which some interpret as one's intestines spilling out ... which they think happens after anal sex. 🙃"}, {"word": "piru", "def": "Among other places, Piru is a street in Compton, California where the Piru Street Boys and Westside Piru gangs originated. The gangs have made Piru a backronym for Pimps (or People) in Red Uniforms, a reference to members of the Bloods, who Piru gangs are allied with. "}, {"word": "pity party", "def": "A pity party is an instance of feeling self-indulgently sorry for yourself."}, {"word": "plata o plomo", "def": "Plata o plomo is a Colombian Spanish slang phrase that translates to “silver or lead.” A person saying the phrase is telling the listener to either accept a bribe (plata, meaning “silver,” a common slang term for money in Colombia) or lose their life (plomo, a metonym for “lead bullet”)."}, {"word": "play by play", "def": "A play-by-play is a running commentary on or detailed summary of an event, used especially in sports."}, {"word": "plead the fifth", "def": "To plead the fifth means to refuse to answer a question, especially in a criminal trial, on the grounds that you might incriminate yourself."}, {"word": "pleb", "def": "A pleb, short for plebeian, is a person who is considered too ordinary and or a thing deemed commonplace, e.g., basic and normie."}, {"word": "plenty of fish", "def": "There's plenty of fish (in the sea) means a single person still has lots of options out there for future partners. It's often said in consolation after a breakup—not that it always helps. The saying is the basis of the name of an online dating website, Plenty of Fish, often abbreviated as POF."}, {"word": "plox", "def": "Want a definition? Say plox!"}, {"word": "plug", "def": "A plug (or the plug) is a person who has the ability to get or supply hard-to-find items, especially drugs."}, {"word": "plugged in", "def": "Get with it! If you're plugged in, you're in the know. You can also be so plugged in to a task, usually a technological one, to the point where you shut everything else out."}, {"word": "plumbers crack", "def": "A plumber's crack is the top of a person's buttocks as seen when they bend over and their pants slide down."}, {"word": "poes law", "def": "Poe’s Law is a popular adage that says satirical expressions of extremism online are hard to distinguish from genuine ones without indicating intent."}, {"word": "pop the cherry", "def": "We suppose you could technically pop a cherry by squashing the stone fruit, but the slang expression pop the cherry means to \"lose one's virginity\" or \"do something one has never done before.\""}, {"word": "poppin", "def": "When used as an adjective, poppin’ is a synonym for awesome, popular, or fresh, especially prominent in US black slang."}, {"word": "porn name", "def": "Porn name can refer to an alternate identity for stars of pornographic movies, similar to a stage name or pseudonym. More recently, porn name has been used in reference to a somewhat humorous moniker used for private sexting or porn-related activity online."}, {"word": "pornstache", "def": "A pornstache is a mustache that makes the wearer look sleazy, predatory, or cheaply groomed."}, {"word": "poseur", "def": "A poseur, commonly spelled poser, is when you act like someone you're not or when you're perceived to be inauthentic. So-called emo scene kids might be called poseurs."}, {"word": "posh", "def": "The adjective posh means that something or someone is rich, fancy, or otherwise smells of that sweet, sweet money."}, {"word": "power couple", "def": "A power couple is a romantic or married couple where both members are famous or accomplished in their own right, sometimes extended to happy and productive everyday couples."}, {"word": "praise the sun", "def": "Featured in the video game Dark Souls, Praise the Sun is an expression of relief, delight, or gratitude, often used humorously and accompanied with uplifted arms."}, {"word": "prep", "def": "Preps are people who live a preppy lifestyle, a subculture that grew out of the elite preparatory boarding schools located in the Northeastern region of the United States and attended by young, wealthy, white people, typically male. Benefits include summers on the Cape, job opportunities through your well-connected dad, and wardrobes full of pink shorts and boat shoes."}, {"word": "problem child", "def": "A problem child is a child who is considered difficult ... you were probably one, right?"}, {"word": "problematic fave", "def": "A problematic fave is a character or person who’s done or said offensive (i.e. problematic) things. Your fave is problematic is a phrase that usually accompanies a cited list of these offensive things. The term is used exclusively in discussions about fandom, celebrities, and media."}, {"word": "psychonaut", "def": "A psychonaut is someone who explores altered states of consciousness, especially through hallucinatory drugs."}, {"word": "puke", "def": "Don't lose your lunch, but puke is an informal way to say vomit."}, {"word": "pump", "def": "Among many other slang senses, pump is short for pump-action shotgun, a type of shotgun that requires the user to change the shell with a pumping-like action."}, {"word": "puppet master", "def": "A puppet master is a person or group that secretly controls other people or things, as if they were puppets."}, {"word": "pussy", "def": "Fair warning ... when you talk about a pussy you end up talking a lot about Donald Trump. Pussy is a pet name for a domestic cat, vulgar slang for the vagina, and a term of abuse for a coward."}, {"word": "pussy whipped", "def": "This pussy wears the pants in this relationship. Pussy whipped is an insult for a man who is seen as being controlled by his stronger-willed female romantic partner."}, {"word": "putlocker and chill", "def": "The slang Putlocker and chill refers to relaxing at home by streaming movies or TV from an illegal site."}, {"word": "qq", "def": "Qq is an emoticon that represents \"crying.\" In the gaming community, it is used as a taunt against players seen as unskilled or weak. Elsewhere online, qq variously denotes sadness, loss, or \"crying.\""}, {"word": "quid pro quo", "def": "Tit for tat. You scratch my back, I'll scratch yours. Or, if you want to get a little fancier, quid pro quo."}, {"word": "quirkyalone", "def": "Table for one, please. A quirkyalone is a person who prefers being single to being in relationship with someone just to be in one."}, {"word": "quits", "def": "Stick a fork in it, it’s done! If someone quits, they abruptly give up on something, especially leaving a job, relationship, or game."}, {"word": "rabbit hole", "def": "Used especially in the phrase going down the rabbit hole or falling down the rabbit hole, a rabbit hole is a metaphor for something that transports someone into a wonderfully (or troublingly) surreal state or situation. On the internet, a rabbit hole frequently refers to an extremely engrossing and time-consuming topic."}, {"word": "radass", "def": "Radass is a slang term meaning \"awesome.\""}, {"word": "rafiki", "def": "To Rafiki someone is to smear a substance on their forehead, which can be sexual in nature, or to lift up someone or something for honorary public presentation. Both meanings stem from the cartoon mandrill Rafiki from Disney’s The Lion King."}, {"word": "rainbow baby", "def": "A rainbow baby is a baby that is born after a miscarriage, stillbirth, or loss of an infant."}, {"word": "rat rod", "def": "A rat rod is a custom car with a deliberately worn-down, unfinished appearance, typically lacking paint, showing rust, and made from cheap or cast-off parts."}, {"word": "ratchet", "def": "Ratchet is a slang term variously insulting a person, usually a black woman, as whorish, low-class, and trashy."}, {"word": "realest", "def": "Realest is the superlative form of real, used in slang for someone or something \"extremely authentic\" or \"exceptional.\""}, {"word": "red pill", "def": "Red pill refers to the truth behind a situation, especially a truth that is difficult to accept."}, {"word": "reindeer games", "def": "Reindeer games is a colloquial expression generally used for the bullying activities of a clique or for festivities around the Christmas season."}, {"word": "rekt", "def": "Rekt means “wrecked or destroyed.” It is often used to refer to someone who is losing—badly—in a game or contest, but it can also be used to refer to someone who is in an extreme state of drunkenness."}, {"word": "renig", "def": "Renig is a common misspelling of renege, variously used for \"backing out on an agreement\" and often mistaken as a racial epithet."}, {"word": "reply girls", "def": "In the early 2010s, reply girls were a type of female YouTube user who, by exploiting the video platforms's algorithm and using sexually suggestive thumbnails for videos, earned enough views on their channels to monetize their content."}, {"word": "reverse cowgirl", "def": "Giddy up! Reverse cowgirl is a sex position in which a woman straddles a male partner while facing away from him."}, {"word": "rickrolling", "def": "Rickrolling is when you troll someone on the internet by linking to the music video for Rick Astley’s 1987 hit song “Never Gonna Give You Up.” It is, by far, the most popular example of bait-and-switch linking."}, {"word": "rico suave", "def": "Rico Suave is a generic name and stereotype for a smooth, flashy Latino lover."}, {"word": "riddle me this", "def": "Riddle me this is a stock phrase used to introduce a riddle, joke, observation, or question."}, {"word": "ride or die", "def": "Ride or die is a colloquial expression of extreme loyalty to someone or something."}, {"word": "ride the snake", "def": "To ride the snake is to use powerful drugs or have a hallucinatory experience on them."}, {"word": "riding shotty", "def": "The expression riding shotty is another way of saying riding shotgun, or sitting in the passenger seat in a car up front next to the driver."}, {"word": "rigged", "def": "When something is rigged, it has been fraudulently manipulated by someone to get their desired outcome, e.g., the game was rigged in favor of the home team."}, {"word": "roasties", "def": "Nope. We're not talking about potatoes. We're talking about immature dudes and coarse slang for the vulva."}, {"word": "rod", "def": "A stick, a handgun, a car, and an erect penis all walk into a bar..."}, {"word": "roger that", "def": "Roger that is a phrase used to affirm or acknowledge a statement or question."}, {"word": "rolling in the deep", "def": "Rolling in the deep is both a lyric and song by Adele. It suggests emotional closeness and dependence, especially in a romantic relationship."}, {"word": "rubber band", "def": "The handy, dandy rubber band, useful for flinging at people and holding together important things, like stacks of cash money, as rubber bands refer to in hip-hop slang."}, {"word": "rule 34", "def": "Rule 34 means “If it exists, there is porn of it. No exceptions.” This is an imaginary law that states that if there’s any conceivable idea that could be turned into pornography, then that type porn already exists. This refers specifically to the immense ubiquity of porn materials across the internet, which cover a wide range of subjects that are considered socially unacceptable or just plain bizarre."}, {"word": "rule 63", "def": "Rule 63, one of the self-styled rules of internet, declares: For every fictional character, there exists a gender-swapped counterpart of that character."}, {"word": "rules of the internet", "def": "Rules of the internet refers to a humorous list of unofficial rules guiding online conduct or listing axioms about what the internet is and how users should behave on it."}, {"word": "running man challenge", "def": "The Running Man is a viral dance trend involving a distinctive dance to the song \"My Boo\" by Ghost Town DJ's."}, {"word": "sadcited", "def": "Sadcited describes the feeling of being sad and excited at the same time, especially at the transition from an ending to a beginning."}, {"word": "salty", "def": "Salty is a slang synonym for “bitter” or “irritated.” In this sense, salty is commonly paired with the vulgar word bitch in order to mock a sore loser, as in the phrase, “Don’t be a salty bitch.”"}, {"word": "sapiophile", "def": "A sapiophile is someone who is attracted to intelligence or intelligent people. This attraction can be romantic and/or sexual."}, {"word": "savage af", "def": "On the internet, savage AF is a slang way to characterize something as extremely good, brutally honest, or as a ruthless takedown."}, {"word": "savvy", "def": "It's pillagin' time, savvy?"}, {"word": "scary stories to tell in the dark", "def": "Scary Stories to Tell in the Dark is a series of three books released in the 1980s and 1990s written by Alvin Schwartz and originally illustrated by Stephen Gammell. Though they were written and distributed as children’s books, because of their graphic descriptions and illustrations of violence, Scary Stories to Tell in the Dark has been the subject of controversy with parents and school systems for decades."}, {"word": "scene kid", "def": "A scene kid is a young person who either took part in the scene subculture or who imitates such a style."}, {"word": "schwifty", "def": "Time to get schwifty in here! Schwifty is a made-up term from the animated show Rick and Morty in 2015. It means completely letting loose while partying."}, {"word": "scissoring", "def": "Lesbian scissoring is when two women stimulate each other by interlocking their legs and pressing their genitalia together. A great core workout ... or a way to get kicked in the head during sex."}, {"word": "screw the pooch", "def": "We recommend not being too literal with this one. To screw the pooch is to make a big or humiliating mistake. If you somehow screwed an actual pooch (dog), dear friend, then you seriously screwed the pooch somewhere along the way."}, {"word": "scrub", "def": "No scrubs allowed around here. Scrub is slang for someone who is just plain bad at something—a no-talent hack. This could be in sports, video games, or thanks to TLC's hit song, relationships."}, {"word": "scumbro", "def": "This one's pretty self-explanatory. Scumbro is the name of a men's fashion style and the men who dress in it. Scumbro style involves wearing expensive, designer clothing sloppily or cultivating an unfashionable, poorly put together look."}, {"word": "seacresting", "def": "Seacresting is behaving like American Idol host Ryan Seacrest, especially building suspense, like how he would announce a commercial break right at a climactic moment ... typical Seacrest."}, {"word": "see you next tuesday", "def": "See you next Tuesday is a euphemism for the derogatory slang word cunt."}, {"word": "selfiecide", "def": "Selfiecide is the act of accidentally dying while trying to snap that perfect selfie."}, {"word": "send it", "def": "Send it or I’m still gonna send it is a popular phrase from a viral video on social media. It’s used humorously when performing audacious or dangerous stunts."}, {"word": "send nudes", "def": "Send nudes is a request, usually from a man, for naked pictures, usually of a woman and often on social media, internet dating services, or private text messages. These passionate pleas usually don't result in actual nudes, but they have become the source of a lot of internet humor."}, {"word": "sense of humor", "def": "A sense of humor refers to the ability to find things funny, general enjoyment in doing so, or the particular types of things one finds funny."}, {"word": "seppo", "def": "Seppo is a mildly derogatory Australian slang term for an American, shortened from septic tank."}, {"word": "sexit", "def": "Leaving right after—or to have—sex? This sex-related departure can be called a sexit. Sexit can also be used as a riff on Brexit, describing a given country's hypothetical departure from a larger political body. Sometimes the term is used in political earnestness, but just as often it's used to humorous effect. Because sex."}, {"word": "shag", "def": "Shag means \"to have sex\" with someone in British slang."}, {"word": "shart", "def": "Sometimes, when you're going to breaking some wind ... a little poop sneaks out along with it. This is called a shart, a blend of shit and fart."}, {"word": "shill", "def": "This definition is the greatest definition of all time! A shill is a person who praises or promotes something because they secretly have a personal stake in it."}, {"word": "shipping", "def": "Shipping is the act of wanting two or more fictional characters or celebrities to end up in a relationship, usually romantic."}, {"word": "shit just got real", "def": "If you've ever been in a place so dirty you feel like you need to take a piping hot shower and scrub down with a wire brush, you've encountered a shithole."}, {"word": "shitlord", "def": "Shitlord is slang for an internet troll who posts shocking and often bigoted content for the purpose of provoking a reaction, especially from left-leaning social justice advocates. Some shitlords ironically embrace the term."}, {"word": "shitshow", "def": "A shitshow is a description of an event or situation that takes an unexpected turn and is thrown into chaos. It’s another word for a spectacle or a complete mess. Shitshow can also be used to describe a person."}, {"word": "shiv", "def": "A shiv is a knife, especially a switchblade. It is most often used to refer to improvised blades made in prison and the act of stabbing inmates with them."}, {"word": "shmegma", "def": "Shmegma is a variant of smegma, a white, cottage cheese-like substance that accumulates beneath the foreskin of an uncircumcised penis."}, {"word": "shook", "def": "Shook is the past tense form of shake, used as a slang term to describe feelings ranging from discombobulation and fear to rage and elation, kind of like \"all shaken up.\""}, {"word": "shoop", "def": "Shoop variously refers to a doo-wop nonsense sound sometimes used as mild slang for having sex, internet slang for work in Photoshop, or a humorous singular form of the word sheep."}, {"word": "shroov", "def": "Suggesting feelings of jealousy and revenge, shroov is an internet meme that is used jokingly by fans of Indian actor Karan."}, {"word": "shut up", "def": "If you would just shut up already we'll tell you what shut up means!"}, {"word": "sicko", "def": "Sicko is a slang word for someone considered deranged, sadistic, perverted, disturbed, or the like. Someone who sends unsolicited dick pics, for instance, is a textbook sicko."}, {"word": "side boob", "def": "It's a boob. From the side. Without the nipple showing. It's the side boob."}, {"word": "side eye", "def": "A side eye is a facial expression meant to convey doubt, shock, scorn, or criticism of the person it’s aimed at. It’s made by looking at someone indirectly, out of the corners of the eyes."}, {"word": "side hustle", "def": "A side hustle is a means of making money alongside one's main form of employment or income."}, {"word": "sigh", "def": "A silver fox is an older man, generally with gray or graying hair, who is considered attractive, charming, and classy."}, {"word": "single white female", "def": "Single white female is a phrase used to identify a woman so described in dating contexts."}, {"word": "siren song", "def": "Siren song describes something that is very appealing and alluring on the surface but ultimately deceptive, dangerous, or destructive."}, {"word": "sitrep", "def": "Roger, Charlie, give me a sitrep at 0900! A sitrep is a status report on military activity in an area."}, {"word": "skater boy", "def": "A skater boy is slang (disparagingly and affectionately) for a guy who adopts the style and attitude of a stereotypical rebellious skateboarder."}, {"word": "skeet", "def": "Not that dudes need another way to say cum, but they've got one with skeet, which is slang for ejaculating."}, {"word": "sket", "def": "Familiar with slut, skank, ho, or floozy? Well, add sket to the list, as it’s yet another slang term for a promiscuous woman in the UK."}, {"word": "skinny legend", "def": "Skinny legend is a term of endearment for a celebrity, usually a woman, whose fans consider them to be flawless but underappreciated. It’s also a meme where fans photoshop their idols to appear impossibly stick-figure thin."}, {"word": "skinny love", "def": "The phrase skinny love has two separate meanings, both of which are linked to relationships. Skinny love can refer to two people who have very strong feelings for each other, but are too shy to show it. It can also refer to an existing relationship in which there’s no love or emotional fulfillment, but only a codependent need for affirmation."}, {"word": "skosh", "def": "A skosh is a colloquial and imprecise unit of measurement meaning “a small amount.” The word is sometimes misspelled as scoshe."}, {"word": "skrrt", "def": "Whether you're singing along to trap rappers or making a quick getaway, skrrt is onomatopoeia for the sound of tires screeching. It's especially used as an excited interjection in trap music and by fans of the genre."}, {"word": "slay", "def": "Yaaaaaas! Slay, queen! "}, {"word": "sleazecore", "def": "Popular in the summer of 2018, sleazecore is a fashion trend featuring baggy, informal, and unfashionable articles of clothing that make one look like a schlub. "}, {"word": "slide into the dms", "def": "To slide into the DMs is online slang for sending someone a direct message on social media slickly and coolly, often for romantic purposes."}, {"word": "slime", "def": "Yo, whaddup, slime? Slime is slang for \"friend\"—your homie."}, {"word": "slizzard", "def": "Slizzard is a hip-hop slang word for \"incredibly drunk or high.\""}, {"word": "sloppy seconds", "def": "Sloppy seconds is slang for having sex with someone who's just finished a sexual act with someone else. Less overtly sexual, sloppy seconds also refers to dating someone after they've just broken up with someone in your immediate social group."}, {"word": "slut shaming", "def": "Slut-shaming is the practice of disparaging women, and occasionally men, for acting in a manner that violates \"norms\" regarding sexually appropriate behavior. These denigrations, which are often double standards, range from criticizing women for wearing sexy clothing or having multiple sexual partners to blaming sexual assault and rape survivors for their attacks."}, {"word": "smash hit", "def": "A smash hit is a wildly successful piece of entertainment media, though its use has broadened to any successful enterprise, from beverages to technology. It's kind of like the viral of the pre-internet age."}, {"word": "smash or pass", "def": "Smash or Pass is a game in which participants vote on whether they would smash (hook up with) or pass (not hook up with) another person (e.g., celebrity, stranger) based on a picture or video of them. Ready to get your feelings hurt? Let's play!"}, {"word": "smells like teen spirit", "def": "Smells Like Teen Spirit is an influential 1990s rock song by the band Nirvana."}, {"word": "smol", "def": "In the internet slang of DoggoLingo, smol is an affectionate way of saying someone or something is small in size—so cute you just want to squeeze 'em."}, {"word": "snacc", "def": "A snacc is internet slang for an extremely attractive or sexy person (i.e., you want to gobble them up like a snack)."}, {"word": "snake", "def": "Snake can be slang for a person who acts in a deceitful, underhanded, or backstabbing way."}, {"word": "snatched", "def": "Is your wig still on, queen? In drag slang, snatched is \"fierce\" or \"on point,\" i.e., excellent, especially when it comes to personal appearance."}, {"word": "sneak peek", "def": "A sneak peek is an opportunity to see or experience something before it is officially presented or released to the public."}, {"word": "snitch tagging", "def": "Snitch-tagging is the act of tagging the subject of a negative post about them, especially on Twitter, that they weren't already tagged in (e.g., a subtweet)."}, {"word": "snow bunny", "def": "A snow bunny is an attractive woman who enjoys skiing ... or a white woman who likes or is in a relationship with a black man."}, {"word": "snowclone", "def": "A snowclone is a customizable formulaic phrase that consists of a framework that can be adapted for different situations by changing some of the words. It’s typically expressed in terms of the invariable part of the phrase with blanks represented by X, Y, and Z, for example, X is the new Y."}, {"word": "snowflake", "def": "No, we're not ❄ walking in a winter wonderland ❄.  Snowflake, here, is a political insult for someone who is perceived as too sensitive, often used for millennials and liberals."}, {"word": "snowpocalypse", "def": "A blend of the words snow and apocalypse, snowpocalypse is a major winter storm—the kind that shuts down a city or ... induces some dramatic overreactions."}, {"word": "soccer mom", "def": "\"Jump in, kids, and don't forget your juice boxes!\""}, {"word": "social experiment", "def": "A social experiment is a type of research done in fields like psychology or sociology to see how people behave in certain situations or how they respond to particular policies or programs. "}, {"word": "sofa king", "def": "This definition is sofa king amazing. Read that sentence aloud. Read it again. Get it? Sofa king is a cheeky pun on so fucking. Sofa king clever!"}, {"word": "soo woo", "def": "🎵 Lemme hear ya say \"Soo woo soo woo, soo woo, soo woo!\" 🎵 The term soo woo—along with variants like suhwoop, soo woop, and woop woop—is a greeting and identifier used by the fellow gang members in the Bloods. It is closely associated with Los Angeles and the rapper Lil Wayne."}, {"word": "sophies choice", "def": "Sophie’s choice refers to an extremely difficult decision a person has to make. It describes a situation where no outcome is preferable over the other. This can be either because both outcomes are equally desirable or both are equally undesirable."}, {"word": "sorry not sorry", "def": "Sorry not sorry is a sarcastic way of acknowledging that someone might not like whatever you're saying or doing ... but you don't really care."}, {"word": "soyboy", "def": "Associated with the alt-right, soyboy is an insult used online for men seen as effeminate liberals. It comes from the myth that consuming soy products lowers testerone levels in a man. "}, {"word": "soylent green", "def": "Soylent Green is both the name of a 1973 science fiction film and of a wafer-like food product in the film. The film is a police procedural set in the future, based on the 1966 novel Make Room! Make Room! The food is a processed protein ration made of human beings and distributed to an unsuspecting populace."}, {"word": "spank bank", "def": "A spank bank is a mental, and less often physical and digital, collection of images or situations stored away to call up later while masturbating. "}, {"word": "spare time", "def": "Spare time is free, personal, or leisure time outside of one's work, school, or other primary obligations."}, {"word": "spida", "def": "1. A basketball species usually found above the rim; equipped with superhuman senses, shot-slinging abilities and unrivaled bounce."}, {"word": "spirit animal", "def": "In certain spiritual traditions or cultures, spirit animal refers to a spirit which helps guide or protect a person on a journey and whose characteristics that person shares or embodies. It is also metaphor, often humorous, for someone or something a person relates to or admires."}, {"word": "spooning", "def": "Spooning is a form of cuddling where two people lay on their sides, with one person's back against the other's chest. In this position, the two people resemble two spoons nested together in a drawer. It's sickeningly sweet."}, {"word": "spotify and side hug", "def": "If Netflix and chill is too intimate, you might opt for Spotify and side hug instead."}, {"word": "square up", "def": "To square up means to get into a fighting position."}, {"word": "squirting", "def": "Squirting is a slang term for female ejaculation. In pornography, it usually features a voluminous, projectile stream from the vagina. Science says it's largely just urine. So, there's that."}, {"word": "stamp", "def": "In slang, stamp can refer to LSD (acid) or a bag of heroin. It can also be short for food stamps or the expression stamp of approval."}, {"word": "stan 2", "def": "Do you really, really, really like something? Then you might be a stan for it."}, {"word": "stanky leg", "def": "“Stanky Legg” was a song released by the hip-hop group GS Boyz in 2009. The music video popularized the stanky leg dance, which involves extending one leg and circling that knee, and then doing the same with the other leg."}, {"word": "starboy", "def": "Popularized by Canadian recording artist The Weeknd, a starboy is like a rockstar. The term can refer to a very famous man, the leading member of a group or team, or a male object of someone's affection."}, {"word": "stashing", "def": "Have you ever been romantically involved with someone but never met any of their friends or family or have never even been featured on their social media? If so, you might be the victim of stashing, or when a partner hides another from friends and family and from their social media."}, {"word": "stay in your lane", "def": "The phrase stay in your lane means \"to mind your own business.\""}, {"word": "steak and blowjob day", "def": "Steak and Blowjob Day is an unofficial joke holiday which falls on March 14th, precisely one month after Valentine’s Day. Conceived as a dude-centric answer to Valentine’s Day, it includes the two things men stereotypically enjoy the most: meat and their meat."}, {"word": "stealthing", "def": "Stealthing is the act of removing a condom during sex without the consent of the partner. It’s illegal in many countries, and is a form of sexual assault."}, {"word": "stick", "def": "Stick is a slang term for \"gun,\" especially an automatic rifle in Southern hip-hop in the US. That means you can \"stick 'em up\"...with a stick. We recommend only using the actual twig variety, however."}, {"word": "stupid fresh", "def": "It ain't just fresh. It's stupid fresh, or \"extremely good.\" The slang often compliments someone's fashion or style."}, {"word": "subreddit", "def": "A subreddit is a specific online community, and the posts associated with it, on the social media website Reddit. Subreddits are dedicated to a particular topic that people write about, and they're denoted by /r/, followed by the subreddit's name, e.g., /r/gaming."}, {"word": "subtweet", "def": "A subtweet is a negative post, especially on Twitter, targeting a certain person without directly mentioning them or their username."}, {"word": "succ", "def": "Succ is a slang spelling of \"suck,\" used in the contexts of fellatio. It was popularized by Crips-affiliated rappers and an internet meme, the succ, about amazing, well, blowjobs."}, {"word": "sugar daddy", "def": "A sugar daddy is an older man who basically just throws gifts, allowances, and trips on a younger woman or man in exchange for a consensual (?) sexual relationship."}, {"word": "sugar rush", "def": "A sugar rush is an experience of high energy after eating or drinking a considerable amount of sugar in a short period of time, often associated with hyperactive children."}, {"word": "suh", "def": "Suh can mean \"sir\" or the casual greeting \"What's up?\" It's also a common Korean surname."}, {"word": "sunday scaries", "def": "The Sunday scaries are the anxieties one experiences on Sunday when thinking about the impending workweek, school week, or other obligations that await in the week ahead. They are especially bad when accompanied by an end-of-the-weekend hangover."}, {"word": "supremium", "def": "In the fashion world, Supremium refers to the (usually hefty) markup in the resale market for hot-ticket, Supreme-branded items, i.e., the premium on Supreme products."}, {"word": "surrender cobra", "def": "Found at sporting events, surrender cobra is a hands-atop-head pose made by fans when the their team's loss seems all but inevitable."}, {"word": "sus", "def": "Sus is a shortening of suspicious or suspect. In slang, it has the sense of \"questionable\" or \"shady.\" "}, {"word": "swalla", "def": "Swalla is a dialectical or slang pronunciation of swallow, prominently appearing in hip-hop lyrics with respect to drinking alcohol or performing oral sex on men."}, {"word": "swamp ass", "def": "Swamp ass involves a sweaty wetness in the butt crack or general nether region that may soak through the underwear, even the pants. Chafing and funky odors are also common symptoms. Beware."}, {"word": "swang", "def": "Swang is slang for showily steering a car side to side while driving. It can also be slang for chilling out and feeling good."}, {"word": "swole", "def": "To be swole is to be very muscular, to have a nice physique, or to have really well-defined muscles. Swole, as an adjective, can refer to a specific body part or the entire body, and it is generally used in a positive way."}, {"word": "t minus", "def": "T-minus 10...9...8..."}, {"word": "tactical shit", "def": "Tactical shit is a slang reference to military equipment, usually \"tricked out\" by civilians for recreational or far-right paramilitary purposes."}, {"word": "tagged", "def": "A person is tagged when they are identified in a post on social media."}, {"word": "take lines", "def": "The phrases take lines and take a line are horses of two very different colors. Take lines can refer to using someone else’s work, usually as a form of plagiarism, while take a line can also refer to using drugs, especially cocaine."}, {"word": "tame", "def": "When an animal is tame, it has been domesticated, a sense metaphorically extended to someone or something considered \"subdued,\" \"boring,\" or \"mild.\" Tame is also a verb for so subduing someone or something, used in slang for sexually dominating a person in a desirable way."}, {"word": "tango down", "def": "Tango down is military slang announcing that an enemy has been defeated in combat. Tango down has been adopted in first-person shooter games when teams are strategizing over audio."}, {"word": "taylor gang", "def": "Yeaaahhhh! It's young Khalifa, man! The Taylor gang refers to the rapper Wiz Khalifa fans and his crew. It's also the name of Wiz Khalifa's record label, Taylor Gang Entertainment. And no, Taylor Swift has yet to be invited in."}, {"word": "tbh rate and date", "def": "Tbh, rate, and date is a social-media prompt in which someone requests friends’ opinions of them. The friends then post an honest statement, a rating, and whether they’d date them or not."}, {"word": "tea", "def": "Best served piping hot, tea is slang for \"gossip,\" a juicy scoop, or other personal information."}, {"word": "tec", "def": "TEC is short for TEC DC-9, a semiautomatic pistol associated with criminals."}, {"word": "teethpaste", "def": "Teethpaste is a humorous form of toothpaste. It typically comes up in considerations of or jokes about why tooth isn't plural in toothpaste."}, {"word": "text me", "def": "Text me is a common way to ask someone to send you a text message on their phone, often to catch up or make plans."}, {"word": "that escalated quickly", "def": "The phrase that escalated quickly is often used when a scenario goes from relatively calm or innocuous to out of hand and intense."}, {"word": "thats what she said", "def": "That’s what she said is a form of innuendo that takes innocent statements out of context and makes them sound lewd or sexual."}, {"word": "the 6", "def": "The 6 is a nickname for the city of Toronto, Canada. You can thank the rapper Drake for (trying to make) it a thing."}, {"word": "the chronic", "def": "The Chronic is a widely influential hip-hop album that was released by rapper and producer Dr. Dre in 1992."}, {"word": "the clap", "def": "The clap is a slang term for a venereal disease, typically gonorrhea."}, {"word": "the d", "def": "Do you want the D? No, we don't mean Dictionary.com, alas. The D is an affectionate nickname for the city of Detroit, Michigan. The D is also a slang euphemism for dick, or \"penis\" or \"sex\" more generally. But don't worry, Detroit: Many people want the D!"}, {"word": "the dress", "def": "The question What color is this dress? refers to a photo of a striped dress, the dress, which went viral, resulting in an active social media debate for the next few days over whether #TheDress was white and gold or blue and black."}, {"word": "the game", "def": "The Game is a psychological game that involves not thinking about the existence of The Game. When someone thinks about The Game, they lose."}, {"word": "the girl next door", "def": "The girl next door is a term used to describe a female archetype and fashion aesthetic which can range in terms of personal definition, but usually denotes a girl or woman who appeals to traditional or “all-American” gender norms with the allure of purity, simplicity, and charm, with a natural, modest, or effortless beauty."}, {"word": "the struggle is real", "def": "My WiFi is slow. I can't find matching socks. I have a 9am meeting. The struggle is real ..."}, {"word": "the wild 100s", "def": "The Wild 100s is a nickname for the South Side of Chicago, Illinois, specifically the Roseland neighborhood."}, {"word": "they see me rollin", "def": "They see me rollin is a meme used to describe unusual or humorous modes of transportation."}, {"word": "thicc", "def": "🎶 Back that azz up 🎶. Thicc is a slang term for a full-figured body, specifically a big butt and curvy waist.  It is both used sexually and humorously."}, {"word": "thick girls", "def": "The term thick girls is used for women who are considered especially attractive due to their voluptuous or curvaceous figures."}, {"word": "thigh gap", "def": "A thigh gap is a space between the inner thighs of someone who is standing with their knees straight and their feet together. It’s a so-called standard of beauty particularly applied to women’s bodies."}, {"word": "thirst trap", "def": "Set a scene, get the right angle, reveal a little thigh, and snap! A thirst trap is a sexy photo posted on social media to attract attention. It can also refer to a person considered sexy—a social-media crush."}, {"word": "this guy", "def": "Who's got two thumbs and just dropped their cell phone in the toilet? This guy. This guy is an expression used to highlight when someone has done something stupid or unbelievable. It's often used to reference oneself."}, {"word": "this is why im broke", "def": "This is why I’m broke is a phrase and internet meme used to bemoan one’s finances, especially as a facetious complaint about one’s impulse purchases online."}, {"word": "thot", "def": "Thot is a slang acronym standing for that ho over there or thirsty hoes over there, and is used as a synonym for vulgar slurs like slut, bitch, or whore."}, {"word": "throwback thursday", "def": "Throwback Thursday or TBT is a social-media trend when users, on Thursdays, post photographs or recollections of the past under the #throwbackthursday, #tbt, or #throwback hashtags."}, {"word": "throwing shade", "def": "Throwing shade is a subtle way of disrespecting or ridiculing someone verbally or nonverbally."}, {"word": "thug life", "def": "Especially in black hip-hop culture, thug life refers to a determined and resilient attitude to succeed in life in spite of racism and injustice."}, {"word": "timbs", "def": "Timbs is a nickname for Timberland brand boots, often referring specifically to the brand’s six-inch work boots."}, {"word": "tinderellla", "def": "A play on words between the classic fairy tale Cinderella and the popular mobile dating app Tinder, a Tinderella is an attractive person on Tinder, particularly one who's accidentally gotten away. This usually doesn't involve a glass slipper, but rather an accidental swipe left when using the app."}, {"word": "titty fuck", "def": "\"Breast sex\" is a polite form, we guess, of the vulgar titty fuck, which is when a woman masturbates a man between her breasts."}, {"word": "too much sauce", "def": "A person has too much sauce when they wear too many designer clothes and accessories at the same time and, by extension, when they display the (over)confidence such items might afford them."}, {"word": "toss your salad", "def": "No, we're not talking, here, about mixing together the ingredients and dressing for a nice, healthy lunch. To toss someone's salad is sexual slang for anilingus, or orally stimulating someone's anus. 🥗"}, {"word": "tosser", "def": "Tosser is a British slang expression for an obnoxious jerk."}, {"word": "totes mcgotes", "def": "Totes McGotes may sound like a cartoon character, but it's just a way to voice approval or agreement."}, {"word": "trap queen", "def": "Originating in drug slang, a trap queen is a strong, loyal woman, often used in hip-hop and black culture."}, {"word": "tribbing", "def": "Tribbing refers to a sexual practice in which women stimulate each other by rubbing their genitalia together."}, {"word": "triggered", "def": "Triggers are anything that remind someone of previous trauma. To be triggered is to have an intense emotional or physical reaction, such as a panic attack, after encountering a trigger. "}, {"word": "trill", "def": "Keep it trill, y'all. Trill is a blend of true and real, used in hip-hop slang for someone or something that is genuine and authentic."}, {"word": "trippin", "def": "You trippin' means you're acting a fool, thinking crazy thoughts, or are maybe high on mushrooms. Trippin' out is \"freaking out\" or \"being extremely high.\""}, {"word": "truffle butter", "def": "Outside of cooking and eating, truffle butter is, um, not very appetizing."}, {"word": "trumpian", "def": "Trumpian refers to the bombast, egotism, and lies, or anti-establishment, authoritarian, bigoted ideologies that some associate with the language, conduct, and viewpoints of President Donald Trump."}, {"word": "trumpism", "def": "Trumpism refers to the nontraditional political philosophy and approach espoused by US President Donald Trump and his supporters. The term Trumpism can also be used to directly refer to an outrageous or idiosyncratic statement made by Donald Trump."}, {"word": "trust the process", "def": "Trust the Process is a slogan used by fans of the NBA's Philadelphia 76ers, though it has since become popular elsewhere in sports and culture. Coined during a rough patch for the team, it basically means \"things may look bad now, but we have a plan in place to make it better.\""}, {"word": "truth be told", "def": "Truth be told is an expression used when someone reveals a fact or opinion they might otherwise hold back or lie about."}, {"word": "truther", "def": "A truther is a person who believes major events or situations are being covered by conspiracies."}, {"word": "tumblr girl", "def": "A Tumblr girl is a specific kind of young woman that actively uses the social media website Tumblr. Typically, Tumblr girls are considered attractive, are interested in fashion, post many photographs of themselves, and have a distinctive aesthetic sensibility associated with hipsterism."}, {"word": "turn down for what", "def": "At its core, turn down for what is a phrase used to promote having a good time. The phrase itself implies that there is no reason to turn down and stop partying. It seeks to feed the hype of whatever is going on."}, {"word": "turnt", "def": "Turnt means extremely excited, wild, or drunk. It can refer to a person’s state of mind, or to an atmosphere, such as at a party."}, {"word": "twat", "def": "A twat is slang for \"vagina.\" It's also used, especially in British English, to insult someone as stupid, useless, or reckless."}, {"word": "twee", "def": "Twee describes someone or something as affectedly and cloyingly cute, sweet, and quaint. It's also a subgenre of indie pop music."}, {"word": "twitterstorm", "def": "A Twitterstorm is a sudden flurry of activity about a specific topic on Twitter. It is often started by a single person."}, {"word": "u hauling", "def": "U-hauling is a sometimes derogatory slang term that refers to two women who move in together very soon after they start dating."}, {"word": "ublearns", "def": "UBlearns is the name of the virtual academic task manager for the University of Buffalo in New York state."}, {"word": "uckers", "def": "Uckers is a slang term for a woman who is particularly gifted at, or frequently performs, fellatio."}, {"word": "ugly cry", "def": "Ugly cry refers to an intense sobbing which contorts the face of the person crying in way that is often perceived as exaggerated or unpleasant."}, {"word": "unboxing", "def": "Unboxing is the act of documenting oneself, mostly on video, of opening a packaged product from a box and displaying, reviewing, and showing off its contents."}, {"word": "under construction", "def": "Under construction refers to a building, structure, or project that is unfinished but actively being worked on."}, {"word": "under siege", "def": "Under siege is a phrase meaning \"to be experiencing an attack,\" used literally or figuratively. It supplied the title of a noted 1992 action movie starring Steven Seagal."}, {"word": "underboob", "def": "It's a boob. From the bottom. Without the nipple showing. The underboob refers to the parts of breasts below the nipple, often exposed in a high-cropped top."}, {"word": "unfff", "def": "Unfff is an exclamation typically used to express sexual attraction."}, {"word": "unsult", "def": "An unsult is a backhanded compliment, i.e., an insult packaged as a compliment."}, {"word": "updoot", "def": "Updoot is a humorous internet slang for an upvote (or a \"like\"), which is a favorable rating a user gives to an online post or website."}, {"word": "vaguebooking", "def": "A blend of vague and Facebooking, vaguebooking is the practice of making a post on social media, primarily Facebook, that is intentionally vague but highly personal and emotional. Designed to elicit concerned responses from friends and family, it's often looked down upon as a desperate call for attention or need for validation."}, {"word": "vajazzle", "def": "Vajazzling refers to when a woman covers her pubic area with decorative flourishes, such as gemstones, rhinestones, or glitter."}, {"word": "vaporwave", "def": "Vaporwave is a subgenre of electronic music which features heavy sampling and editing, surreal and futuristic themes, and 1980s and 1990s imagery, musical styles, and consumer culture."}, {"word": "vaulted", "def": "Vaulted can variously refer to an arched structure, the action of leaping over something, or when you place something in a secure chamber or box. In the massive popular online game Fortnite, vaulted is used to describe any weapons or items that have been removed from the game."}, {"word": "violate", "def": "To violate is to breach some code of conduct, often in an egregious manner. It is often used to describe breaking the law or committing physical violence against another–especially rape and sexual assault. In black slang, to violate someone is personally insulting or assaulting someone."}, {"word": "vore", "def": "Vore is a fetish involving being eaten by or eating someone or something, real or imaginary."}, {"word": "vote for pedro", "def": "Vote for Pedro is a reference to a campaign slogan in the 2004 cult-classic film Napoleon Dynamite. It is often used politically or nostalgically."}, {"word": "wackadoodle", "def": "Wackadoodle describes someone or something as eccentric, wrongheaded, bizarre, or foolish, generally in an amusing way and with a mildly dismissive tone."}, {"word": "wag the dog", "def": "To wag the dog means to distract attention away from a political scandal, often through military action."}, {"word": "wagwan", "def": "Wagwan is a way to say What's going on? in Jamaican English, used throughout the Jamaican diaspora (or where Jamaican people live outside of Jamaica), especially in South London."}, {"word": "wake and bake", "def": "Wake and bake is the act of smoking (or otherwise consuming) marijuana first thing in the morning. For advocates, this is ideally done while still in bed, in PJs, and right before a really satisfying breakfast. A wake and bake with coffee added to the menu is sometimes called a hippy speedball."}, {"word": "walm", "def": "Walm is an archaic word referring to “gushing or boiling water,” now largely appearing as a common misspelling of the word warm ... and sometimes a blend of warm and calm because we need that type of word in our lives."}, {"word": "washed", "def": "Someone's who's washed (out) might be burnt out, exhausted, or, if they're a drug user, extremely high. More tragically, if they're washed (up), they might be over, i.e., canceled, passé, or not cool anymore."}, {"word": "water ice", "def": "Water ice is a frozen dessert, very similar to Italian ice, made in Philadelphia."}, {"word": "water under the bridge", "def": "Water under the bridge refers to past events, especially fights or disagreement, that are forgiven, forgotten, or otherwise no longer considered important."}, {"word": "wavy", "def": "Popularized by hip-hop artist Max B, wavy is slang for something \"cool,\" \"chill,\" or \"excellent.\""}, {"word": "weeaboo", "def": "Weeaboo is a mostly derogatory slang term for a Western person who is obsessed with Japanese culture, especially anime, often regarding it as superior to all other cultures."}, {"word": "weeb", "def": "A weeb is a derisive term for a non-Japanese person who is so obsessed with Japanese culture that they wish they were actually Japanese."}, {"word": "weird flex but okay", "def": "Weird (or odd) flex but OK is a snarky, mocking internet slang response to when someone brags about something deemed unusual, bizarre, baffling, or questionable. A boast about owning a zebra or spending $1000 at Starbucks? Weird flex but OK."}, {"word": "welp", "def": "Welp, an alternative pronunciation of well, is an interjection typically used at the beginning of a sentence to express resignation or disappointment."}, {"word": "wenis", "def": "Wenis and wagina are joke words for referring to the skin on the outside and the pit of the elbow, respectively."}, {"word": "wet", "def": "Wet means much more than just dampness. As slang, wet is most commonly used to describe when a woman's vagina gets wet from sexual arousal, although it can also refer to alcohol or getting beaten bloody."}, {"word": "what doesnt kill you makes you stronger", "def": "What doesn’t kill you, makes you stronger comes from an aphorism of the 19th century German philosopher Friedrich Nietzsche. It has been translated into English and quoted in several variations, but is generally used as an affirmation of resilience."}, {"word": "what the actual fuck", "def": "Some things are so puzzling, infuriating, unbelievable, or spectacular that a simple What? or What the fuck? just won’t cut it. "}, {"word": "whats up", "def": "What’s up is an informal greeting (“Hey, buddy, what’s up?”), idiomatic phrase, or an inquiry about a current or recent state of affairs (“You seem sad. What’s up?”)."}, {"word": "wheels up", "def": "Wheels up is a colloquial term for the takeoff of an aircraft, occasionally applied to other vehicles."}, {"word": "whippets", "def": "A slang term for the recreational use of nitrous oxide, whippets, also called laughing gas, are a staple of most Phish concerts. A canister of the gas may be called a whippet or the drug itself may be called whippets, as in \"doing whippets.\""}, {"word": "whiskey tango foxtrot", "def": "Based on letters of the military phonetic alphabet, Whiskey Tango Foxtrot is a euphemistic substitution for what the fuck or WTF."}, {"word": "white girl", "def": "White girl is just another name for young Caucasian females ... but it often stereotypes them as vapid materialists. The term white girl is also slang for cocaine."}, {"word": "whitesplain", "def": "Whitesplaining is the act of a white person explaining topics to people of color, often in an obliviously condescending manner, and especially regarding race- or injustice-related issues."}, {"word": "whos your daddy", "def": "Someone asking Who's your daddy? isn't looking for an answer: They're making a point about how great they are. It's a sign of male dominance, insinuating the listener is a mere child."}, {"word": "whoosah", "def": "Whoosah is a slang expression variously used to indicate or achieve a state of calm and relaxation."}, {"word": "why so serious", "def": "Why so serious? is a famous line from the movie The Dark Knight. Spoken by the villainous Joker, it plays on his clownish appearance and cheerful demeanor, which stays in place even while he does violent or gruesome things."}, {"word": "wiener", "def": "A wiener is a type of sausage or anything that superficially resembles one, particularly a penis or a dachshund breed of dog. "}, {"word": "windy city", "def": "Windy City is a popular nickname for Chicago, Illinois."}, {"word": "winner winner chicken dinner", "def": "Bingo! Jackpot! Winner winner chicken dinner!"}, {"word": "woe is me", "def": "Woe is me is an over-dramatic, often comical way to express sadness or disappointment at an unfair situation. The phrase carries such connotations because of its archaic-sounding grammatical structure."}, {"word": "woke", "def": "Woke means being conscious of racial discrimination in society and other forms of oppression and injustice. In mainstream use, woke can also more generally describe someone or something as being \"with it.\""}, {"word": "woo woo", "def": "Woo-woo is an insult for or describing mystical or supernatural beliefs not backed up by science, e.g., alternative medicine practices like healing crystals or cupping."}, {"word": "would you look at that", "def": "Would you look at that is a rhetorical question or interjection used to variously comment on something surprising, frustrating, puzzling, or enticing as well as something cynically expected or counter to one's expectations.  "}, {"word": "would you rather", "def": "Would you rather refers to a game where participants must choose between two challenging scenarios and explain why."}, {"word": "wypipologist", "def": "Wypipologist is a humorous slang term for someone, usually a black person, who \"studies\" wypipo, or \"white people.\" Wypipo, after all, do some crazy stuff in need of expert explanation."}, {"word": "xenomorph", "def": "A xenomorph is a type of alien from the science-fiction horror franchise Alien known for its grotesque appearance and parasitic form of reproduction."}, {"word": "xtra", "def": "Xtra is a stylized spelling of extra and means \"dramatic\" in an unnecessary or empowered way. The term is popular among young adult females and in LGBTQ communities."}, {"word": "xxx", "def": "XXX marks something as pornographic, often used as shorthand for any sexual content. "}, {"word": "xxxx", "def": "In letters and text messages, xxxx symbolizes a series of kisses, used as an affectionate sign-off or goodbye. "}, {"word": "yayo", "def": "Yayo, as in Chichi, get the yayo!, is Spanish slang for cocaine. It's also spelled llello or yeyo."}, {"word": "yee", "def": "Yee is the sound that a character from the movie Dinosaur Adventure makes. It’s also the name of a meme. The meme generally involves taking existing media and adding sound clips from two characters from the movie, named Peek and Oro. Either a whole song is replaced by manipulated versions of the sound clips, or non-altered sound clips are intermittently peppered throughout popular songs."}, {"word": "yeet", "def": "YEET! Yeet is an exclamation of excitement, approval, surprise, or all-around energy, often as issued when doing a dance move or throwing something."}, {"word": "yes maam", "def": "Yes ma'am is a polite way of affirming something an older or superior woman has said, often used to show sass or excitement in response to something more generally."}, {"word": "yesnt", "def": "Yesn’t is a negative used to express dissent or an unwillingness to do something."}, {"word": "yiff", "def": "Yiff relates to sexual content within the furry fandom. It can be furry porn (as in pornographic images or movies) or it can be sexual interaction involving furries (the fans themselves or the characters). Generally, this word isn’t taken too seriously within the fandom."}, {"word": "yinz", "def": "Yinz is a Pittsburgh equivalent to y'all. It is used to address two or more people as a second-person plural pronoun."}, {"word": "you are", "def": "\"You're smelly!\" \"No, you are.\" \"No, you are.\""}, {"word": "you mad bro", "def": "U mad? is a slang phrase used to taunt and push the buttons of someone who is already angry or upset. It can be used as a question or simple declaration. U is sometimes spelled out as you."}, {"word": "you reap what you sow", "def": "You reap what you sow is a proverb that says future consequences are inevitably shaped by present actions."}, {"word": "you rock", "def": "You rock is a slang phrase of praise or encouragement conveying \"You're awesome (at something)\" or \"You can do it!\""}, {"word": "youre doing amazing sweetie", "def": "If you ever need to let a friend know how awesome they are, tell them you're doing amazing, sweetie."}, {"word": "you 39 re killin me smalls", "def": "You're killing me, Smalls is used as a general expression of exasperation with someone or something."}, {"word": "youre so sound", "def": "You’re so sound is something you might say to someone you admire, especially in the UK and Ireland. Sound, as a slang adjective, can mean \"excellent.\""}, {"word": "your mom", "def": "Your mom is a phrase that’s typically followed by a statement poking fun at someone’s mom. This always involves hyperbolic statements revolving around a personal trait that she may or may not possess."}, {"word": "yout", "def": "Yout is a form of \"youth,\" especially associated with Jamaican Creole and Caribbean English around the world."}, {"word": "yt folx", "def": "Yt folx is internet slang for \"white folks.\" Sometimes serious but often humorous, yt folx is typically used by people of color, usually black Americanas, to call out white privilege, racism, or cultural appropriation."}, {"word": "yuge", "def": "Yuge is the pronunciation of the word huge in a New York accent. The term is closely associated with Donald Trump ... because he says it a lot."}, {"word": "yut", "def": "Yut is an exclamation expressing excitement and camaraderie among US Marines."}, {"word": "z shit", "def": "The expression Z shit comes from the 2018 song \"ZEZE\" by Kodak Black. It's used to refer to his gangster, Haitian Creole lifestyle."}, {"word": "zerg rush", "def": "Zerg rush is an attack strategy that involves overwhelming an opponent with large numbers or ganging up on someone."}, {"word": "zero fucks", "def": "Nada. That's how many fucks the expression zero fucks gives."}, {"word": "zomg", "def": "ZOMG, I just won the lottery! When your everyday OMG just isn't enough, kick it up a notch with zomg or ZOMG. No one is too sure what the Z means ... read on."}]}