{"definition": [{"jive turkey": "Jesus take the wheel is a request for divine intervention. It is sometimes used seriously, and sometimes used humorously."}, {"joe sixpack": "A jive turkey is someone who is unreliable, makes exaggerations or empty promises, or who is otherwise dishonest. The phrase is so associated with 1970s culture."}, {"jonesing": "A Joe Sixpack is an average, working-class American male. He is often characterized—sometimes positively, sometimes negatively—as a guy who isn't very highly educated, who likes sports, and who enjoys putting back a couple of beers."}, {"juggalo": "If a person has an insatiable craving for someone or something, they are said to be jonesing for it."}, {"juice": "A Juggalo is a fan of the Detroit-based rap duo Insane Clown Posse (ICP) or the other groups on their Psychopathic Records label. Female Juggalos are sometimes called Juggalettes."}, {"jump out boys": "Do you got the juice? One has juice if they have respect, influence, power, authority, or sexual desirability. It can also be slang for alcohol and electric power, among other things."}, {"kavanaseous": "Sometimes carrying a derogatory tone, jump out boys is slang for \"the police\" or \"law enforcement officers.\""}, {"keep calm and carry on": "Kaya is a slang word for marijuana closely associated with Bob Marley."}, {"keep it 100": "Commonly featured on posters, clothing, novelty items, and internet memes, keep calm and carry on is a popular slogan calling for persistence in the face of challenge. It was first used on a British propaganda poster during World War II but now enjoys general currency as an expression of resilience."}, {"kek": "Keep it 100 is a slang phrase that means being authentic and truthful, akin to \"keeping it real.\""}, {"kiki": "Kek is an online term with similar meanings to LOL or haha, used especially by gamers. Since the 2016 US presidential election, the Egyptian god Kek, portrayed as Pepe the Frog, has become a symbol of the so-called “alt-right.”"}, {"kino": "A kiki is a social gathering, usually for the purpose of casually “kicking back,” gossiping, and sharing stories. It is historically connected to LGBTQ communities."}, {"kissanime and chill": "Kino variously refers to a category of art-house cinema on internet message boards, an experimental film movement, or a term for intimate touch among certain men trying to seduce women."}, {"kite": "Want to Netflix and chill but watch anime instead and, you know, do other stuff? No, we're not asking you. We're just explaining what it means to KissAnime and chill."}, {"kumbaya": "These aren’t the kites they sing about at the end of Mary Poppins. In US prison slang, a kite is a message or note, historically contraband notes passed between prisoners or smuggled out of prison."}, {"lalaland": "Rooted in an American spiritual and folk song of the same name, kumbaya refers, often disparagingly, to moments of or efforts at harmony and unity."}, {"laldy": "Lalaland is a colloquial term for \"being out of touch with reality,\" usually due to bliss or ignorance."}, {"lamo": "In Scottish slang, a laldy is a \"beating\" or \"thrashing.\" The expression to give it laldy means doing something with lots of energy and vigor, e.g., with gusto."}, {"larry stylinson": "Don't be a lamo! Lamo is an occasional spelling of the insult lame-o, or \"pathetic (person or thing).\" It can also be used as an ironic take on the acronym LMAO (laughing my ass off)."}, {"laying pipe": "Larry Stylinson is the nickname given to the pairing of One Direction members Louis Tomlinson and Harry Styles, who some fans believe have a secret relationship."}, {"lean": "The expression laying pipe is a very visual euphemism for using one's penis to \"have vigorous sex with\" another. Tl;dr: Pipe is slang for \"penis.\""}, {"left on read": "Lean is a slang term for prescription cough syrup infused with codeine and promethazine. It’s popularly known in hip-hop culture by several nicknames including “purple drank” or “sizzurp.”"}, {"lets go": "In internet slang, a person is left on read when a recipient has read, but not responded to, a sender's message. The expression is often used to express feeling ignored."}, {"lil": "Let's go is an expression variously and widely used to take leave, show excitement, cheer, express impatience, or challenge someone."}, {"libtard": "Li’l is an abbreviation of the word little. It’s often used in names or titles to emphasize youth or physical size."}, {"like a boss": "Libtard is an insult usually used by conservative trolls online to characterize liberals as stupid."}, {"lmgtfy": "To do something like a boss is to do it with stylish confidence or authority. This can be applied, tongue in cheek, even to fairly mundane tasks."}, {"lurking": "Lmgtfy is an internet acronym standing for let me Google that for you, used when someone requests information that they could have easily found themselves."}, {"mac 10": "Lurking is lying hidden or moving about secretly, as if to ambush someone. In internet culture, it specifically refers to browsing social media sites or forums without engaging with other users."}, {"mad dog": "MAC-10 is the nickname for a submachine gun, officially designated the M10, and originally manufactured by the Military Armament Corporation."}, {"mafa": "Mad dog is slang term used to describe someone as \"wild and crazy.\" It is often used as a nickname or to describe a kind of mean stare. "}, {"make it rain": "We have had it with these mafa snakes on this mafa plane! Like mofo and muhfuh, mafa is a shortening of the slang, motherfucker."}, {"mancelled": "To make it rain is to freely give out cash or other items, make a lot of money, or become a big success."}, {"mandela effect": "Before the #MeToo movement took off in 2017, mancelled was sometimes used to refer to dudes being flakey and cancelling their plans. In the post-#MeToo era, problematic or offensive men can expect to get mancelled, a blend of man and cancelled, i.e., shunned."}, {"mangina": "The Mandela Effect refers to when a large number of people share a false memory, originally attributed to the existence of multiple universes."}, {"mannequin challenge": "Mangina is a derogatory term for any man perceived as effeminate, especially used online to put down men who identify as feminists. It can also insult the genitals of persons of all gender identities."}, {"manojob": "The mannequin challenge refers to a viral video trend in which a group of people are filmed frozen in position like mannequins."}, {"manosphere": "A manojob is the name of a pornography website and a slang coinage for the sexual act of a hand job."}, {"mansplain": "Are you a meninist? Advocate of men’s rights? Just plain hate womankind? Then the manosphere might be the place for you! As for the rest of the population, y'all probably wanna steer clear …"}, {"mayo": "To mansplain is for a man to explain something to a woman in a condescending manner, particularly when the woman is an expert in the subject."}, {"mean the world": "Typically, mayo is short for mayonnaise, a classic condiment made of oil, vinegar, and egg yolks. When not, it can also be a slur against white people or a slang term for drugs."}, {"mean mugging": "To mean the world to someone is an idiomatic way of saying they are exceptionally valued and important, often used for love."}, {"meninist": "Have you ever seen someone look at you a little funny, or give you a dirty look? That's mean-mugging, or the act of glowering at someone with an intimidating, irritated, or judgmental facial expression."}, {"merkin": "A meninist is someone who—wait for it—believes men are victimized by feminism and that attention needs to be called to what they believe are the struggles of being a man in the 21st century."}, {"middle finger": "A merkin is a pubic wig. It is placed over the genitals to simulate pubic hair and to keep the private body parts from full exposure."}, {"mile high club": "Middle finger means fuck you. The end."}, {"milkshake": "The mile high club is a slang term for people who’ve had sex during a flight. Mile high alludes to the high altitude of air travel and club refers to the act’s rarity and exclusivity."}, {"milkshake duck": "From a 2003 pop song of the same name, milkshake is a slang term for an attribute that makes a woman stand out."}, {"millennials": "A Milkshake Duck is a person (or thing) who becomes extremely popular on the internet for some positive reason, but as their popularity takes off and people dig into their past, they quickly become an object of outrage and hatred."}, {"mind blown": "The millennial years range from the early 1980s to the early 2000s. Millennials are people that were born at any time during this period."}, {"mist": "Mind blown is used as an exclamatory response to surprising or interesting facts or enlightening information."}, {"mlem": "A mist is, literally speaking, a cloud of fine liquid droplets, but in slang it can variously refer to drugs and the experience of being on them. Mist can also be an alternative spelling or misspelling of missed."}, {"mmk": "Is that peanut butter on my nose? Mlem!"}, {"moar": "Mmk is a casual, half-humming way to say OK. It is a versatile sound, used to express mild disproval and suspicion ... or warm affirmation. Be careful, though, as mmk can come across as a little patronizing or rude."}, {"molly percocet": "Moar is an intentional misspelling of more, used online as a humorous demand."}, {"molon labe": "Molly Percocet isn't the name of that girl next door. Nope, it's the name of two drugs, molly (MDMA) and Percocet (oxycodone), often taken together recreationally and referenced in rap artist's Future's hit 2017 song, \"Mask Off.\""}, {"mondaze": "From the Greek for “come and take them,” molon labe is a slogan used to express defiance, and is frequently employed by gun-rights advocates in the US."}, {"mongo": "Mondaze is a blend of Monday and daze, a humorous term for the stupor some find themselves in at the start of the work week."}, {"moon crickets": "Mongo can be a slang term for \"huge\" or \"extremely.\""}, {"moon rocks": "Though it may sound fanciful and innocent, this term is absolutely not. "}, {"moonbat": "Yes, moon rocks can refer to rocks from the actual moon, but nobody is smoking those (as far as we know)."}, {"moose knuckle": "A moonbat sounds more like some something from a science-fiction novel than a political insult for people with left-leaning political views. In fact, that's exactly where the term comes from ..."}, {"more cowbell": "Moose knuckle is a slang term for when the outline of man’s genitalia are visible through particularly tight or hiked-up clothing."}, {"mormon underwear": "More cowbell is a pop-culture catchphrase that stems from a comedy sketch about 1970s rock music. The sketch centers around a character who seems to believe that the cowbell, a simple percussion instrument, is the secret ingredient to make a song work. More cowbell can stand in for anything that a person is longing for or feels is lacking. The phrase may also be used as a simple shout-out to other fans of the sketch."}, {"morning skinny": "Mormon underwear refers to a conservative type of underwear, considered sacred, worn at all times by members of the Church of Jesus Christ of Latter-day Saints (LDS), or the Mormon Church."}, {"morning wood": "Let's face it: Getting out of bed in the morning is the worst. But if you're body-conscious, there might be one perk: morning skinny."}, {"mud shark": "Morning wood is a slang term for an erection experienced first thing in the morning."}, {"muff cabbage": "Warning: This article features information about a racial slur that is highly offensive and that should not be used ... ever."}, {"mufo": "Muff cabbage is a vulgar, vagina-based insult popularized by a 2010 South Park episode."}, {"muh": "Mufo is short for mutual follower, referring to someone you follow on social media who follows you back."}, {"mula": "Muh is a pronunciation of the pronoun my found in some dialects of English. Online, it can be used to portray someone as ignorant or just to sound cute and silly."}, {"murica": "Mula is a common and widespread slang term for money, used much like other monetary slang items such as dough or bones."}, {"murphys law": "If your a beer-swillin', gun-totin', freedom-lovin', flag-wavin', red-blooded person from the U S of A, you might say you live in Murica."}, {"n2o": "Murphy's Law is the idea that if something can go wrong, it will. Because ¯_(ツ)_/¯."}, {"nailed it": "N2O, NOS, and nitrous are all used as shorthand by car and racing enthusiasts for the gas nitrous oxide."}, {"naked otter": "Nailed it is an expression used to comment on the successful, skillful, or clever completion or performance of something. It’s often used sarcastically in reference to efforts that comically failed."}, {"nappy hair": "Outside occasional literal references to hairless or shaved otters, a naked otter is a slang term for nude pictures of a slim, hairy gay man."}, {"nasty girl": "Nappy hair is historically used as a derogatory term to describe the hair of black people, especially women, many of whom have re-appropriated the term."}, {"national send a nude day": "A nasty girl variously refers to an ill-tempered, sexually adventurous, or self-empowered young woman."}, {"nawf": "National Send a Nude Day is a joke hashtag and holiday dedicated to sending nude photographs. The ambiguity of the intended recipients of the photos and the broader public reaction to it helped transform it into a trend on social media."}, {"nd": "Nawf is a dialectical pronunciation and spelling of \"north,\" commonly associated with Black English. The popular rap group Migos to refer to north Atlanta, Georgia as the Nawf."}, {"neckbeard": "Nd is a typo or short form of and, common in digital communication. "}, {"negging": "A neckbeard is an informal term for facial hair on the neck, usually ungroomed, and sometimes accompanied by little or no hair on the rest of the face. It is often used to stereotype nerds or geeks."}, {"netflix and chill": "Negging is the practice of giving backhanded compliments and generally making comments that express indifference toward another person (usually a woman) in an attempt to seduce that person."}, {"nice guy": "Netflix is the popular TV- and movie-streaming service. Chill is a verb that, in this context, means relaxing. Netflix and chill, as a distinct phrase, means to watch Netflix with a romantic prospect, with the eventual expectation of sexual activity."}, {"nickel": "He's a nice guy, but ..."}, {"nifoc": "Nickel is a slang term for \"five\" of anything, most commonly a five-dollar or small bag of drugs ... but it could also be a five-year prison sentence."}, {"no cap": "Enjoyed by nudists and masturbators alike, NIFOC stands for naked (or nude) in front of computer. It is often used humorously and facetiously online, but you can never be too sure when it comes to the internet."}, {"no mames": "The expression no cap is slang meaning \"no lie\" or \"for real,\" often used to emphasize someone is not exaggerating about something hard to believe."}, {"no new friends": "No mames is crude Spanish slang used to express disbelief (both positive and negative) or excitement. Used especially among Mexican Spanish speakers, the exclamation corresponds to “No way!”, “You’re kidding me!”, or “Stop messing with me!”. For instance, a statement of “I won the lottery” might be followed by “no mames.”"}, {"no shave november": "No new friends is a motto coined by the hip-hop artist Drake, taken from the song of the same name. It describes the stance that someone is going to stick with the friends they already have. They don’t need #NoNewFriends."}, {"noice": "No-Shave November refers to an annual charity event where men don’t shave, groom, or cut their facial hair for the entire month of November as a way of raising awareness and money to fight cancer."}, {"noob": "Noice, or nice pronounced with an exaggerated Australian accent, is a synonym for awesome. This spelling is helpful for internet users to convey the pronunciation in text."}, {"nootropics": "Get wrekt, n00b! In internet slang, noobs are hapless, unskilled beginners who don't know what they are doing. As far as gamers are concerned, a noob is a nothing more than an easy kill—or a real nuisance as a teammate."}, {"og": "Nootropics, also known as smart drugs, are drugs or other supplements used by cognitively healthy individuals in an effort to increase their cognitive functioning."}, {"oh my": "OG is a slang term for someone who's incredibly exceptional, authentic, or \"old-school.\" It can be earnestly used for a legend like Michael Jordan or more ironically, like for that friend who can unwrap a Starburst with their mouth."}, {"oh my god": "How many meanings and uses you have, oh my. This common interjection variously expresses surprise, concern, and admiration. It's sometimes used for quaint or humorous effect."}, {"oh my lord": "Oh my god is an exclamation variously expressing disbelief, frustration, excitement, or anger. Its abbreviation, OMG, is widely used in digital communication."}, {"oh": "Oh my lord is an exclamation variously and widely used to express surprise or frustration. It's commonly abbreviated as OML online."}, {"old king clancy": "Oh. is a reaction showing various feelings such as annoyance, sadness, surprise, or disappointment, especially in text messages or social media posts. Oh.'s tone can range from sincere to sarcastic. It's also used in the construction Oh. My. God., an emphatic text form of oh my god."}, {"omega wolf": "You say you have a Canadian girlfriend? Oh yeah? Did she give you an Old King Clancy? "}, {"on fleek": "An omega wolf or male can refer to an independent man who succeeds outside of social hierarchies. It can also refer to a weak, unsuccessful “loser.”"}, {"on point": "'Bout to crunk. Eyebrows on fleek. Dafuq."}, {"on smash": "On point is \"exactly right\" or \"perfect.\" In slang, the expression often describes someone as \"on their game\" or \"looking sharp.\""}, {"on the clock": "The expression on smash means to have something under your control, like you're completely in charge of it or \"owning\" it. When the club is on smash, everyone is having a great time partying."}, {"on the house": "Working hard or hardly working? If you're on the clock, it should be the former."}, {"one step ahead": "On the house is an idiom meaning \"free of charge.\""}, {"oogle": "One step ahead is an expression used to describe someone who or something that is more prepared, advanced, or skilled."}, {"op": "An oogle is a panhandler who lives on the streets, most frequently a new or unserious one who is perceived as homeless by choice, rather than by necessity."}, {"open relationship": "On internet forums and message boards, OP is short for original poster, or the person who started the thread that users comment on. "}, {"oppai": "An open relationship is one where an established couple has mutually agreed to share a non-monogamous lifestyle. This includes either or both parties having other sexual and/or romantic partners. This type of relationship is carried out with the consent and knowledge of all parties involved. Otherwise, it is considered infidelity."}, {"or nah": "From the Japanese word for “breasts,” oppai refers to a female character’s oversized “tits” in manga and anime."}, {"otaku": "Or nah, or “or not,” is a colloquial expression used to form to yes-or-no questions."}, {"oxycotton": "Borrowed from Japanese, otaku refers to a person who is obsessed with manga, anime, and other forms of Japanese or East Asian popular culture."}, {"pack of squares": "Oxycotton is a slang way to refer to the drug oxycodone, a pain-reliever known for its addictive qualities and abuse."}, {"papi": "A pack of squares is slang for a \"pack of cigarettes.\""}, {"papi chulo": "Borrowed by English, papi is a Spanish colloquialism for “daddy,” extended as a general term of endearment like “buddy” for a friend or “my man” for a romantic partner."}, {"party hats": "In Latin-American Spanish slang, a papi chulo is an attractive man. While the term originally names a pimp, it has broadened to refer to a ladies’ man."}, {"passive aggressive": "A party hat is a pointed and colorfully decorated cardboard hat, worn over someone's head and usually at birthday parties. It's also slang for a condom."}, {"pay to play": "Passive aggressive behavior is a way to express feelings of anger or annoyance, but in a non-forthcoming way. Instead of communicating openly, people who engage in this type of behavior share their negative feelings through actions."}, {"peace of mind": "Pay-to-play refers situations where one must exchange money to engage in an activity or to earn favors or influence."}, {"pegan": "Peace of mind is a mental state of calmness or tranquility, a freedom from worry and anxiety."}, {"pegging": "Pegan is a combination of the paleo and vegan diets, featuring a lot of vegetables, a moderate amount of lean proteins and healthy fats, and few sugars, starches, and processed foods."}, {"phan": "Pegging is a sex act where a woman performs anal sex on a man with a strap-on dildo. "}, {"phat ass": "Phan can variously refer to the ship name of popular British YouTubers Dan Howell and Phil Lester, a superfan of the band Phish, and a ceremonial tray used in Southeast Asian Buddhism."}, {"pick and roll": "🎶 You other brothers can't deny 🎶. A phat ass is a big booty, a woman's butt that is appealingly rotund—juicy or thicc, as it were. The adjective phat-ass can refer to anything attractively thick or big, like a steak or marijuana joints, or just otherwise excellent."}, {"pickup line": "A pick and roll is an offensive play in basketball where a teammate screens off a defender and then breaks free so the ball-carrier can pass it to them."}, {"pics": "A pickup line is a planned effort (which usually doesn't work) to start a conversation with a stranger in romantic or sexual pursuit of them."}, {"picture perfect": "Pics is an informal shortening of \"pictures,\" usually used in reference to sharing images online or through text messages."}, {"pie": "Something described as picture perfect is considered flawless or ideal in appearance or character."}, {"pillow princess": "To most of us, pie conjures up an image of a pastry with fruit filling, yum ... but to drug dealers (or users) pie refers to a kilogram of drugs, usually cocaine."}, {"pillow talk": "A pillow princess is a slang phrase that describes someone, mostly an LGBTQ woman, who prefers to receive sexual stimulation more than they do to give it."}, {"pingers": "🎶 I love to hold you close, tonight and always / I love to wake up next to you 🎶 Ah, how the melodious lyrics of Zayn Malik perfectly capture the post-coital cuddling and honest, affectionate conversation, called pillow talk. "}, {"pink clouding": "Pingers are tablets of the illegal drug MDMA, commonly known as ecstasy. The term is associated with Australian slang."}, {"pink sock": "Pink clouding, or Pink Cloud Syndrome, is a phenomenon many recovering addicts experience when they first go into recovery. When pink clouding, they feel a sense of euphoria that's then followed by a crash once reality sets in."}, {"piru": "Isn't it fun to look up a seemingly innocent term only to find something weird instead? Well, we've got you covered: Pink sock is a slang term for rectal prolapse. That's when parts of your rectum protrudes ... which some interpret as one's intestines spilling out ... which they think happens after anal sex. 🙃"}, {"pity party": "Among other places, Piru is a street in Compton, California where the Piru Street Boys and Westside Piru gangs originated. The gangs have made Piru a backronym for Pimps (or People) in Red Uniforms, a reference to members of the Bloods, who Piru gangs are allied with. "}, {"plata o plomo": "A pity party is an instance of feeling self-indulgently sorry for yourself."}, {"play by play": "Plata o plomo is a Colombian Spanish slang phrase that translates to “silver or lead.” A person saying the phrase is telling the listener to either accept a bribe (plata, meaning “silver,” a common slang term for money in Colombia) or lose their life (plomo, a metonym for “lead bullet”)."}, {"plead the fifth": "A play-by-play is a running commentary on or detailed summary of an event, used especially in sports."}, {"pleb": "To plead the fifth means to refuse to answer a question, especially in a criminal trial, on the grounds that you might incriminate yourself."}, {"plenty of fish": "A pleb, short for plebeian, is a person who is considered too ordinary and or a thing deemed commonplace, e.g., basic and normie."}, {"plox": "There's plenty of fish (in the sea) means a single person still has lots of options out there for future partners. It's often said in consolation after a breakup—not that it always helps. The saying is the basis of the name of an online dating website, Plenty of Fish, often abbreviated as POF."}, {"plug": "Want a definition? Say plox!"}, {"plugged in": "A plug (or the plug) is a person who has the ability to get or supply hard-to-find items, especially drugs."}, {"plumbers crack": "Get with it! If you're plugged in, you're in the know. You can also be so plugged in to a task, usually a technological one, to the point where you shut everything else out."}, {"poes law": "A plumber's crack is the top of a person's buttocks as seen when they bend over and their pants slide down."}, {"pop the cherry": "Poe’s Law is a popular adage that says satirical expressions of extremism online are hard to distinguish from genuine ones without indicating intent."}, {"poppin": "We suppose you could technically pop a cherry by squashing the stone fruit, but the slang expression pop the cherry means to \"lose one's virginity\" or \"do something one has never done before.\""}, {"porn name": "When used as an adjective, poppin’ is a synonym for awesome, popular, or fresh, especially prominent in US black slang."}, {"pornstache": "Porn name can refer to an alternate identity for stars of pornographic movies, similar to a stage name or pseudonym. More recently, porn name has been used in reference to a somewhat humorous moniker used for private sexting or porn-related activity online."}, {"poseur": "A pornstache is a mustache that makes the wearer look sleazy, predatory, or cheaply groomed."}, {"posh": "A poseur, commonly spelled poser, is when you act like someone you're not or when you're perceived to be inauthentic. So-called emo scene kids might be called poseurs."}, {"power couple": "The adjective posh means that something or someone is rich, fancy, or otherwise smells of that sweet, sweet money."}, {"praise the sun": "A power couple is a romantic or married couple where both members are famous or accomplished in their own right, sometimes extended to happy and productive everyday couples."}, {"prep": "Featured in the video game Dark Souls, Praise the Sun is an expression of relief, delight, or gratitude, often used humorously and accompanied with uplifted arms."}, {"problem child": "Preps are people who live a preppy lifestyle, a subculture that grew out of the elite preparatory boarding schools located in the Northeastern region of the United States and attended by young, wealthy, white people, typically male. Benefits include summers on the Cape, job opportunities through your well-connected dad, and wardrobes full of pink shorts and boat shoes."}, {"problematic fave": "A problem child is a child who is considered difficult ... you were probably one, right?"}, {"psychonaut": "A problematic fave is a character or person who’s done or said offensive (i.e. problematic) things. Your fave is problematic is a phrase that usually accompanies a cited list of these offensive things. The term is used exclusively in discussions about fandom, celebrities, and media."}, {"puke": "A psychonaut is someone who explores altered states of consciousness, especially through hallucinatory drugs."}, {"pump": "Don't lose your lunch, but puke is an informal way to say vomit."}, {"puppet master": "Among many other slang senses, pump is short for pump-action shotgun, a type of shotgun that requires the user to change the shell with a pumping-like action."}, {"pussy": "A puppet master is a person or group that secretly controls other people or things, as if they were puppets."}, {"pussy whipped": "Fair warning ... when you talk about a pussy you end up talking a lot about Donald Trump. Pussy is a pet name for a domestic cat, vulgar slang for the vagina, and a term of abuse for a coward."}, {"putlocker and chill": "This pussy wears the pants in this relationship. Pussy whipped is an insult for a man who is seen as being controlled by his stronger-willed female romantic partner."}, {"qq": "The slang Putlocker and chill refers to relaxing at home by streaming movies or TV from an illegal site."}, {"quid pro quo": "Qq is an emoticon that represents \"crying.\" In the gaming community, it is used as a taunt against players seen as unskilled or weak. Elsewhere online, qq variously denotes sadness, loss, or \"crying.\""}, {"quirkyalone": "Tit for tat. You scratch my back, I'll scratch yours. Or, if you want to get a little fancier, quid pro quo."}, {"quits": "Table for one, please. A quirkyalone is a person who prefers being single to being in relationship with someone just to be in one."}, {"rabbit hole": "Stick a fork in it, it’s done! If someone quits, they abruptly give up on something, especially leaving a job, relationship, or game."}, {"radass": "Used especially in the phrase going down the rabbit hole or falling down the rabbit hole, a rabbit hole is a metaphor for something that transports someone into a wonderfully (or troublingly) surreal state or situation. On the internet, a rabbit hole frequently refers to an extremely engrossing and time-consuming topic."}, {"rafiki": "Radass is a slang term meaning \"awesome.\""}, {"rainbow baby": "To Rafiki someone is to smear a substance on their forehead, which can be sexual in nature, or to lift up someone or something for honorary public presentation. Both meanings stem from the cartoon mandrill Rafiki from Disney’s The Lion King."}, {"rat rod": "A rainbow baby is a baby that is born after a miscarriage, stillbirth, or loss of an infant."}, {"ratchet": "A rat rod is a custom car with a deliberately worn-down, unfinished appearance, typically lacking paint, showing rust, and made from cheap or cast-off parts."}, {"realest": "Ratchet is a slang term variously insulting a person, usually a black woman, as whorish, low-class, and trashy."}, {"red pill": "Realest is the superlative form of real, used in slang for someone or something \"extremely authentic\" or \"exceptional.\""}, {"reindeer games": "Red pill refers to the truth behind a situation, especially a truth that is difficult to accept."}, {"rekt": "Reindeer games is a colloquial expression generally used for the bullying activities of a clique or for festivities around the Christmas season."}, {"renig": "Rekt means “wrecked or destroyed.” It is often used to refer to someone who is losing—badly—in a game or contest, but it can also be used to refer to someone who is in an extreme state of drunkenness."}, {"reply girls": "Renig is a common misspelling of renege, variously used for \"backing out on an agreement\" and often mistaken as a racial epithet."}, {"reverse cowgirl": "In the early 2010s, reply girls were a type of female YouTube user who, by exploiting the video platforms's algorithm and using sexually suggestive thumbnails for videos, earned enough views on their channels to monetize their content."}, {"rickrolling": "Giddy up! Reverse cowgirl is a sex position in which a woman straddles a male partner while facing away from him."}, {"rico suave": "Rickrolling is when you troll someone on the internet by linking to the music video for Rick Astley’s 1987 hit song “Never Gonna Give You Up.” It is, by far, the most popular example of bait-and-switch linking."}, {"riddle me this": "Rico Suave is a generic name and stereotype for a smooth, flashy Latino lover."}, {"ride or die": "Riddle me this is a stock phrase used to introduce a riddle, joke, observation, or question."}, {"ride the snake": "Ride or die is a colloquial expression of extreme loyalty to someone or something."}, {"riding shotty": "To ride the snake is to use powerful drugs or have a hallucinatory experience on them."}, {"rigged": "The expression riding shotty is another way of saying riding shotgun, or sitting in the passenger seat in a car up front next to the driver."}, {"roasties": "When something is rigged, it has been fraudulently manipulated by someone to get their desired outcome, e.g., the game was rigged in favor of the home team."}, {"rod": "Nope. We're not talking about potatoes. We're talking about immature dudes and coarse slang for the vulva."}, {"roger that": "A stick, a handgun, a car, and an erect penis all walk into a bar..."}, {"rolling in the deep": "Roger that is a phrase used to affirm or acknowledge a statement or question."}, {"rubber band": "Rolling in the deep is both a lyric and song by Adele. It suggests emotional closeness and dependence, especially in a romantic relationship."}, {"rule 34": "The handy, dandy rubber band, useful for flinging at people and holding together important things, like stacks of cash money, as rubber bands refer to in hip-hop slang."}, {"rule 63": "Rule 34 means “If it exists, there is porn of it. No exceptions.” This is an imaginary law that states that if there’s any conceivable idea that could be turned into pornography, then that type porn already exists. This refers specifically to the immense ubiquity of porn materials across the internet, which cover a wide range of subjects that are considered socially unacceptable or just plain bizarre."}, {"rules of the internet": "Rule 63, one of the self-styled rules of internet, declares: For every fictional character, there exists a gender-swapped counterpart of that character."}, {"running man challenge": "Rules of the internet refers to a humorous list of unofficial rules guiding online conduct or listing axioms about what the internet is and how users should behave on it."}, {"sadcited": "The Running Man is a viral dance trend involving a distinctive dance to the song \"My Boo\" by Ghost Town DJ's."}, {"salty": "Sadcited describes the feeling of being sad and excited at the same time, especially at the transition from an ending to a beginning."}, {"sapiophile": "Salty is a slang synonym for “bitter” or “irritated.” In this sense, salty is commonly paired with the vulgar word bitch in order to mock a sore loser, as in the phrase, “Don’t be a salty bitch.”"}, {"savage af": "A sapiophile is someone who is attracted to intelligence or intelligent people. This attraction can be romantic and/or sexual."}, {"savvy": "On the internet, savage AF is a slang way to characterize something as extremely good, brutally honest, or as a ruthless takedown."}, {"scary stories to tell in the dark": "It's pillagin' time, savvy?"}, {"scene kid": "Scary Stories to Tell in the Dark is a series of three books released in the 1980s and 1990s written by Alvin Schwartz and originally illustrated by Stephen Gammell. Though they were written and distributed as children’s books, because of their graphic descriptions and illustrations of violence, Scary Stories to Tell in the Dark has been the subject of controversy with parents and school systems for decades."}, {"schwifty": "A scene kid is a young person who either took part in the scene subculture or who imitates such a style."}, {"scissoring": "Time to get schwifty in here! Schwifty is a made-up term from the animated show Rick and Morty in 2015. It means completely letting loose while partying."}, {"screw the pooch": "Lesbian scissoring is when two women stimulate each other by interlocking their legs and pressing their genitalia together. A great core workout ... or a way to get kicked in the head during sex."}, {"scrub": "We recommend not being too literal with this one. To screw the pooch is to make a big or humiliating mistake. If you somehow screwed an actual pooch (dog), dear friend, then you seriously screwed the pooch somewhere along the way."}, {"scumbro": "No scrubs allowed around here. Scrub is slang for someone who is just plain bad at something—a no-talent hack. This could be in sports, video games, or thanks to TLC's hit song, relationships."}, {"seacresting": "This one's pretty self-explanatory. Scumbro is the name of a men's fashion style and the men who dress in it. Scumbro style involves wearing expensive, designer clothing sloppily or cultivating an unfashionable, poorly put together look."}, {"see you next tuesday": "Seacresting is behaving like American Idol host Ryan Seacrest, especially building suspense, like how he would announce a commercial break right at a climactic moment ... typical Seacrest."}, {"selfiecide": "See you next Tuesday is a euphemism for the derogatory slang word cunt."}, {"send it": "Selfiecide is the act of accidentally dying while trying to snap that perfect selfie."}, {"send nudes": "Send it or I’m still gonna send it is a popular phrase from a viral video on social media. It’s used humorously when performing audacious or dangerous stunts."}, {"sense of humor": "Send nudes is a request, usually from a man, for naked pictures, usually of a woman and often on social media, internet dating services, or private text messages. These passionate pleas usually don't result in actual nudes, but they have become the source of a lot of internet humor."}, {"seppo": "A sense of humor refers to the ability to find things funny, general enjoyment in doing so, or the particular types of things one finds funny."}, {"sexit": "Seppo is a mildly derogatory Australian slang term for an American, shortened from septic tank."}, {"shag": "Leaving right after—or to have—sex? This sex-related departure can be called a sexit. Sexit can also be used as a riff on Brexit, describing a given country's hypothetical departure from a larger political body. Sometimes the term is used in political earnestness, but just as often it's used to humorous effect. Because sex."}, {"shart": "Shag means \"to have sex\" with someone in British slang."}, {"shill": "Sometimes, when you're going to breaking some wind ... a little poop sneaks out along with it. This is called a shart, a blend of shit and fart."}, {"shipping": "This definition is the greatest definition of all time! A shill is a person who praises or promotes something because they secretly have a personal stake in it."}, {"shit just got real": "Shipping is the act of wanting two or more fictional characters or celebrities to end up in a relationship, usually romantic."}, {"shitlord": "If you've ever been in a place so dirty you feel like you need to take a piping hot shower and scrub down with a wire brush, you've encountered a shithole."}, {"shitshow": "Shitlord is slang for an internet troll who posts shocking and often bigoted content for the purpose of provoking a reaction, especially from left-leaning social justice advocates. Some shitlords ironically embrace the term."}, {"shiv": "A shitshow is a description of an event or situation that takes an unexpected turn and is thrown into chaos. It’s another word for a spectacle or a complete mess. Shitshow can also be used to describe a person."}, {"shmegma": "A shiv is a knife, especially a switchblade. It is most often used to refer to improvised blades made in prison and the act of stabbing inmates with them."}, {"shook": "Shmegma is a variant of smegma, a white, cottage cheese-like substance that accumulates beneath the foreskin of an uncircumcised penis."}, {"shoop": "Shook is the past tense form of shake, used as a slang term to describe feelings ranging from discombobulation and fear to rage and elation, kind of like \"all shaken up.\""}, {"shroov": "Shoop variously refers to a doo-wop nonsense sound sometimes used as mild slang for having sex, internet slang for work in Photoshop, or a humorous singular form of the word sheep."}, {"shut up": "Suggesting feelings of jealousy and revenge, shroov is an internet meme that is used jokingly by fans of Indian actor Karan."}, {"sicko": "If you would just shut up already we'll tell you what shut up means!"}, {"side boob": "Sicko is a slang word for someone considered deranged, sadistic, perverted, disturbed, or the like. Someone who sends unsolicited dick pics, for instance, is a textbook sicko."}, {"side eye": "It's a boob. From the side. Without the nipple showing. It's the side boob."}, {"side hustle": "A side eye is a facial expression meant to convey doubt, shock, scorn, or criticism of the person it’s aimed at. It’s made by looking at someone indirectly, out of the corners of the eyes."}, {"sigh": "A side hustle is a means of making money alongside one's main form of employment or income."}, {"single white female": "A silver fox is an older man, generally with gray or graying hair, who is considered attractive, charming, and classy."}, {"siren song": "Single white female is a phrase used to identify a woman so described in dating contexts."}, {"sitrep": "Siren song describes something that is very appealing and alluring on the surface but ultimately deceptive, dangerous, or destructive."}, {"skater boy": "Roger, Charlie, give me a sitrep at 0900! A sitrep is a status report on military activity in an area."}, {"skeet": "A skater boy is slang (disparagingly and affectionately) for a guy who adopts the style and attitude of a stereotypical rebellious skateboarder."}, {"sket": "Not that dudes need another way to say cum, but they've got one with skeet, which is slang for ejaculating."}, {"skinny legend": "Familiar with slut, skank, ho, or floozy? Well, add sket to the list, as it’s yet another slang term for a promiscuous woman in the UK."}, {"skinny love": "Skinny legend is a term of endearment for a celebrity, usually a woman, whose fans consider them to be flawless but underappreciated. It’s also a meme where fans photoshop their idols to appear impossibly stick-figure thin."}, {"skosh": "The phrase skinny love has two separate meanings, both of which are linked to relationships. Skinny love can refer to two people who have very strong feelings for each other, but are too shy to show it. It can also refer to an existing relationship in which there’s no love or emotional fulfillment, but only a codependent need for affirmation."}, {"skrrt": "A skosh is a colloquial and imprecise unit of measurement meaning “a small amount.” The word is sometimes misspelled as scoshe."}, {"slay": "Whether you're singing along to trap rappers or making a quick getaway, skrrt is onomatopoeia for the sound of tires screeching. It's especially used as an excited interjection in trap music and by fans of the genre."}, {"sleazecore": "Yaaaaaas! Slay, queen! "}, {"slide into the dms": "Popular in the summer of 2018, sleazecore is a fashion trend featuring baggy, informal, and unfashionable articles of clothing that make one look like a schlub. "}, {"slime": "To slide into the DMs is online slang for sending someone a direct message on social media slickly and coolly, often for romantic purposes."}, {"slizzard": "Yo, whaddup, slime? Slime is slang for \"friend\"—your homie."}, {"sloppy seconds": "Slizzard is a hip-hop slang word for \"incredibly drunk or high.\""}, {"slut shaming": "Sloppy seconds is slang for having sex with someone who's just finished a sexual act with someone else. Less overtly sexual, sloppy seconds also refers to dating someone after they've just broken up with someone in your immediate social group."}, {"smash hit": "Slut-shaming is the practice of disparaging women, and occasionally men, for acting in a manner that violates \"norms\" regarding sexually appropriate behavior. These denigrations, which are often double standards, range from criticizing women for wearing sexy clothing or having multiple sexual partners to blaming sexual assault and rape survivors for their attacks."}, {"smash or pass": "A smash hit is a wildly successful piece of entertainment media, though its use has broadened to any successful enterprise, from beverages to technology. It's kind of like the viral of the pre-internet age."}, {"smells like teen spirit": "Smash or Pass is a game in which participants vote on whether they would smash (hook up with) or pass (not hook up with) another person (e.g., celebrity, stranger) based on a picture or video of them. Ready to get your feelings hurt? Let's play!"}, {"smol": "Smells Like Teen Spirit is an influential 1990s rock song by the band Nirvana."}, {"snacc": "In the internet slang of DoggoLingo, smol is an affectionate way of saying someone or something is small in size—so cute you just want to squeeze 'em."}, {"snake": "A snacc is internet slang for an extremely attractive or sexy person (i.e., you want to gobble them up like a snack)."}, {"snatched": "Snake can be slang for a person who acts in a deceitful, underhanded, or backstabbing way."}, {"sneak peek": "Is your wig still on, queen? In drag slang, snatched is \"fierce\" or \"on point,\" i.e., excellent, especially when it comes to personal appearance."}, {"snitch tagging": "A sneak peek is an opportunity to see or experience something before it is officially presented or released to the public."}, {"snow bunny": "Snitch-tagging is the act of tagging the subject of a negative post about them, especially on Twitter, that they weren't already tagged in (e.g., a subtweet)."}, {"snowclone": "A snow bunny is an attractive woman who enjoys skiing ... or a white woman who likes or is in a relationship with a black man."}, {"snowflake": "A snowclone is a customizable formulaic phrase that consists of a framework that can be adapted for different situations by changing some of the words. It’s typically expressed in terms of the invariable part of the phrase with blanks represented by X, Y, and Z, for example, X is the new Y."}, {"snowpocalypse": "No, we're not ❄ walking in a winter wonderland ❄.  Snowflake, here, is a political insult for someone who is perceived as too sensitive, often used for millennials and liberals."}, {"soccer mom": "A blend of the words snow and apocalypse, snowpocalypse is a major winter storm—the kind that shuts down a city or ... induces some dramatic overreactions."}, {"social experiment": "\"Jump in, kids, and don't forget your juice boxes!\""}, {"sofa king": "A social experiment is a type of research done in fields like psychology or sociology to see how people behave in certain situations or how they respond to particular policies or programs. "}, {"soo woo": "This definition is sofa king amazing. Read that sentence aloud. Read it again. Get it? Sofa king is a cheeky pun on so fucking. Sofa king clever!"}, {"sophies choice": "🎵 Lemme hear ya say \"Soo woo soo woo, soo woo, soo woo!\" 🎵 The term soo woo—along with variants like suhwoop, soo woop, and woop woop—is a greeting and identifier used by the fellow gang members in the Bloods. It is closely associated with Los Angeles and the rapper Lil Wayne."}, {"sorry not sorry": "Sophie’s choice refers to an extremely difficult decision a person has to make. It describes a situation where no outcome is preferable over the other. This can be either because both outcomes are equally desirable or both are equally undesirable."}, {"soyboy": "Sorry not sorry is a sarcastic way of acknowledging that someone might not like whatever you're saying or doing ... but you don't really care."}, {"soylent green": "Associated with the alt-right, soyboy is an insult used online for men seen as effeminate liberals. It comes from the myth that consuming soy products lowers testerone levels in a man. "}, {"spank bank": "Soylent Green is both the name of a 1973 science fiction film and of a wafer-like food product in the film. The film is a police procedural set in the future, based on the 1966 novel Make Room! Make Room! The food is a processed protein ration made of human beings and distributed to an unsuspecting populace."}, {"spare time": "A spank bank is a mental, and less often physical and digital, collection of images or situations stored away to call up later while masturbating. "}, {"spida": "Spare time is free, personal, or leisure time outside of one's work, school, or other primary obligations."}, {"spirit animal": "1. A basketball species usually found above the rim; equipped with superhuman senses, shot-slinging abilities and unrivaled bounce."}, {"spooning": "In certain spiritual traditions or cultures, spirit animal refers to a spirit which helps guide or protect a person on a journey and whose characteristics that person shares or embodies. It is also metaphor, often humorous, for someone or something a person relates to or admires."}, {"spotify and side hug": "Spooning is a form of cuddling where two people lay on their sides, with one person's back against the other's chest. In this position, the two people resemble two spoons nested together in a drawer. It's sickeningly sweet."}, {"square up": "If Netflix and chill is too intimate, you might opt for Spotify and side hug instead."}, {"squirting": "To square up means to get into a fighting position."}, {"stamp": "Squirting is a slang term for female ejaculation. In pornography, it usually features a voluminous, projectile stream from the vagina. Science says it's largely just urine. So, there's that."}, {"stan 2": "In slang, stamp can refer to LSD (acid) or a bag of heroin. It can also be short for food stamps or the expression stamp of approval."}, {"stanky leg": "Do you really, really, really like something? Then you might be a stan for it."}, {"starboy": "“Stanky Legg” was a song released by the hip-hop group GS Boyz in 2009. The music video popularized the stanky leg dance, which involves extending one leg and circling that knee, and then doing the same with the other leg."}, {"stashing": "Popularized by Canadian recording artist The Weeknd, a starboy is like a rockstar. The term can refer to a very famous man, the leading member of a group or team, or a male object of someone's affection."}, {"stay in your lane": "Have you ever been romantically involved with someone but never met any of their friends or family or have never even been featured on their social media? If so, you might be the victim of stashing, or when a partner hides another from friends and family and from their social media."}, {"steak and blowjob day": "The phrase stay in your lane means \"to mind your own business.\""}, {"stealthing": "Steak and Blowjob Day is an unofficial joke holiday which falls on March 14th, precisely one month after Valentine’s Day. Conceived as a dude-centric answer to Valentine’s Day, it includes the two things men stereotypically enjoy the most: meat and their meat."}, {"stick": "Stealthing is the act of removing a condom during sex without the consent of the partner. It’s illegal in many countries, and is a form of sexual assault."}, {"stupid fresh": "Stick is a slang term for \"gun,\" especially an automatic rifle in Southern hip-hop in the US. That means you can \"stick 'em up\"...with a stick. We recommend only using the actual twig variety, however."}, {"subreddit": "It ain't just fresh. It's stupid fresh, or \"extremely good.\" The slang often compliments someone's fashion or style."}, {"subtweet": "A subreddit is a specific online community, and the posts associated with it, on the social media website Reddit. Subreddits are dedicated to a particular topic that people write about, and they're denoted by /r/, followed by the subreddit's name, e.g., /r/gaming."}, {"succ": "A subtweet is a negative post, especially on Twitter, targeting a certain person without directly mentioning them or their username."}, {"sugar daddy": "Succ is a slang spelling of \"suck,\" used in the contexts of fellatio. It was popularized by Crips-affiliated rappers and an internet meme, the succ, about amazing, well, blowjobs."}, {"sugar rush": "A sugar daddy is an older man who basically just throws gifts, allowances, and trips on a younger woman or man in exchange for a consensual (?) sexual relationship."}, {"suh": "A sugar rush is an experience of high energy after eating or drinking a considerable amount of sugar in a short period of time, often associated with hyperactive children."}, {"sunday scaries": "Suh can mean \"sir\" or the casual greeting \"What's up?\" It's also a common Korean surname."}, {"supremium": "The Sunday scaries are the anxieties one experiences on Sunday when thinking about the impending workweek, school week, or other obligations that await in the week ahead. They are especially bad when accompanied by an end-of-the-weekend hangover."}, {"surrender cobra": "In the fashion world, Supremium refers to the (usually hefty) markup in the resale market for hot-ticket, Supreme-branded items, i.e., the premium on Supreme products."}, {"sus": "Found at sporting events, surrender cobra is a hands-atop-head pose made by fans when the their team's loss seems all but inevitable."}, {"swalla": "Sus is a shortening of suspicious or suspect. In slang, it has the sense of \"questionable\" or \"shady.\" "}, {"swamp ass": "Swalla is a dialectical or slang pronunciation of swallow, prominently appearing in hip-hop lyrics with respect to drinking alcohol or performing oral sex on men."}, {"swang": "Swamp ass involves a sweaty wetness in the butt crack or general nether region that may soak through the underwear, even the pants. Chafing and funky odors are also common symptoms. Beware."}, {"swole": "Swang is slang for showily steering a car side to side while driving. It can also be slang for chilling out and feeling good."}, {"t minus": "To be swole is to be very muscular, to have a nice physique, or to have really well-defined muscles. Swole, as an adjective, can refer to a specific body part or the entire body, and it is generally used in a positive way."}, {"tactical shit": "T-minus 10...9...8..."}, {"tagged": "Tactical shit is a slang reference to military equipment, usually \"tricked out\" by civilians for recreational or far-right paramilitary purposes."}, {"take lines": "A person is tagged when they are identified in a post on social media."}, {"tame": "The phrases take lines and take a line are horses of two very different colors. Take lines can refer to using someone else’s work, usually as a form of plagiarism, while take a line can also refer to using drugs, especially cocaine."}, {"tango down": "When an animal is tame, it has been domesticated, a sense metaphorically extended to someone or something considered \"subdued,\" \"boring,\" or \"mild.\" Tame is also a verb for so subduing someone or something, used in slang for sexually dominating a person in a desirable way."}, {"taylor gang": "Tango down is military slang announcing that an enemy has been defeated in combat. Tango down has been adopted in first-person shooter games when teams are strategizing over audio."}, {"tbh rate and date": "Yeaaahhhh! It's young Khalifa, man! The Taylor gang refers to the rapper Wiz Khalifa fans and his crew. It's also the name of Wiz Khalifa's record label, Taylor Gang Entertainment. And no, Taylor Swift has yet to be invited in."}, {"tea": "Tbh, rate, and date is a social-media prompt in which someone requests friends’ opinions of them. The friends then post an honest statement, a rating, and whether they’d date them or not."}, {"tec": "Best served piping hot, tea is slang for \"gossip,\" a juicy scoop, or other personal information."}, {"teethpaste": "TEC is short for TEC DC-9, a semiautomatic pistol associated with criminals."}, {"text me": "Teethpaste is a humorous form of toothpaste. It typically comes up in considerations of or jokes about why tooth isn't plural in toothpaste."}, {"that escalated quickly": "Text me is a common way to ask someone to send you a text message on their phone, often to catch up or make plans."}, {"thats what she said": "The phrase that escalated quickly is often used when a scenario goes from relatively calm or innocuous to out of hand and intense."}, {"the 6": "That’s what she said is a form of innuendo that takes innocent statements out of context and makes them sound lewd or sexual."}, {"the chronic": "The 6 is a nickname for the city of Toronto, Canada. You can thank the rapper Drake for (trying to make) it a thing."}, {"the clap": "The Chronic is a widely influential hip-hop album that was released by rapper and producer Dr. Dre in 1992."}, {"the d": "The clap is a slang term for a venereal disease, typically gonorrhea."}, {"the dress": "Do you want the D? No, we don't mean Dictionary.com, alas. The D is an affectionate nickname for the city of Detroit, Michigan. The D is also a slang euphemism for dick, or \"penis\" or \"sex\" more generally. But don't worry, Detroit: Many people want the D!"}, {"the game": "The question What color is this dress? refers to a photo of a striped dress, the dress, which went viral, resulting in an active social media debate for the next few days over whether #TheDress was white and gold or blue and black."}, {"the girl next door": "The Game is a psychological game that involves not thinking about the existence of The Game. When someone thinks about The Game, they lose."}, {"the struggle is real": "The girl next door is a term used to describe a female archetype and fashion aesthetic which can range in terms of personal definition, but usually denotes a girl or woman who appeals to traditional or “all-American” gender norms with the allure of purity, simplicity, and charm, with a natural, modest, or effortless beauty."}, {"the wild 100s": "My WiFi is slow. I can't find matching socks. I have a 9am meeting. The struggle is real ..."}, {"they see me rollin": "The Wild 100s is a nickname for the South Side of Chicago, Illinois, specifically the Roseland neighborhood."}, {"thicc": "They see me rollin is a meme used to describe unusual or humorous modes of transportation."}, {"thick girls": "🎶 Back that azz up 🎶. Thicc is a slang term for a full-figured body, specifically a big butt and curvy waist.  It is both used sexually and humorously."}, {"thigh gap": "The term thick girls is used for women who are considered especially attractive due to their voluptuous or curvaceous figures."}, {"thirst trap": "A thigh gap is a space between the inner thighs of someone who is standing with their knees straight and their feet together. It’s a so-called standard of beauty particularly applied to women’s bodies."}, {"this guy": "Set a scene, get the right angle, reveal a little thigh, and snap! A thirst trap is a sexy photo posted on social media to attract attention. It can also refer to a person considered sexy—a social-media crush."}, {"this is why im broke": "Who's got two thumbs and just dropped their cell phone in the toilet? This guy. This guy is an expression used to highlight when someone has done something stupid or unbelievable. It's often used to reference oneself."}, {"thot": "This is why I’m broke is a phrase and internet meme used to bemoan one’s finances, especially as a facetious complaint about one’s impulse purchases online."}, {"throwback thursday": "Thot is a slang acronym standing for that ho over there or thirsty hoes over there, and is used as a synonym for vulgar slurs like slut, bitch, or whore."}, {"throwing shade": "Throwback Thursday or TBT is a social-media trend when users, on Thursdays, post photographs or recollections of the past under the #throwbackthursday, #tbt, or #throwback hashtags."}, {"thug life": "Throwing shade is a subtle way of disrespecting or ridiculing someone verbally or nonverbally."}, {"timbs": "Especially in black hip-hop culture, thug life refers to a determined and resilient attitude to succeed in life in spite of racism and injustice."}, {"tinderellla": "Timbs is a nickname for Timberland brand boots, often referring specifically to the brand’s six-inch work boots."}, {"titty fuck": "A play on words between the classic fairy tale Cinderella and the popular mobile dating app Tinder, a Tinderella is an attractive person on Tinder, particularly one who's accidentally gotten away. This usually doesn't involve a glass slipper, but rather an accidental swipe left when using the app."}, {"too much sauce": "\"Breast sex\" is a polite form, we guess, of the vulgar titty fuck, which is when a woman masturbates a man between her breasts."}, {"toss your salad": "A person has too much sauce when they wear too many designer clothes and accessories at the same time and, by extension, when they display the (over)confidence such items might afford them."}, {"tosser": "No, we're not talking, here, about mixing together the ingredients and dressing for a nice, healthy lunch. To toss someone's salad is sexual slang for anilingus, or orally stimulating someone's anus. 🥗"}, {"totes mcgotes": "Tosser is a British slang expression for an obnoxious jerk."}, {"trap queen": "Totes McGotes may sound like a cartoon character, but it's just a way to voice approval or agreement."}, {"tribbing": "Originating in drug slang, a trap queen is a strong, loyal woman, often used in hip-hop and black culture."}, {"triggered": "Tribbing refers to a sexual practice in which women stimulate each other by rubbing their genitalia together."}, {"trill": "Triggers are anything that remind someone of previous trauma. To be triggered is to have an intense emotional or physical reaction, such as a panic attack, after encountering a trigger. "}, {"trippin": "Keep it trill, y'all. Trill is a blend of true and real, used in hip-hop slang for someone or something that is genuine and authentic."}, {"truffle butter": "You trippin' means you're acting a fool, thinking crazy thoughts, or are maybe high on mushrooms. Trippin' out is \"freaking out\" or \"being extremely high.\""}, {"trumpian": "Outside of cooking and eating, truffle butter is, um, not very appetizing."}, {"trumpism": "Trumpian refers to the bombast, egotism, and lies, or anti-establishment, authoritarian, bigoted ideologies that some associate with the language, conduct, and viewpoints of President Donald Trump."}, {"trust the process": "Trumpism refers to the nontraditional political philosophy and approach espoused by US President Donald Trump and his supporters. The term Trumpism can also be used to directly refer to an outrageous or idiosyncratic statement made by Donald Trump."}, {"truth be told": "Trust the Process is a slogan used by fans of the NBA's Philadelphia 76ers, though it has since become popular elsewhere in sports and culture. Coined during a rough patch for the team, it basically means \"things may look bad now, but we have a plan in place to make it better.\""}, {"truther": "Truth be told is an expression used when someone reveals a fact or opinion they might otherwise hold back or lie about."}, {"tumblr girl": "A truther is a person who believes major events or situations are being covered by conspiracies."}, {"turn down for what": "A Tumblr girl is a specific kind of young woman that actively uses the social media website Tumblr. Typically, Tumblr girls are considered attractive, are interested in fashion, post many photographs of themselves, and have a distinctive aesthetic sensibility associated with hipsterism."}, {"turnt": "At its core, turn down for what is a phrase used to promote having a good time. The phrase itself implies that there is no reason to turn down and stop partying. It seeks to feed the hype of whatever is going on."}, {"twat": "Turnt means extremely excited, wild, or drunk. It can refer to a person’s state of mind, or to an atmosphere, such as at a party."}, {"twee": "A twat is slang for \"vagina.\" It's also used, especially in British English, to insult someone as stupid, useless, or reckless."}, {"twitterstorm": "Twee describes someone or something as affectedly and cloyingly cute, sweet, and quaint. It's also a subgenre of indie pop music."}, {"u hauling": "A Twitterstorm is a sudden flurry of activity about a specific topic on Twitter. It is often started by a single person."}, {"ublearns": "U-hauling is a sometimes derogatory slang term that refers to two women who move in together very soon after they start dating."}, {"uckers": "UBlearns is the name of the virtual academic task manager for the University of Buffalo in New York state."}, {"ugly cry": "Uckers is a slang term for a woman who is particularly gifted at, or frequently performs, fellatio."}, {"unboxing": "Ugly cry refers to an intense sobbing which contorts the face of the person crying in way that is often perceived as exaggerated or unpleasant."}, {"under construction": "Unboxing is the act of documenting oneself, mostly on video, of opening a packaged product from a box and displaying, reviewing, and showing off its contents."}, {"under siege": "Under construction refers to a building, structure, or project that is unfinished but actively being worked on."}, {"underboob": "Under siege is a phrase meaning \"to be experiencing an attack,\" used literally or figuratively. It supplied the title of a noted 1992 action movie starring Steven Seagal."}, {"unfff": "It's a boob. From the bottom. Without the nipple showing. The underboob refers to the parts of breasts below the nipple, often exposed in a high-cropped top."}, {"unsult": "Unfff is an exclamation typically used to express sexual attraction."}, {"updoot": "An unsult is a backhanded compliment, i.e., an insult packaged as a compliment."}, {"vaguebooking": "Updoot is a humorous internet slang for an upvote (or a \"like\"), which is a favorable rating a user gives to an online post or website."}, {"vajazzle": "A blend of vague and Facebooking, vaguebooking is the practice of making a post on social media, primarily Facebook, that is intentionally vague but highly personal and emotional. Designed to elicit concerned responses from friends and family, it's often looked down upon as a desperate call for attention or need for validation."}, {"vaporwave": "Vajazzling refers to when a woman covers her pubic area with decorative flourishes, such as gemstones, rhinestones, or glitter."}, {"vaulted": "Vaporwave is a subgenre of electronic music which features heavy sampling and editing, surreal and futuristic themes, and 1980s and 1990s imagery, musical styles, and consumer culture."}, {"violate": "Vaulted can variously refer to an arched structure, the action of leaping over something, or when you place something in a secure chamber or box. In the massive popular online game Fortnite, vaulted is used to describe any weapons or items that have been removed from the game."}, {"vore": "To violate is to breach some code of conduct, often in an egregious manner. It is often used to describe breaking the law or committing physical violence against another–especially rape and sexual assault. In black slang, to violate someone is personally insulting or assaulting someone."}, {"vote for pedro": "Vore is a fetish involving being eaten by or eating someone or something, real or imaginary."}, {"wackadoodle": "Vote for Pedro is a reference to a campaign slogan in the 2004 cult-classic film Napoleon Dynamite. It is often used politically or nostalgically."}, {"wag the dog": "Wackadoodle describes someone or something as eccentric, wrongheaded, bizarre, or foolish, generally in an amusing way and with a mildly dismissive tone."}, {"wagwan": "To wag the dog means to distract attention away from a political scandal, often through military action."}, {"wake and bake": "Wagwan is a way to say What's going on? in Jamaican English, used throughout the Jamaican diaspora (or where Jamaican people live outside of Jamaica), especially in South London."}, {"walm": "Wake and bake is the act of smoking (or otherwise consuming) marijuana first thing in the morning. For advocates, this is ideally done while still in bed, in PJs, and right before a really satisfying breakfast. A wake and bake with coffee added to the menu is sometimes called a hippy speedball."}, {"washed": "Walm is an archaic word referring to “gushing or boiling water,” now largely appearing as a common misspelling of the word warm ... and sometimes a blend of warm and calm because we need that type of word in our lives."}, {"water ice": "Someone's who's washed (out) might be burnt out, exhausted, or, if they're a drug user, extremely high. More tragically, if they're washed (up), they might be over, i.e., canceled, passé, or not cool anymore."}, {"water under the bridge": "Water ice is a frozen dessert, very similar to Italian ice, made in Philadelphia."}, {"wavy": "Water under the bridge refers to past events, especially fights or disagreement, that are forgiven, forgotten, or otherwise no longer considered important."}, {"weeaboo": "Popularized by hip-hop artist Max B, wavy is slang for something \"cool,\" \"chill,\" or \"excellent.\""}, {"weeb": "Weeaboo is a mostly derogatory slang term for a Western person who is obsessed with Japanese culture, especially anime, often regarding it as superior to all other cultures."}, {"weird flex but okay": "A weeb is a derisive term for a non-Japanese person who is so obsessed with Japanese culture that they wish they were actually Japanese."}, {"welp": "Weird (or odd) flex but OK is a snarky, mocking internet slang response to when someone brags about something deemed unusual, bizarre, baffling, or questionable. A boast about owning a zebra or spending $1000 at Starbucks? Weird flex but OK."}, {"wenis": "Welp, an alternative pronunciation of well, is an interjection typically used at the beginning of a sentence to express resignation or disappointment."}, {"wet": "Wenis and wagina are joke words for referring to the skin on the outside and the pit of the elbow, respectively."}, {"what doesnt kill you makes you stronger": "Wet means much more than just dampness. As slang, wet is most commonly used to describe when a woman's vagina gets wet from sexual arousal, although it can also refer to alcohol or getting beaten bloody."}, {"what the actual fuck": "What doesn’t kill you, makes you stronger comes from an aphorism of the 19th century German philosopher Friedrich Nietzsche. It has been translated into English and quoted in several variations, but is generally used as an affirmation of resilience."}, {"whats up": "Some things are so puzzling, infuriating, unbelievable, or spectacular that a simple What? or What the fuck? just won’t cut it. "}, {"wheels up": "What’s up is an informal greeting (“Hey, buddy, what’s up?”), idiomatic phrase, or an inquiry about a current or recent state of affairs (“You seem sad. What’s up?”)."}, {"whippets": "Wheels up is a colloquial term for the takeoff of an aircraft, occasionally applied to other vehicles."}, {"whiskey tango foxtrot": "A slang term for the recreational use of nitrous oxide, whippets, also called laughing gas, are a staple of most Phish concerts. A canister of the gas may be called a whippet or the drug itself may be called whippets, as in \"doing whippets.\""}, {"white girl": "Based on letters of the military phonetic alphabet, Whiskey Tango Foxtrot is a euphemistic substitution for what the fuck or WTF."}, {"whitesplain": "White girl is just another name for young Caucasian females ... but it often stereotypes them as vapid materialists. The term white girl is also slang for cocaine."}, {"whos your daddy": "Whitesplaining is the act of a white person explaining topics to people of color, often in an obliviously condescending manner, and especially regarding race- or injustice-related issues."}, {"whoosah": "Someone asking Who's your daddy? isn't looking for an answer: They're making a point about how great they are. It's a sign of male dominance, insinuating the listener is a mere child."}, {"why so serious": "Whoosah is a slang expression variously used to indicate or achieve a state of calm and relaxation."}, {"wiener": "Why so serious? is a famous line from the movie The Dark Knight. Spoken by the villainous Joker, it plays on his clownish appearance and cheerful demeanor, which stays in place even while he does violent or gruesome things."}, {"windy city": "A wiener is a type of sausage or anything that superficially resembles one, particularly a penis or a dachshund breed of dog. "}, {"winner winner chicken dinner": "Windy City is a popular nickname for Chicago, Illinois."}, {"woe is me": "Bingo! Jackpot! Winner winner chicken dinner!"}, {"woke": "Woe is me is an over-dramatic, often comical way to express sadness or disappointment at an unfair situation. The phrase carries such connotations because of its archaic-sounding grammatical structure."}, {"woo woo": "Woke means being conscious of racial discrimination in society and other forms of oppression and injustice. In mainstream use, woke can also more generally describe someone or something as being \"with it.\""}, {"would you look at that": "Woo-woo is an insult for or describing mystical or supernatural beliefs not backed up by science, e.g., alternative medicine practices like healing crystals or cupping."}, {"would you rather": "Would you look at that is a rhetorical question or interjection used to variously comment on something surprising, frustrating, puzzling, or enticing as well as something cynically expected or counter to one's expectations.  "}, {"wypipologist": "Would you rather refers to a game where participants must choose between two challenging scenarios and explain why."}, {"xenomorph": "Wypipologist is a humorous slang term for someone, usually a black person, who \"studies\" wypipo, or \"white people.\" Wypipo, after all, do some crazy stuff in need of expert explanation."}, {"xtra": "A xenomorph is a type of alien from the science-fiction horror franchise Alien known for its grotesque appearance and parasitic form of reproduction."}, {"xxx": "Xtra is a stylized spelling of extra and means \"dramatic\" in an unnecessary or empowered way. The term is popular among young adult females and in LGBTQ communities."}, {"xxxx": "XXX marks something as pornographic, often used as shorthand for any sexual content. "}, {"yayo": "In letters and text messages, xxxx symbolizes a series of kisses, used as an affectionate sign-off or goodbye. "}, {"yee": "Yayo, as in Chichi, get the yayo!, is Spanish slang for cocaine. It's also spelled llello or yeyo."}, {"yeet": "Yee is the sound that a character from the movie Dinosaur Adventure makes. It’s also the name of a meme. The meme generally involves taking existing media and adding sound clips from two characters from the movie, named Peek and Oro. Either a whole song is replaced by manipulated versions of the sound clips, or non-altered sound clips are intermittently peppered throughout popular songs."}, {"yes maam": "YEET! Yeet is an exclamation of excitement, approval, surprise, or all-around energy, often as issued when doing a dance move or throwing something."}, {"yesnt": "Yes ma'am is a polite way of affirming something an older or superior woman has said, often used to show sass or excitement in response to something more generally."}, {"yiff": "Yesn’t is a negative used to express dissent or an unwillingness to do something."}, {"yinz": "Yiff relates to sexual content within the furry fandom. It can be furry porn (as in pornographic images or movies) or it can be sexual interaction involving furries (the fans themselves or the characters). Generally, this word isn’t taken too seriously within the fandom."}, {"you are": "Yinz is a Pittsburgh equivalent to y'all. It is used to address two or more people as a second-person plural pronoun."}, {"you mad bro": "\"You're smelly!\" \"No, you are.\" \"No, you are.\""}, {"you reap what you sow": "U mad? is a slang phrase used to taunt and push the buttons of someone who is already angry or upset. It can be used as a question or simple declaration. U is sometimes spelled out as you."}, {"you rock": "You reap what you sow is a proverb that says future consequences are inevitably shaped by present actions."}, {"youre doing amazing sweetie": "You rock is a slang phrase of praise or encouragement conveying \"You're awesome (at something)\" or \"You can do it!\""}, {"you 39 re killin me smalls": "If you ever need to let a friend know how awesome they are, tell them you're doing amazing, sweetie."}, {"youre so sound": "You're killing me, Smalls is used as a general expression of exasperation with someone or something."}, {"your mom": "You’re so sound is something you might say to someone you admire, especially in the UK and Ireland. Sound, as a slang adjective, can mean \"excellent.\""}, {"yout": "Your mom is a phrase that’s typically followed by a statement poking fun at someone’s mom. This always involves hyperbolic statements revolving around a personal trait that she may or may not possess."}, {"yt folx": "Yout is a form of \"youth,\" especially associated with Jamaican Creole and Caribbean English around the world."}, {"yuge": "Yt folx is internet slang for \"white folks.\" Sometimes serious but often humorous, yt folx is typically used by people of color, usually black Americanas, to call out white privilege, racism, or cultural appropriation."}, {"yut": "Yuge is the pronunciation of the word huge in a New York accent. The term is closely associated with Donald Trump ... because he says it a lot."}, {"z shit": "Yut is an exclamation expressing excitement and camaraderie among US Marines."}, {"zerg rush": "The expression Z shit comes from the 2018 song \"ZEZE\" by Kodak Black. It's used to refer to his gangster, Haitian Creole lifestyle."}, {"zero fucks": "Zerg rush is an attack strategy that involves overwhelming an opponent with large numbers or ganging up on someone."}, {"zomg": "Nada. That's how many fucks the expression zero fucks gives."}, {"zuckered": "ZOMG, I just won the lottery! When your everyday OMG just isn't enough, kick it up a notch with zomg or ZOMG. No one is too sure what the Z means ... read on."}]}{"definition": [{"word": "jesus take the wheel", "def": "Jesus take the wheel is a request for divine intervention. It is sometimes used seriously, and sometimes used humorously."}, {"word": "jive turkey", "def": "A jive turkey is someone who is unreliable, makes exaggerations or empty promises, or who is otherwise dishonest. The phrase is so associated with 1970s culture."}, {"word": "joe sixpack", "def": "A Joe Sixpack is an average, working-class American male. He is often characterized—sometimes positively, sometimes negatively—as a guy who isn't very highly educated, who likes sports, and who enjoys putting back a couple of beers."}, {"word": "jonesing", "def": "If a person has an insatiable craving for someone or something, they are said to be jonesing for it."}, {"word": "juggalo", "def": "A Juggalo is a fan of the Detroit-based rap duo Insane Clown Posse (ICP) or the other groups on their Psychopathic Records label. Female Juggalos are sometimes called Juggalettes."}, {"word": "juice", "def": "Do you got the juice? One has juice if they have respect, influence, power, authority, or sexual desirability. It can also be slang for alcohol and electric power, among other things."}, {"word": "jump out boys", "def": "Sometimes carrying a derogatory tone, jump out boys is slang for \"the police\" or \"law enforcement officers.\""}, {"word": "kavanaseous", "def": "Kaya is a slang word for marijuana closely associated with Bob Marley."}, {"word": "keep calm and carry on", "def": "Commonly featured on posters, clothing, novelty items, and internet memes, keep calm and carry on is a popular slogan calling for persistence in the face of challenge. It was first used on a British propaganda poster during World War II but now enjoys general currency as an expression of resilience."}, {"word": "keep it 100", "def": "Keep it 100 is a slang phrase that means being authentic and truthful, akin to \"keeping it real.\""}, {"word": "kek", "def": "Kek is an online term with similar meanings to LOL or haha, used especially by gamers. Since the 2016 US presidential election, the Egyptian god Kek, portrayed as Pepe the Frog, has become a symbol of the so-called “alt-right.”"}, {"word": "kiki", "def": "A kiki is a social gathering, usually for the purpose of casually “kicking back,” gossiping, and sharing stories. It is historically connected to LGBTQ communities."}, {"word": "kino", "def": "Kino variously refers to a category of art-house cinema on internet message boards, an experimental film movement, or a term for intimate touch among certain men trying to seduce women."}, {"word": "kissanime and chill", "def": "Want to Netflix and chill but watch anime instead and, you know, do other stuff? No, we're not asking you. We're just explaining what it means to KissAnime and chill."}, {"word": "kite", "def": "These aren’t the kites they sing about at the end of Mary Poppins. In US prison slang, a kite is a message or note, historically contraband notes passed between prisoners or smuggled out of prison."}, {"word": "kumbaya", "def": "Rooted in an American spiritual and folk song of the same name, kumbaya refers, often disparagingly, to moments of or efforts at harmony and unity."}, {"word": "lalaland", "def": "Lalaland is a colloquial term for \"being out of touch with reality,\" usually due to bliss or ignorance."}, {"word": "laldy", "def": "In Scottish slang, a laldy is a \"beating\" or \"thrashing.\" The expression to give it laldy means doing something with lots of energy and vigor, e.g., with gusto."}, {"word": "lamo", "def": "Don't be a lamo! Lamo is an occasional spelling of the insult lame-o, or \"pathetic (person or thing).\" It can also be used as an ironic take on the acronym LMAO (laughing my ass off)."}, {"word": "larry stylinson", "def": "Larry Stylinson is the nickname given to the pairing of One Direction members Louis Tomlinson and Harry Styles, who some fans believe have a secret relationship."}, {"word": "laying pipe", "def": "The expression laying pipe is a very visual euphemism for using one's penis to \"have vigorous sex with\" another. Tl;dr: Pipe is slang for \"penis.\""}, {"word": "lean", "def": "Lean is a slang term for prescription cough syrup infused with codeine and promethazine. It’s popularly known in hip-hop culture by several nicknames including “purple drank” or “sizzurp.”"}, {"word": "left on read", "def": "In internet slang, a person is left on read when a recipient has read, but not responded to, a sender's message. The expression is often used to express feeling ignored."}, {"word": "lets go", "def": "Let's go is an expression variously and widely used to take leave, show excitement, cheer, express impatience, or challenge someone."}, {"word": "lil", "def": "Li’l is an abbreviation of the word little. It’s often used in names or titles to emphasize youth or physical size."}, {"word": "libtard", "def": "Libtard is an insult usually used by conservative trolls online to characterize liberals as stupid."}, {"word": "like a boss", "def": "To do something like a boss is to do it with stylish confidence or authority. This can be applied, tongue in cheek, even to fairly mundane tasks."}, {"word": "lmgtfy", "def": "Lmgtfy is an internet acronym standing for let me Google that for you, used when someone requests information that they could have easily found themselves."}, {"word": "lurking", "def": "Lurking is lying hidden or moving about secretly, as if to ambush someone. In internet culture, it specifically refers to browsing social media sites or forums without engaging with other users."}, {"word": "mac 10", "def": "MAC-10 is the nickname for a submachine gun, officially designated the M10, and originally manufactured by the Military Armament Corporation."}, {"word": "mad dog", "def": "Mad dog is slang term used to describe someone as \"wild and crazy.\" It is often used as a nickname or to describe a kind of mean stare. "}, {"word": "mafa", "def": "We have had it with these mafa snakes on this mafa plane! Like mofo and muhfuh, mafa is a shortening of the slang, motherfucker."}, {"word": "make it rain", "def": "To make it rain is to freely give out cash or other items, make a lot of money, or become a big success."}, {"word": "mancelled", "def": "Before the #MeToo movement took off in 2017, mancelled was sometimes used to refer to dudes being flakey and cancelling their plans. In the post-#MeToo era, problematic or offensive men can expect to get mancelled, a blend of man and cancelled, i.e., shunned."}, {"word": "mandela effect", "def": "The Mandela Effect refers to when a large number of people share a false memory, originally attributed to the existence of multiple universes."}, {"word": "mangina", "def": "Mangina is a derogatory term for any man perceived as effeminate, especially used online to put down men who identify as feminists. It can also insult the genitals of persons of all gender identities."}, {"word": "mannequin challenge", "def": "The mannequin challenge refers to a viral video trend in which a group of people are filmed frozen in position like mannequins."}, {"word": "manojob", "def": "A manojob is the name of a pornography website and a slang coinage for the sexual act of a hand job."}, {"word": "manosphere", "def": "Are you a meninist? Advocate of men’s rights? Just plain hate womankind? Then the manosphere might be the place for you! As for the rest of the population, y'all probably wanna steer clear …"}, {"word": "mansplain", "def": "To mansplain is for a man to explain something to a woman in a condescending manner, particularly when the woman is an expert in the subject."}, {"word": "mayo", "def": "Typically, mayo is short for mayonnaise, a classic condiment made of oil, vinegar, and egg yolks. When not, it can also be a slur against white people or a slang term for drugs."}, {"word": "mean the world", "def": "To mean the world to someone is an idiomatic way of saying they are exceptionally valued and important, often used for love."}, {"word": "mean mugging", "def": "Have you ever seen someone look at you a little funny, or give you a dirty look? That's mean-mugging, or the act of glowering at someone with an intimidating, irritated, or judgmental facial expression."}, {"word": "meninist", "def": "A meninist is someone who—wait for it—believes men are victimized by feminism and that attention needs to be called to what they believe are the struggles of being a man in the 21st century."}, {"word": "merkin", "def": "A merkin is a pubic wig. It is placed over the genitals to simulate pubic hair and to keep the private body parts from full exposure."}, {"word": "middle finger", "def": "Middle finger means fuck you. The end."}, {"word": "mile high club", "def": "The mile high club is a slang term for people who’ve had sex during a flight. Mile high alludes to the high altitude of air travel and club refers to the act’s rarity and exclusivity."}, {"word": "milkshake", "def": "From a 2003 pop song of the same name, milkshake is a slang term for an attribute that makes a woman stand out."}, {"word": "milkshake duck", "def": "A Milkshake Duck is a person (or thing) who becomes extremely popular on the internet for some positive reason, but as their popularity takes off and people dig into their past, they quickly become an object of outrage and hatred."}, {"word": "millennials", "def": "The millennial years range from the early 1980s to the early 2000s. Millennials are people that were born at any time during this period."}, {"word": "mind blown", "def": "Mind blown is used as an exclamatory response to surprising or interesting facts or enlightening information."}, {"word": "mist", "def": "A mist is, literally speaking, a cloud of fine liquid droplets, but in slang it can variously refer to drugs and the experience of being on them. Mist can also be an alternative spelling or misspelling of missed."}, {"word": "mlem", "def": "Is that peanut butter on my nose? Mlem!"}, {"word": "mmk", "def": "Mmk is a casual, half-humming way to say OK. It is a versatile sound, used to express mild disproval and suspicion ... or warm affirmation. Be careful, though, as mmk can come across as a little patronizing or rude."}, {"word": "moar", "def": "Moar is an intentional misspelling of more, used online as a humorous demand."}, {"word": "molly percocet", "def": "Molly Percocet isn't the name of that girl next door. Nope, it's the name of two drugs, molly (MDMA) and Percocet (oxycodone), often taken together recreationally and referenced in rap artist's Future's hit 2017 song, \"Mask Off.\""}, {"word": "molon labe", "def": "From the Greek for “come and take them,” molon labe is a slogan used to express defiance, and is frequently employed by gun-rights advocates in the US."}, {"word": "mondaze", "def": "Mondaze is a blend of Monday and daze, a humorous term for the stupor some find themselves in at the start of the work week."}, {"word": "mongo", "def": "Mongo can be a slang term for \"huge\" or \"extremely.\""}, {"word": "moon crickets", "def": "Though it may sound fanciful and innocent, this term is absolutely not. "}, {"word": "moon rocks", "def": "Yes, moon rocks can refer to rocks from the actual moon, but nobody is smoking those (as far as we know)."}, {"word": "moonbat", "def": "A moonbat sounds more like some something from a science-fiction novel than a political insult for people with left-leaning political views. In fact, that's exactly where the term comes from ..."}, {"word": "moose knuckle", "def": "Moose knuckle is a slang term for when the outline of man’s genitalia are visible through particularly tight or hiked-up clothing."}, {"word": "more cowbell", "def": "More cowbell is a pop-culture catchphrase that stems from a comedy sketch about 1970s rock music. The sketch centers around a character who seems to believe that the cowbell, a simple percussion instrument, is the secret ingredient to make a song work. More cowbell can stand in for anything that a person is longing for or feels is lacking. The phrase may also be used as a simple shout-out to other fans of the sketch."}, {"word": "mormon underwear", "def": "Mormon underwear refers to a conservative type of underwear, considered sacred, worn at all times by members of the Church of Jesus Christ of Latter-day Saints (LDS), or the Mormon Church."}, {"word": "morning skinny", "def": "Let's face it: Getting out of bed in the morning is the worst. But if you're body-conscious, there might be one perk: morning skinny."}, {"word": "morning wood", "def": "Morning wood is a slang term for an erection experienced first thing in the morning."}, {"word": "mud shark", "def": "Warning: This article features information about a racial slur that is highly offensive and that should not be used ... ever."}, {"word": "muff cabbage", "def": "Muff cabbage is a vulgar, vagina-based insult popularized by a 2010 South Park episode."}, {"word": "mufo", "def": "Mufo is short for mutual follower, referring to someone you follow on social media who follows you back."}, {"word": "muh", "def": "Muh is a pronunciation of the pronoun my found in some dialects of English. Online, it can be used to portray someone as ignorant or just to sound cute and silly."}, {"word": "mula", "def": "Mula is a common and widespread slang term for money, used much like other monetary slang items such as dough or bones."}, {"word": "murica", "def": "If your a beer-swillin', gun-totin', freedom-lovin', flag-wavin', red-blooded person from the U S of A, you might say you live in Murica."}, {"word": "murphys law", "def": "Murphy's Law is the idea that if something can go wrong, it will. Because ¯_(ツ)_/¯."}, {"word": "n2o", "def": "N2O, NOS, and nitrous are all used as shorthand by car and racing enthusiasts for the gas nitrous oxide."}, {"word": "nailed it", "def": "Nailed it is an expression used to comment on the successful, skillful, or clever completion or performance of something. It’s often used sarcastically in reference to efforts that comically failed."}, {"word": "naked otter", "def": "Outside occasional literal references to hairless or shaved otters, a naked otter is a slang term for nude pictures of a slim, hairy gay man."}, {"word": "nappy hair", "def": "Nappy hair is historically used as a derogatory term to describe the hair of black people, especially women, many of whom have re-appropriated the term."}, {"word": "nasty girl", "def": "A nasty girl variously refers to an ill-tempered, sexually adventurous, or self-empowered young woman."}, {"word": "national send a nude day", "def": "National Send a Nude Day is a joke hashtag and holiday dedicated to sending nude photographs. The ambiguity of the intended recipients of the photos and the broader public reaction to it helped transform it into a trend on social media."}, {"word": "nawf", "def": "Nawf is a dialectical pronunciation and spelling of \"north,\" commonly associated with Black English. The popular rap group Migos to refer to north Atlanta, Georgia as the Nawf."}, {"word": "nd", "def": "Nd is a typo or short form of and, common in digital communication. "}, {"word": "neckbeard", "def": "A neckbeard is an informal term for facial hair on the neck, usually ungroomed, and sometimes accompanied by little or no hair on the rest of the face. It is often used to stereotype nerds or geeks."}, {"word": "negging", "def": "Negging is the practice of giving backhanded compliments and generally making comments that express indifference toward another person (usually a woman) in an attempt to seduce that person."}, {"word": "netflix and chill", "def": "Netflix is the popular TV- and movie-streaming service. Chill is a verb that, in this context, means relaxing. Netflix and chill, as a distinct phrase, means to watch Netflix with a romantic prospect, with the eventual expectation of sexual activity."}, {"word": "nice guy", "def": "He's a nice guy, but ..."}, {"word": "nickel", "def": "Nickel is a slang term for \"five\" of anything, most commonly a five-dollar or small bag of drugs ... but it could also be a five-year prison sentence."}, {"word": "nifoc", "def": "Enjoyed by nudists and masturbators alike, NIFOC stands for naked (or nude) in front of computer. It is often used humorously and facetiously online, but you can never be too sure when it comes to the internet."}, {"word": "no cap", "def": "The expression no cap is slang meaning \"no lie\" or \"for real,\" often used to emphasize someone is not exaggerating about something hard to believe."}, {"word": "no mames", "def": "No mames is crude Spanish slang used to express disbelief (both positive and negative) or excitement. Used especially among Mexican Spanish speakers, the exclamation corresponds to “No way!”, “You’re kidding me!”, or “Stop messing with me!”. For instance, a statement of “I won the lottery” might be followed by “no mames.”"}, {"word": "no new friends", "def": "No new friends is a motto coined by the hip-hop artist Drake, taken from the song of the same name. It describes the stance that someone is going to stick with the friends they already have. They don’t need #NoNewFriends."}, {"word": "no shave november", "def": "No-Shave November refers to an annual charity event where men don’t shave, groom, or cut their facial hair for the entire month of November as a way of raising awareness and money to fight cancer."}, {"word": "noice", "def": "Noice, or nice pronounced with an exaggerated Australian accent, is a synonym for awesome. This spelling is helpful for internet users to convey the pronunciation in text."}, {"word": "noob", "def": "Get wrekt, n00b! In internet slang, noobs are hapless, unskilled beginners who don't know what they are doing. As far as gamers are concerned, a noob is a nothing more than an easy kill—or a real nuisance as a teammate."}, {"word": "nootropics", "def": "Nootropics, also known as smart drugs, are drugs or other supplements used by cognitively healthy individuals in an effort to increase their cognitive functioning."}, {"word": "og", "def": "OG is a slang term for someone who's incredibly exceptional, authentic, or \"old-school.\" It can be earnestly used for a legend like Michael Jordan or more ironically, like for that friend who can unwrap a Starburst with their mouth."}, {"word": "oh my", "def": "How many meanings and uses you have, oh my. This common interjection variously expresses surprise, concern, and admiration. It's sometimes used for quaint or humorous effect."}, {"word": "oh my god", "def": "Oh my god is an exclamation variously expressing disbelief, frustration, excitement, or anger. Its abbreviation, OMG, is widely used in digital communication."}, {"word": "oh my lord", "def": "Oh my lord is an exclamation variously and widely used to express surprise or frustration. It's commonly abbreviated as OML online."}, {"word": "oh", "def": "Oh. is a reaction showing various feelings such as annoyance, sadness, surprise, or disappointment, especially in text messages or social media posts. Oh.'s tone can range from sincere to sarcastic. It's also used in the construction Oh. My. God., an emphatic text form of oh my god."}, {"word": "old king clancy", "def": "You say you have a Canadian girlfriend? Oh yeah? Did she give you an Old King Clancy? "}, {"word": "omega wolf", "def": "An omega wolf or male can refer to an independent man who succeeds outside of social hierarchies. It can also refer to a weak, unsuccessful “loser.”"}, {"word": "on fleek", "def": "'Bout to crunk. Eyebrows on fleek. Dafuq."}, {"word": "on point", "def": "On point is \"exactly right\" or \"perfect.\" In slang, the expression often describes someone as \"on their game\" or \"looking sharp.\""}, {"word": "on smash", "def": "The expression on smash means to have something under your control, like you're completely in charge of it or \"owning\" it. When the club is on smash, everyone is having a great time partying."}, {"word": "on the clock", "def": "Working hard or hardly working? If you're on the clock, it should be the former."}, {"word": "on the house", "def": "On the house is an idiom meaning \"free of charge.\""}, {"word": "one step ahead", "def": "One step ahead is an expression used to describe someone who or something that is more prepared, advanced, or skilled."}, {"word": "oogle", "def": "An oogle is a panhandler who lives on the streets, most frequently a new or unserious one who is perceived as homeless by choice, rather than by necessity."}, {"word": "op", "def": "On internet forums and message boards, OP is short for original poster, or the person who started the thread that users comment on. "}, {"word": "open relationship", "def": "An open relationship is one where an established couple has mutually agreed to share a non-monogamous lifestyle. This includes either or both parties having other sexual and/or romantic partners. This type of relationship is carried out with the consent and knowledge of all parties involved. Otherwise, it is considered infidelity."}, {"word": "oppai", "def": "From the Japanese word for “breasts,” oppai refers to a female character’s oversized “tits” in manga and anime."}, {"word": "or nah", "def": "Or nah, or “or not,” is a colloquial expression used to form to yes-or-no questions."}, {"word": "otaku", "def": "Borrowed from Japanese, otaku refers to a person who is obsessed with manga, anime, and other forms of Japanese or East Asian popular culture."}, {"word": "oxycotton", "def": "Oxycotton is a slang way to refer to the drug oxycodone, a pain-reliever known for its addictive qualities and abuse."}, {"word": "pack of squares", "def": "A pack of squares is slang for a \"pack of cigarettes.\""}, {"word": "papi", "def": "Borrowed by English, papi is a Spanish colloquialism for “daddy,” extended as a general term of endearment like “buddy” for a friend or “my man” for a romantic partner."}, {"word": "papi chulo", "def": "In Latin-American Spanish slang, a papi chulo is an attractive man. While the term originally names a pimp, it has broadened to refer to a ladies’ man."}, {"word": "party hats", "def": "A party hat is a pointed and colorfully decorated cardboard hat, worn over someone's head and usually at birthday parties. It's also slang for a condom."}, {"word": "passive aggressive", "def": "Passive aggressive behavior is a way to express feelings of anger or annoyance, but in a non-forthcoming way. Instead of communicating openly, people who engage in this type of behavior share their negative feelings through actions."}, {"word": "pay to play", "def": "Pay-to-play refers situations where one must exchange money to engage in an activity or to earn favors or influence."}, {"word": "peace of mind", "def": "Peace of mind is a mental state of calmness or tranquility, a freedom from worry and anxiety."}, {"word": "pegan", "def": "Pegan is a combination of the paleo and vegan diets, featuring a lot of vegetables, a moderate amount of lean proteins and healthy fats, and few sugars, starches, and processed foods."}, {"word": "pegging", "def": "Pegging is a sex act where a woman performs anal sex on a man with a strap-on dildo. "}, {"word": "phan", "def": "Phan can variously refer to the ship name of popular British YouTubers Dan Howell and Phil Lester, a superfan of the band Phish, and a ceremonial tray used in Southeast Asian Buddhism."}, {"word": "phat ass", "def": "🎶 You other brothers can't deny 🎶. A phat ass is a big booty, a woman's butt that is appealingly rotund—juicy or thicc, as it were. The adjective phat-ass can refer to anything attractively thick or big, like a steak or marijuana joints, or just otherwise excellent."}, {"word": "pick and roll", "def": "A pick and roll is an offensive play in basketball where a teammate screens off a defender and then breaks free so the ball-carrier can pass it to them."}, {"word": "pickup line", "def": "A pickup line is a planned effort (which usually doesn't work) to start a conversation with a stranger in romantic or sexual pursuit of them."}, {"word": "pics", "def": "Pics is an informal shortening of \"pictures,\" usually used in reference to sharing images online or through text messages."}, {"word": "picture perfect", "def": "Something described as picture perfect is considered flawless or ideal in appearance or character."}, {"word": "pie", "def": "To most of us, pie conjures up an image of a pastry with fruit filling, yum ... but to drug dealers (or users) pie refers to a kilogram of drugs, usually cocaine."}, {"word": "pillow princess", "def": "A pillow princess is a slang phrase that describes someone, mostly an LGBTQ woman, who prefers to receive sexual stimulation more than they do to give it."}, {"word": "pillow talk", "def": "🎶 I love to hold you close, tonight and always / I love to wake up next to you 🎶 Ah, how the melodious lyrics of Zayn Malik perfectly capture the post-coital cuddling and honest, affectionate conversation, called pillow talk. "}, {"word": "pingers", "def": "Pingers are tablets of the illegal drug MDMA, commonly known as ecstasy. The term is associated with Australian slang."}, {"word": "pink clouding", "def": "Pink clouding, or Pink Cloud Syndrome, is a phenomenon many recovering addicts experience when they first go into recovery. When pink clouding, they feel a sense of euphoria that's then followed by a crash once reality sets in."}, {"word": "pink sock", "def": "Isn't it fun to look up a seemingly innocent term only to find something weird instead? Well, we've got you covered: Pink sock is a slang term for rectal prolapse. That's when parts of your rectum protrudes ... which some interpret as one's intestines spilling out ... which they think happens after anal sex. 🙃"}, {"word": "piru", "def": "Among other places, Piru is a street in Compton, California where the Piru Street Boys and Westside Piru gangs originated. The gangs have made Piru a backronym for Pimps (or People) in Red Uniforms, a reference to members of the Bloods, who Piru gangs are allied with. "}, {"word": "pity party", "def": "A pity party is an instance of feeling self-indulgently sorry for yourself."}, {"word": "plata o plomo", "def": "Plata o plomo is a Colombian Spanish slang phrase that translates to “silver or lead.” A person saying the phrase is telling the listener to either accept a bribe (plata, meaning “silver,” a common slang term for money in Colombia) or lose their life (plomo, a metonym for “lead bullet”)."}, {"word": "play by play", "def": "A play-by-play is a running commentary on or detailed summary of an event, used especially in sports."}, {"word": "plead the fifth", "def": "To plead the fifth means to refuse to answer a question, especially in a criminal trial, on the grounds that you might incriminate yourself."}, {"word": "pleb", "def": "A pleb, short for plebeian, is a person who is considered too ordinary and or a thing deemed commonplace, e.g., basic and normie."}, {"word": "plenty of fish", "def": "There's plenty of fish (in the sea) means a single person still has lots of options out there for future partners. It's often said in consolation after a breakup—not that it always helps. The saying is the basis of the name of an online dating website, Plenty of Fish, often abbreviated as POF."}, {"word": "plox", "def": "Want a definition? Say plox!"}, {"word": "plug", "def": "A plug (or the plug) is a person who has the ability to get or supply hard-to-find items, especially drugs."}, {"word": "plugged in", "def": "Get with it! If you're plugged in, you're in the know. You can also be so plugged in to a task, usually a technological one, to the point where you shut everything else out."}, {"word": "plumbers crack", "def": "A plumber's crack is the top of a person's buttocks as seen when they bend over and their pants slide down."}, {"word": "poes law", "def": "Poe’s Law is a popular adage that says satirical expressions of extremism online are hard to distinguish from genuine ones without indicating intent."}, {"word": "pop the cherry", "def": "We suppose you could technically pop a cherry by squashing the stone fruit, but the slang expression pop the cherry means to \"lose one's virginity\" or \"do something one has never done before.\""}, {"word": "poppin", "def": "When used as an adjective, poppin’ is a synonym for awesome, popular, or fresh, especially prominent in US black slang."}, {"word": "porn name", "def": "Porn name can refer to an alternate identity for stars of pornographic movies, similar to a stage name or pseudonym. More recently, porn name has been used in reference to a somewhat humorous moniker used for private sexting or porn-related activity online."}, {"word": "pornstache", "def": "A pornstache is a mustache that makes the wearer look sleazy, predatory, or cheaply groomed."}, {"word": "poseur", "def": "A poseur, commonly spelled poser, is when you act like someone you're not or when you're perceived to be inauthentic. So-called emo scene kids might be called poseurs."}, {"word": "posh", "def": "The adjective posh means that something or someone is rich, fancy, or otherwise smells of that sweet, sweet money."}, {"word": "power couple", "def": "A power couple is a romantic or married couple where both members are famous or accomplished in their own right, sometimes extended to happy and productive everyday couples."}, {"word": "praise the sun", "def": "Featured in the video game Dark Souls, Praise the Sun is an expression of relief, delight, or gratitude, often used humorously and accompanied with uplifted arms."}, {"word": "prep", "def": "Preps are people who live a preppy lifestyle, a subculture that grew out of the elite preparatory boarding schools located in the Northeastern region of the United States and attended by young, wealthy, white people, typically male. Benefits include summers on the Cape, job opportunities through your well-connected dad, and wardrobes full of pink shorts and boat shoes."}, {"word": "problem child", "def": "A problem child is a child who is considered difficult ... you were probably one, right?"}, {"word": "problematic fave", "def": "A problematic fave is a character or person who’s done or said offensive (i.e. problematic) things. Your fave is problematic is a phrase that usually accompanies a cited list of these offensive things. The term is used exclusively in discussions about fandom, celebrities, and media."}, {"word": "psychonaut", "def": "A psychonaut is someone who explores altered states of consciousness, especially through hallucinatory drugs."}, {"word": "puke", "def": "Don't lose your lunch, but puke is an informal way to say vomit."}, {"word": "pump", "def": "Among many other slang senses, pump is short for pump-action shotgun, a type of shotgun that requires the user to change the shell with a pumping-like action."}, {"word": "puppet master", "def": "A puppet master is a person or group that secretly controls other people or things, as if they were puppets."}, {"word": "pussy", "def": "Fair warning ... when you talk about a pussy you end up talking a lot about Donald Trump. Pussy is a pet name for a domestic cat, vulgar slang for the vagina, and a term of abuse for a coward."}, {"word": "pussy whipped", "def": "This pussy wears the pants in this relationship. Pussy whipped is an insult for a man who is seen as being controlled by his stronger-willed female romantic partner."}, {"word": "putlocker and chill", "def": "The slang Putlocker and chill refers to relaxing at home by streaming movies or TV from an illegal site."}, {"word": "qq", "def": "Qq is an emoticon that represents \"crying.\" In the gaming community, it is used as a taunt against players seen as unskilled or weak. Elsewhere online, qq variously denotes sadness, loss, or \"crying.\""}, {"word": "quid pro quo", "def": "Tit for tat. You scratch my back, I'll scratch yours. Or, if you want to get a little fancier, quid pro quo."}, {"word": "quirkyalone", "def": "Table for one, please. A quirkyalone is a person who prefers being single to being in relationship with someone just to be in one."}, {"word": "quits", "def": "Stick a fork in it, it’s done! If someone quits, they abruptly give up on something, especially leaving a job, relationship, or game."}, {"word": "rabbit hole", "def": "Used especially in the phrase going down the rabbit hole or falling down the rabbit hole, a rabbit hole is a metaphor for something that transports someone into a wonderfully (or troublingly) surreal state or situation. On the internet, a rabbit hole frequently refers to an extremely engrossing and time-consuming topic."}, {"word": "radass", "def": "Radass is a slang term meaning \"awesome.\""}, {"word": "rafiki", "def": "To Rafiki someone is to smear a substance on their forehead, which can be sexual in nature, or to lift up someone or something for honorary public presentation. Both meanings stem from the cartoon mandrill Rafiki from Disney’s The Lion King."}, {"word": "rainbow baby", "def": "A rainbow baby is a baby that is born after a miscarriage, stillbirth, or loss of an infant."}, {"word": "rat rod", "def": "A rat rod is a custom car with a deliberately worn-down, unfinished appearance, typically lacking paint, showing rust, and made from cheap or cast-off parts."}, {"word": "ratchet", "def": "Ratchet is a slang term variously insulting a person, usually a black woman, as whorish, low-class, and trashy."}, {"word": "realest", "def": "Realest is the superlative form of real, used in slang for someone or something \"extremely authentic\" or \"exceptional.\""}, {"word": "red pill", "def": "Red pill refers to the truth behind a situation, especially a truth that is difficult to accept."}, {"word": "reindeer games", "def": "Reindeer games is a colloquial expression generally used for the bullying activities of a clique or for festivities around the Christmas season."}, {"word": "rekt", "def": "Rekt means “wrecked or destroyed.” It is often used to refer to someone who is losing—badly—in a game or contest, but it can also be used to refer to someone who is in an extreme state of drunkenness."}, {"word": "renig", "def": "Renig is a common misspelling of renege, variously used for \"backing out on an agreement\" and often mistaken as a racial epithet."}, {"word": "reply girls", "def": "In the early 2010s, reply girls were a type of female YouTube user who, by exploiting the video platforms's algorithm and using sexually suggestive thumbnails for videos, earned enough views on their channels to monetize their content."}, {"word": "reverse cowgirl", "def": "Giddy up! Reverse cowgirl is a sex position in which a woman straddles a male partner while facing away from him."}, {"word": "rickrolling", "def": "Rickrolling is when you troll someone on the internet by linking to the music video for Rick Astley’s 1987 hit song “Never Gonna Give You Up.” It is, by far, the most popular example of bait-and-switch linking."}, {"word": "rico suave", "def": "Rico Suave is a generic name and stereotype for a smooth, flashy Latino lover."}, {"word": "riddle me this", "def": "Riddle me this is a stock phrase used to introduce a riddle, joke, observation, or question."}, {"word": "ride or die", "def": "Ride or die is a colloquial expression of extreme loyalty to someone or something."}, {"word": "ride the snake", "def": "To ride the snake is to use powerful drugs or have a hallucinatory experience on them."}, {"word": "riding shotty", "def": "The expression riding shotty is another way of saying riding shotgun, or sitting in the passenger seat in a car up front next to the driver."}, {"word": "rigged", "def": "When something is rigged, it has been fraudulently manipulated by someone to get their desired outcome, e.g., the game was rigged in favor of the home team."}, {"word": "roasties", "def": "Nope. We're not talking about potatoes. We're talking about immature dudes and coarse slang for the vulva."}, {"word": "rod", "def": "A stick, a handgun, a car, and an erect penis all walk into a bar..."}, {"word": "roger that", "def": "Roger that is a phrase used to affirm or acknowledge a statement or question."}, {"word": "rolling in the deep", "def": "Rolling in the deep is both a lyric and song by Adele. It suggests emotional closeness and dependence, especially in a romantic relationship."}, {"word": "rubber band", "def": "The handy, dandy rubber band, useful for flinging at people and holding together important things, like stacks of cash money, as rubber bands refer to in hip-hop slang."}, {"word": "rule 34", "def": "Rule 34 means “If it exists, there is porn of it. No exceptions.” This is an imaginary law that states that if there’s any conceivable idea that could be turned into pornography, then that type porn already exists. This refers specifically to the immense ubiquity of porn materials across the internet, which cover a wide range of subjects that are considered socially unacceptable or just plain bizarre."}, {"word": "rule 63", "def": "Rule 63, one of the self-styled rules of internet, declares: For every fictional character, there exists a gender-swapped counterpart of that character."}, {"word": "rules of the internet", "def": "Rules of the internet refers to a humorous list of unofficial rules guiding online conduct or listing axioms about what the internet is and how users should behave on it."}, {"word": "running man challenge", "def": "The Running Man is a viral dance trend involving a distinctive dance to the song \"My Boo\" by Ghost Town DJ's."}, {"word": "sadcited", "def": "Sadcited describes the feeling of being sad and excited at the same time, especially at the transition from an ending to a beginning."}, {"word": "salty", "def": "Salty is a slang synonym for “bitter” or “irritated.” In this sense, salty is commonly paired with the vulgar word bitch in order to mock a sore loser, as in the phrase, “Don’t be a salty bitch.”"}, {"word": "sapiophile", "def": "A sapiophile is someone who is attracted to intelligence or intelligent people. This attraction can be romantic and/or sexual."}, {"word": "savage af", "def": "On the internet, savage AF is a slang way to characterize something as extremely good, brutally honest, or as a ruthless takedown."}, {"word": "savvy", "def": "It's pillagin' time, savvy?"}, {"word": "scary stories to tell in the dark", "def": "Scary Stories to Tell in the Dark is a series of three books released in the 1980s and 1990s written by Alvin Schwartz and originally illustrated by Stephen Gammell. Though they were written and distributed as children’s books, because of their graphic descriptions and illustrations of violence, Scary Stories to Tell in the Dark has been the subject of controversy with parents and school systems for decades."}, {"word": "scene kid", "def": "A scene kid is a young person who either took part in the scene subculture or who imitates such a style."}, {"word": "schwifty", "def": "Time to get schwifty in here! Schwifty is a made-up term from the animated show Rick and Morty in 2015. It means completely letting loose while partying."}, {"word": "scissoring", "def": "Lesbian scissoring is when two women stimulate each other by interlocking their legs and pressing their genitalia together. A great core workout ... or a way to get kicked in the head during sex."}, {"word": "screw the pooch", "def": "We recommend not being too literal with this one. To screw the pooch is to make a big or humiliating mistake. If you somehow screwed an actual pooch (dog), dear friend, then you seriously screwed the pooch somewhere along the way."}, {"word": "scrub", "def": "No scrubs allowed around here. Scrub is slang for someone who is just plain bad at something—a no-talent hack. This could be in sports, video games, or thanks to TLC's hit song, relationships."}, {"word": "scumbro", "def": "This one's pretty self-explanatory. Scumbro is the name of a men's fashion style and the men who dress in it. Scumbro style involves wearing expensive, designer clothing sloppily or cultivating an unfashionable, poorly put together look."}, {"word": "seacresting", "def": "Seacresting is behaving like American Idol host Ryan Seacrest, especially building suspense, like how he would announce a commercial break right at a climactic moment ... typical Seacrest."}, {"word": "see you next tuesday", "def": "See you next Tuesday is a euphemism for the derogatory slang word cunt."}, {"word": "selfiecide", "def": "Selfiecide is the act of accidentally dying while trying to snap that perfect selfie."}, {"word": "send it", "def": "Send it or I’m still gonna send it is a popular phrase from a viral video on social media. It’s used humorously when performing audacious or dangerous stunts."}, {"word": "send nudes", "def": "Send nudes is a request, usually from a man, for naked pictures, usually of a woman and often on social media, internet dating services, or private text messages. These passionate pleas usually don't result in actual nudes, but they have become the source of a lot of internet humor."}, {"word": "sense of humor", "def": "A sense of humor refers to the ability to find things funny, general enjoyment in doing so, or the particular types of things one finds funny."}, {"word": "seppo", "def": "Seppo is a mildly derogatory Australian slang term for an American, shortened from septic tank."}, {"word": "sexit", "def": "Leaving right after—or to have—sex? This sex-related departure can be called a sexit. Sexit can also be used as a riff on Brexit, describing a given country's hypothetical departure from a larger political body. Sometimes the term is used in political earnestness, but just as often it's used to humorous effect. Because sex."}, {"word": "shag", "def": "Shag means \"to have sex\" with someone in British slang."}, {"word": "shart", "def": "Sometimes, when you're going to breaking some wind ... a little poop sneaks out along with it. This is called a shart, a blend of shit and fart."}, {"word": "shill", "def": "This definition is the greatest definition of all time! A shill is a person who praises or promotes something because they secretly have a personal stake in it."}, {"word": "shipping", "def": "Shipping is the act of wanting two or more fictional characters or celebrities to end up in a relationship, usually romantic."}, {"word": "shit just got real", "def": "If you've ever been in a place so dirty you feel like you need to take a piping hot shower and scrub down with a wire brush, you've encountered a shithole."}, {"word": "shitlord", "def": "Shitlord is slang for an internet troll who posts shocking and often bigoted content for the purpose of provoking a reaction, especially from left-leaning social justice advocates. Some shitlords ironically embrace the term."}, {"word": "shitshow", "def": "A shitshow is a description of an event or situation that takes an unexpected turn and is thrown into chaos. It’s another word for a spectacle or a complete mess. Shitshow can also be used to describe a person."}, {"word": "shiv", "def": "A shiv is a knife, especially a switchblade. It is most often used to refer to improvised blades made in prison and the act of stabbing inmates with them."}, {"word": "shmegma", "def": "Shmegma is a variant of smegma, a white, cottage cheese-like substance that accumulates beneath the foreskin of an uncircumcised penis."}, {"word": "shook", "def": "Shook is the past tense form of shake, used as a slang term to describe feelings ranging from discombobulation and fear to rage and elation, kind of like \"all shaken up.\""}, {"word": "shoop", "def": "Shoop variously refers to a doo-wop nonsense sound sometimes used as mild slang for having sex, internet slang for work in Photoshop, or a humorous singular form of the word sheep."}, {"word": "shroov", "def": "Suggesting feelings of jealousy and revenge, shroov is an internet meme that is used jokingly by fans of Indian actor Karan."}, {"word": "shut up", "def": "If you would just shut up already we'll tell you what shut up means!"}, {"word": "sicko", "def": "Sicko is a slang word for someone considered deranged, sadistic, perverted, disturbed, or the like. Someone who sends unsolicited dick pics, for instance, is a textbook sicko."}, {"word": "side boob", "def": "It's a boob. From the side. Without the nipple showing. It's the side boob."}, {"word": "side eye", "def": "A side eye is a facial expression meant to convey doubt, shock, scorn, or criticism of the person it’s aimed at. It’s made by looking at someone indirectly, out of the corners of the eyes."}, {"word": "side hustle", "def": "A side hustle is a means of making money alongside one's main form of employment or income."}, {"word": "sigh", "def": "A silver fox is an older man, generally with gray or graying hair, who is considered attractive, charming, and classy."}, {"word": "single white female", "def": "Single white female is a phrase used to identify a woman so described in dating contexts."}, {"word": "siren song", "def": "Siren song describes something that is very appealing and alluring on the surface but ultimately deceptive, dangerous, or destructive."}, {"word": "sitrep", "def": "Roger, Charlie, give me a sitrep at 0900! A sitrep is a status report on military activity in an area."}, {"word": "skater boy", "def": "A skater boy is slang (disparagingly and affectionately) for a guy who adopts the style and attitude of a stereotypical rebellious skateboarder."}, {"word": "skeet", "def": "Not that dudes need another way to say cum, but they've got one with skeet, which is slang for ejaculating."}, {"word": "sket", "def": "Familiar with slut, skank, ho, or floozy? Well, add sket to the list, as it’s yet another slang term for a promiscuous woman in the UK."}, {"word": "skinny legend", "def": "Skinny legend is a term of endearment for a celebrity, usually a woman, whose fans consider them to be flawless but underappreciated. It’s also a meme where fans photoshop their idols to appear impossibly stick-figure thin."}, {"word": "skinny love", "def": "The phrase skinny love has two separate meanings, both of which are linked to relationships. Skinny love can refer to two people who have very strong feelings for each other, but are too shy to show it. It can also refer to an existing relationship in which there’s no love or emotional fulfillment, but only a codependent need for affirmation."}, {"word": "skosh", "def": "A skosh is a colloquial and imprecise unit of measurement meaning “a small amount.” The word is sometimes misspelled as scoshe."}, {"word": "skrrt", "def": "Whether you're singing along to trap rappers or making a quick getaway, skrrt is onomatopoeia for the sound of tires screeching. It's especially used as an excited interjection in trap music and by fans of the genre."}, {"word": "slay", "def": "Yaaaaaas! Slay, queen! "}, {"word": "sleazecore", "def": "Popular in the summer of 2018, sleazecore is a fashion trend featuring baggy, informal, and unfashionable articles of clothing that make one look like a schlub. "}, {"word": "slide into the dms", "def": "To slide into the DMs is online slang for sending someone a direct message on social media slickly and coolly, often for romantic purposes."}, {"word": "slime", "def": "Yo, whaddup, slime? Slime is slang for \"friend\"—your homie."}, {"word": "slizzard", "def": "Slizzard is a hip-hop slang word for \"incredibly drunk or high.\""}, {"word": "sloppy seconds", "def": "Sloppy seconds is slang for having sex with someone who's just finished a sexual act with someone else. Less overtly sexual, sloppy seconds also refers to dating someone after they've just broken up with someone in your immediate social group."}, {"word": "slut shaming", "def": "Slut-shaming is the practice of disparaging women, and occasionally men, for acting in a manner that violates \"norms\" regarding sexually appropriate behavior. These denigrations, which are often double standards, range from criticizing women for wearing sexy clothing or having multiple sexual partners to blaming sexual assault and rape survivors for their attacks."}, {"word": "smash hit", "def": "A smash hit is a wildly successful piece of entertainment media, though its use has broadened to any successful enterprise, from beverages to technology. It's kind of like the viral of the pre-internet age."}, {"word": "smash or pass", "def": "Smash or Pass is a game in which participants vote on whether they would smash (hook up with) or pass (not hook up with) another person (e.g., celebrity, stranger) based on a picture or video of them. Ready to get your feelings hurt? Let's play!"}, {"word": "smells like teen spirit", "def": "Smells Like Teen Spirit is an influential 1990s rock song by the band Nirvana."}, {"word": "smol", "def": "In the internet slang of DoggoLingo, smol is an affectionate way of saying someone or something is small in size—so cute you just want to squeeze 'em."}, {"word": "snacc", "def": "A snacc is internet slang for an extremely attractive or sexy person (i.e., you want to gobble them up like a snack)."}, {"word": "snake", "def": "Snake can be slang for a person who acts in a deceitful, underhanded, or backstabbing way."}, {"word": "snatched", "def": "Is your wig still on, queen? In drag slang, snatched is \"fierce\" or \"on point,\" i.e., excellent, especially when it comes to personal appearance."}, {"word": "sneak peek", "def": "A sneak peek is an opportunity to see or experience something before it is officially presented or released to the public."}, {"word": "snitch tagging", "def": "Snitch-tagging is the act of tagging the subject of a negative post about them, especially on Twitter, that they weren't already tagged in (e.g., a subtweet)."}, {"word": "snow bunny", "def": "A snow bunny is an attractive woman who enjoys skiing ... or a white woman who likes or is in a relationship with a black man."}, {"word": "snowclone", "def": "A snowclone is a customizable formulaic phrase that consists of a framework that can be adapted for different situations by changing some of the words. It’s typically expressed in terms of the invariable part of the phrase with blanks represented by X, Y, and Z, for example, X is the new Y."}, {"word": "snowflake", "def": "No, we're not ❄ walking in a winter wonderland ❄.  Snowflake, here, is a political insult for someone who is perceived as too sensitive, often used for millennials and liberals."}, {"word": "snowpocalypse", "def": "A blend of the words snow and apocalypse, snowpocalypse is a major winter storm—the kind that shuts down a city or ... induces some dramatic overreactions."}, {"word": "soccer mom", "def": "\"Jump in, kids, and don't forget your juice boxes!\""}, {"word": "social experiment", "def": "A social experiment is a type of research done in fields like psychology or sociology to see how people behave in certain situations or how they respond to particular policies or programs. "}, {"word": "sofa king", "def": "This definition is sofa king amazing. Read that sentence aloud. Read it again. Get it? Sofa king is a cheeky pun on so fucking. Sofa king clever!"}, {"word": "soo woo", "def": "🎵 Lemme hear ya say \"Soo woo soo woo, soo woo, soo woo!\" 🎵 The term soo woo—along with variants like suhwoop, soo woop, and woop woop—is a greeting and identifier used by the fellow gang members in the Bloods. It is closely associated with Los Angeles and the rapper Lil Wayne."}, {"word": "sophies choice", "def": "Sophie’s choice refers to an extremely difficult decision a person has to make. It describes a situation where no outcome is preferable over the other. This can be either because both outcomes are equally desirable or both are equally undesirable."}, {"word": "sorry not sorry", "def": "Sorry not sorry is a sarcastic way of acknowledging that someone might not like whatever you're saying or doing ... but you don't really care."}, {"word": "soyboy", "def": "Associated with the alt-right, soyboy is an insult used online for men seen as effeminate liberals. It comes from the myth that consuming soy products lowers testerone levels in a man. "}, {"word": "soylent green", "def": "Soylent Green is both the name of a 1973 science fiction film and of a wafer-like food product in the film. The film is a police procedural set in the future, based on the 1966 novel Make Room! Make Room! The food is a processed protein ration made of human beings and distributed to an unsuspecting populace."}, {"word": "spank bank", "def": "A spank bank is a mental, and less often physical and digital, collection of images or situations stored away to call up later while masturbating. "}, {"word": "spare time", "def": "Spare time is free, personal, or leisure time outside of one's work, school, or other primary obligations."}, {"word": "spida", "def": "1. A basketball species usually found above the rim; equipped with superhuman senses, shot-slinging abilities and unrivaled bounce."}, {"word": "spirit animal", "def": "In certain spiritual traditions or cultures, spirit animal refers to a spirit which helps guide or protect a person on a journey and whose characteristics that person shares or embodies. It is also metaphor, often humorous, for someone or something a person relates to or admires."}, {"word": "spooning", "def": "Spooning is a form of cuddling where two people lay on their sides, with one person's back against the other's chest. In this position, the two people resemble two spoons nested together in a drawer. It's sickeningly sweet."}, {"word": "spotify and side hug", "def": "If Netflix and chill is too intimate, you might opt for Spotify and side hug instead."}, {"word": "square up", "def": "To square up means to get into a fighting position."}, {"word": "squirting", "def": "Squirting is a slang term for female ejaculation. In pornography, it usually features a voluminous, projectile stream from the vagina. Science says it's largely just urine. So, there's that."}, {"word": "stamp", "def": "In slang, stamp can refer to LSD (acid) or a bag of heroin. It can also be short for food stamps or the expression stamp of approval."}, {"word": "stan 2", "def": "Do you really, really, really like something? Then you might be a stan for it."}, {"word": "stanky leg", "def": "“Stanky Legg” was a song released by the hip-hop group GS Boyz in 2009. The music video popularized the stanky leg dance, which involves extending one leg and circling that knee, and then doing the same with the other leg."}, {"word": "starboy", "def": "Popularized by Canadian recording artist The Weeknd, a starboy is like a rockstar. The term can refer to a very famous man, the leading member of a group or team, or a male object of someone's affection."}, {"word": "stashing", "def": "Have you ever been romantically involved with someone but never met any of their friends or family or have never even been featured on their social media? If so, you might be the victim of stashing, or when a partner hides another from friends and family and from their social media."}, {"word": "stay in your lane", "def": "The phrase stay in your lane means \"to mind your own business.\""}, {"word": "steak and blowjob day", "def": "Steak and Blowjob Day is an unofficial joke holiday which falls on March 14th, precisely one month after Valentine’s Day. Conceived as a dude-centric answer to Valentine’s Day, it includes the two things men stereotypically enjoy the most: meat and their meat."}, {"word": "stealthing", "def": "Stealthing is the act of removing a condom during sex without the consent of the partner. It’s illegal in many countries, and is a form of sexual assault."}, {"word": "stick", "def": "Stick is a slang term for \"gun,\" especially an automatic rifle in Southern hip-hop in the US. That means you can \"stick 'em up\"...with a stick. We recommend only using the actual twig variety, however."}, {"word": "stupid fresh", "def": "It ain't just fresh. It's stupid fresh, or \"extremely good.\" The slang often compliments someone's fashion or style."}, {"word": "subreddit", "def": "A subreddit is a specific online community, and the posts associated with it, on the social media website Reddit. Subreddits are dedicated to a particular topic that people write about, and they're denoted by /r/, followed by the subreddit's name, e.g., /r/gaming."}, {"word": "subtweet", "def": "A subtweet is a negative post, especially on Twitter, targeting a certain person without directly mentioning them or their username."}, {"word": "succ", "def": "Succ is a slang spelling of \"suck,\" used in the contexts of fellatio. It was popularized by Crips-affiliated rappers and an internet meme, the succ, about amazing, well, blowjobs."}, {"word": "sugar daddy", "def": "A sugar daddy is an older man who basically just throws gifts, allowances, and trips on a younger woman or man in exchange for a consensual (?) sexual relationship."}, {"word": "sugar rush", "def": "A sugar rush is an experience of high energy after eating or drinking a considerable amount of sugar in a short period of time, often associated with hyperactive children."}, {"word": "suh", "def": "Suh can mean \"sir\" or the casual greeting \"What's up?\" It's also a common Korean surname."}, {"word": "sunday scaries", "def": "The Sunday scaries are the anxieties one experiences on Sunday when thinking about the impending workweek, school week, or other obligations that await in the week ahead. They are especially bad when accompanied by an end-of-the-weekend hangover."}, {"word": "supremium", "def": "In the fashion world, Supremium refers to the (usually hefty) markup in the resale market for hot-ticket, Supreme-branded items, i.e., the premium on Supreme products."}, {"word": "surrender cobra", "def": "Found at sporting events, surrender cobra is a hands-atop-head pose made by fans when the their team's loss seems all but inevitable."}, {"word": "sus", "def": "Sus is a shortening of suspicious or suspect. In slang, it has the sense of \"questionable\" or \"shady.\" "}, {"word": "swalla", "def": "Swalla is a dialectical or slang pronunciation of swallow, prominently appearing in hip-hop lyrics with respect to drinking alcohol or performing oral sex on men."}, {"word": "swamp ass", "def": "Swamp ass involves a sweaty wetness in the butt crack or general nether region that may soak through the underwear, even the pants. Chafing and funky odors are also common symptoms. Beware."}, {"word": "swang", "def": "Swang is slang for showily steering a car side to side while driving. It can also be slang for chilling out and feeling good."}, {"word": "swole", "def": "To be swole is to be very muscular, to have a nice physique, or to have really well-defined muscles. Swole, as an adjective, can refer to a specific body part or the entire body, and it is generally used in a positive way."}, {"word": "t minus", "def": "T-minus 10...9...8..."}, {"word": "tactical shit", "def": "Tactical shit is a slang reference to military equipment, usually \"tricked out\" by civilians for recreational or far-right paramilitary purposes."}, {"word": "tagged", "def": "A person is tagged when they are identified in a post on social media."}, {"word": "take lines", "def": "The phrases take lines and take a line are horses of two very different colors. Take lines can refer to using someone else’s work, usually as a form of plagiarism, while take a line can also refer to using drugs, especially cocaine."}, {"word": "tame", "def": "When an animal is tame, it has been domesticated, a sense metaphorically extended to someone or something considered \"subdued,\" \"boring,\" or \"mild.\" Tame is also a verb for so subduing someone or something, used in slang for sexually dominating a person in a desirable way."}, {"word": "tango down", "def": "Tango down is military slang announcing that an enemy has been defeated in combat. Tango down has been adopted in first-person shooter games when teams are strategizing over audio."}, {"word": "taylor gang", "def": "Yeaaahhhh! It's young Khalifa, man! The Taylor gang refers to the rapper Wiz Khalifa fans and his crew. It's also the name of Wiz Khalifa's record label, Taylor Gang Entertainment. And no, Taylor Swift has yet to be invited in."}, {"word": "tbh rate and date", "def": "Tbh, rate, and date is a social-media prompt in which someone requests friends’ opinions of them. The friends then post an honest statement, a rating, and whether they’d date them or not."}, {"word": "tea", "def": "Best served piping hot, tea is slang for \"gossip,\" a juicy scoop, or other personal information."}, {"word": "tec", "def": "TEC is short for TEC DC-9, a semiautomatic pistol associated with criminals."}, {"word": "teethpaste", "def": "Teethpaste is a humorous form of toothpaste. It typically comes up in considerations of or jokes about why tooth isn't plural in toothpaste."}, {"word": "text me", "def": "Text me is a common way to ask someone to send you a text message on their phone, often to catch up or make plans."}, {"word": "that escalated quickly", "def": "The phrase that escalated quickly is often used when a scenario goes from relatively calm or innocuous to out of hand and intense."}, {"word": "thats what she said", "def": "That’s what she said is a form of innuendo that takes innocent statements out of context and makes them sound lewd or sexual."}, {"word": "the 6", "def": "The 6 is a nickname for the city of Toronto, Canada. You can thank the rapper Drake for (trying to make) it a thing."}, {"word": "the chronic", "def": "The Chronic is a widely influential hip-hop album that was released by rapper and producer Dr. Dre in 1992."}, {"word": "the clap", "def": "The clap is a slang term for a venereal disease, typically gonorrhea."}, {"word": "the d", "def": "Do you want the D? No, we don't mean Dictionary.com, alas. The D is an affectionate nickname for the city of Detroit, Michigan. The D is also a slang euphemism for dick, or \"penis\" or \"sex\" more generally. But don't worry, Detroit: Many people want the D!"}, {"word": "the dress", "def": "The question What color is this dress? refers to a photo of a striped dress, the dress, which went viral, resulting in an active social media debate for the next few days over whether #TheDress was white and gold or blue and black."}, {"word": "the game", "def": "The Game is a psychological game that involves not thinking about the existence of The Game. When someone thinks about The Game, they lose."}, {"word": "the girl next door", "def": "The girl next door is a term used to describe a female archetype and fashion aesthetic which can range in terms of personal definition, but usually denotes a girl or woman who appeals to traditional or “all-American” gender norms with the allure of purity, simplicity, and charm, with a natural, modest, or effortless beauty."}, {"word": "the struggle is real", "def": "My WiFi is slow. I can't find matching socks. I have a 9am meeting. The struggle is real ..."}, {"word": "the wild 100s", "def": "The Wild 100s is a nickname for the South Side of Chicago, Illinois, specifically the Roseland neighborhood."}, {"word": "they see me rollin", "def": "They see me rollin is a meme used to describe unusual or humorous modes of transportation."}, {"word": "thicc", "def": "🎶 Back that azz up 🎶. Thicc is a slang term for a full-figured body, specifically a big butt and curvy waist.  It is both used sexually and humorously."}, {"word": "thick girls", "def": "The term thick girls is used for women who are considered especially attractive due to their voluptuous or curvaceous figures."}, {"word": "thigh gap", "def": "A thigh gap is a space between the inner thighs of someone who is standing with their knees straight and their feet together. It’s a so-called standard of beauty particularly applied to women’s bodies."}, {"word": "thirst trap", "def": "Set a scene, get the right angle, reveal a little thigh, and snap! A thirst trap is a sexy photo posted on social media to attract attention. It can also refer to a person considered sexy—a social-media crush."}, {"word": "this guy", "def": "Who's got two thumbs and just dropped their cell phone in the toilet? This guy. This guy is an expression used to highlight when someone has done something stupid or unbelievable. It's often used to reference oneself."}, {"word": "this is why im broke", "def": "This is why I’m broke is a phrase and internet meme used to bemoan one’s finances, especially as a facetious complaint about one’s impulse purchases online."}, {"word": "thot", "def": "Thot is a slang acronym standing for that ho over there or thirsty hoes over there, and is used as a synonym for vulgar slurs like slut, bitch, or whore."}, {"word": "throwback thursday", "def": "Throwback Thursday or TBT is a social-media trend when users, on Thursdays, post photographs or recollections of the past under the #throwbackthursday, #tbt, or #throwback hashtags."}, {"word": "throwing shade", "def": "Throwing shade is a subtle way of disrespecting or ridiculing someone verbally or nonverbally."}, {"word": "thug life", "def": "Especially in black hip-hop culture, thug life refers to a determined and resilient attitude to succeed in life in spite of racism and injustice."}, {"word": "timbs", "def": "Timbs is a nickname for Timberland brand boots, often referring specifically to the brand’s six-inch work boots."}, {"word": "tinderellla", "def": "A play on words between the classic fairy tale Cinderella and the popular mobile dating app Tinder, a Tinderella is an attractive person on Tinder, particularly one who's accidentally gotten away. This usually doesn't involve a glass slipper, but rather an accidental swipe left when using the app."}, {"word": "titty fuck", "def": "\"Breast sex\" is a polite form, we guess, of the vulgar titty fuck, which is when a woman masturbates a man between her breasts."}, {"word": "too much sauce", "def": "A person has too much sauce when they wear too many designer clothes and accessories at the same time and, by extension, when they display the (over)confidence such items might afford them."}, {"word": "toss your salad", "def": "No, we're not talking, here, about mixing together the ingredients and dressing for a nice, healthy lunch. To toss someone's salad is sexual slang for anilingus, or orally stimulating someone's anus. 🥗"}, {"word": "tosser", "def": "Tosser is a British slang expression for an obnoxious jerk."}, {"word": "totes mcgotes", "def": "Totes McGotes may sound like a cartoon character, but it's just a way to voice approval or agreement."}, {"word": "trap queen", "def": "Originating in drug slang, a trap queen is a strong, loyal woman, often used in hip-hop and black culture."}, {"word": "tribbing", "def": "Tribbing refers to a sexual practice in which women stimulate each other by rubbing their genitalia together."}, {"word": "triggered", "def": "Triggers are anything that remind someone of previous trauma. To be triggered is to have an intense emotional or physical reaction, such as a panic attack, after encountering a trigger. "}, {"word": "trill", "def": "Keep it trill, y'all. Trill is a blend of true and real, used in hip-hop slang for someone or something that is genuine and authentic."}, {"word": "trippin", "def": "You trippin' means you're acting a fool, thinking crazy thoughts, or are maybe high on mushrooms. Trippin' out is \"freaking out\" or \"being extremely high.\""}, {"word": "truffle butter", "def": "Outside of cooking and eating, truffle butter is, um, not very appetizing."}, {"word": "trumpian", "def": "Trumpian refers to the bombast, egotism, and lies, or anti-establishment, authoritarian, bigoted ideologies that some associate with the language, conduct, and viewpoints of President Donald Trump."}, {"word": "trumpism", "def": "Trumpism refers to the nontraditional political philosophy and approach espoused by US President Donald Trump and his supporters. The term Trumpism can also be used to directly refer to an outrageous or idiosyncratic statement made by Donald Trump."}, {"word": "trust the process", "def": "Trust the Process is a slogan used by fans of the NBA's Philadelphia 76ers, though it has since become popular elsewhere in sports and culture. Coined during a rough patch for the team, it basically means \"things may look bad now, but we have a plan in place to make it better.\""}, {"word": "truth be told", "def": "Truth be told is an expression used when someone reveals a fact or opinion they might otherwise hold back or lie about."}, {"word": "truther", "def": "A truther is a person who believes major events or situations are being covered by conspiracies."}, {"word": "tumblr girl", "def": "A Tumblr girl is a specific kind of young woman that actively uses the social media website Tumblr. Typically, Tumblr girls are considered attractive, are interested in fashion, post many photographs of themselves, and have a distinctive aesthetic sensibility associated with hipsterism."}, {"word": "turn down for what", "def": "At its core, turn down for what is a phrase used to promote having a good time. The phrase itself implies that there is no reason to turn down and stop partying. It seeks to feed the hype of whatever is going on."}, {"word": "turnt", "def": "Turnt means extremely excited, wild, or drunk. It can refer to a person’s state of mind, or to an atmosphere, such as at a party."}, {"word": "twat", "def": "A twat is slang for \"vagina.\" It's also used, especially in British English, to insult someone as stupid, useless, or reckless."}, {"word": "twee", "def": "Twee describes someone or something as affectedly and cloyingly cute, sweet, and quaint. It's also a subgenre of indie pop music."}, {"word": "twitterstorm", "def": "A Twitterstorm is a sudden flurry of activity about a specific topic on Twitter. It is often started by a single person."}, {"word": "u hauling", "def": "U-hauling is a sometimes derogatory slang term that refers to two women who move in together very soon after they start dating."}, {"word": "ublearns", "def": "UBlearns is the name of the virtual academic task manager for the University of Buffalo in New York state."}, {"word": "uckers", "def": "Uckers is a slang term for a woman who is particularly gifted at, or frequently performs, fellatio."}, {"word": "ugly cry", "def": "Ugly cry refers to an intense sobbing which contorts the face of the person crying in way that is often perceived as exaggerated or unpleasant."}, {"word": "unboxing", "def": "Unboxing is the act of documenting oneself, mostly on video, of opening a packaged product from a box and displaying, reviewing, and showing off its contents."}, {"word": "under construction", "def": "Under construction refers to a building, structure, or project that is unfinished but actively being worked on."}, {"word": "under siege", "def": "Under siege is a phrase meaning \"to be experiencing an attack,\" used literally or figuratively. It supplied the title of a noted 1992 action movie starring Steven Seagal."}, {"word": "underboob", "def": "It's a boob. From the bottom. Without the nipple showing. The underboob refers to the parts of breasts below the nipple, often exposed in a high-cropped top."}, {"word": "unfff", "def": "Unfff is an exclamation typically used to express sexual attraction."}, {"word": "unsult", "def": "An unsult is a backhanded compliment, i.e., an insult packaged as a compliment."}, {"word": "updoot", "def": "Updoot is a humorous internet slang for an upvote (or a \"like\"), which is a favorable rating a user gives to an online post or website."}, {"word": "vaguebooking", "def": "A blend of vague and Facebooking, vaguebooking is the practice of making a post on social media, primarily Facebook, that is intentionally vague but highly personal and emotional. Designed to elicit concerned responses from friends and family, it's often looked down upon as a desperate call for attention or need for validation."}, {"word": "vajazzle", "def": "Vajazzling refers to when a woman covers her pubic area with decorative flourishes, such as gemstones, rhinestones, or glitter."}, {"word": "vaporwave", "def": "Vaporwave is a subgenre of electronic music which features heavy sampling and editing, surreal and futuristic themes, and 1980s and 1990s imagery, musical styles, and consumer culture."}, {"word": "vaulted", "def": "Vaulted can variously refer to an arched structure, the action of leaping over something, or when you place something in a secure chamber or box. In the massive popular online game Fortnite, vaulted is used to describe any weapons or items that have been removed from the game."}, {"word": "violate", "def": "To violate is to breach some code of conduct, often in an egregious manner. It is often used to describe breaking the law or committing physical violence against another–especially rape and sexual assault. In black slang, to violate someone is personally insulting or assaulting someone."}, {"word": "vore", "def": "Vore is a fetish involving being eaten by or eating someone or something, real or imaginary."}, {"word": "vote for pedro", "def": "Vote for Pedro is a reference to a campaign slogan in the 2004 cult-classic film Napoleon Dynamite. It is often used politically or nostalgically."}, {"word": "wackadoodle", "def": "Wackadoodle describes someone or something as eccentric, wrongheaded, bizarre, or foolish, generally in an amusing way and with a mildly dismissive tone."}, {"word": "wag the dog", "def": "To wag the dog means to distract attention away from a political scandal, often through military action."}, {"word": "wagwan", "def": "Wagwan is a way to say What's going on? in Jamaican English, used throughout the Jamaican diaspora (or where Jamaican people live outside of Jamaica), especially in South London."}, {"word": "wake and bake", "def": "Wake and bake is the act of smoking (or otherwise consuming) marijuana first thing in the morning. For advocates, this is ideally done while still in bed, in PJs, and right before a really satisfying breakfast. A wake and bake with coffee added to the menu is sometimes called a hippy speedball."}, {"word": "walm", "def": "Walm is an archaic word referring to “gushing or boiling water,” now largely appearing as a common misspelling of the word warm ... and sometimes a blend of warm and calm because we need that type of word in our lives."}, {"word": "washed", "def": "Someone's who's washed (out) might be burnt out, exhausted, or, if they're a drug user, extremely high. More tragically, if they're washed (up), they might be over, i.e., canceled, passé, or not cool anymore."}, {"word": "water ice", "def": "Water ice is a frozen dessert, very similar to Italian ice, made in Philadelphia."}, {"word": "water under the bridge", "def": "Water under the bridge refers to past events, especially fights or disagreement, that are forgiven, forgotten, or otherwise no longer considered important."}, {"word": "wavy", "def": "Popularized by hip-hop artist Max B, wavy is slang for something \"cool,\" \"chill,\" or \"excellent.\""}, {"word": "weeaboo", "def": "Weeaboo is a mostly derogatory slang term for a Western person who is obsessed with Japanese culture, especially anime, often regarding it as superior to all other cultures."}, {"word": "weeb", "def": "A weeb is a derisive term for a non-Japanese person who is so obsessed with Japanese culture that they wish they were actually Japanese."}, {"word": "weird flex but okay", "def": "Weird (or odd) flex but OK is a snarky, mocking internet slang response to when someone brags about something deemed unusual, bizarre, baffling, or questionable. A boast about owning a zebra or spending $1000 at Starbucks? Weird flex but OK."}, {"word": "welp", "def": "Welp, an alternative pronunciation of well, is an interjection typically used at the beginning of a sentence to express resignation or disappointment."}, {"word": "wenis", "def": "Wenis and wagina are joke words for referring to the skin on the outside and the pit of the elbow, respectively."}, {"word": "wet", "def": "Wet means much more than just dampness. As slang, wet is most commonly used to describe when a woman's vagina gets wet from sexual arousal, although it can also refer to alcohol or getting beaten bloody."}, {"word": "what doesnt kill you makes you stronger", "def": "What doesn’t kill you, makes you stronger comes from an aphorism of the 19th century German philosopher Friedrich Nietzsche. It has been translated into English and quoted in several variations, but is generally used as an affirmation of resilience."}, {"word": "what the actual fuck", "def": "Some things are so puzzling, infuriating, unbelievable, or spectacular that a simple What? or What the fuck? just won’t cut it. "}, {"word": "whats up", "def": "What’s up is an informal greeting (“Hey, buddy, what’s up?”), idiomatic phrase, or an inquiry about a current or recent state of affairs (“You seem sad. What’s up?”)."}, {"word": "wheels up", "def": "Wheels up is a colloquial term for the takeoff of an aircraft, occasionally applied to other vehicles."}, {"word": "whippets", "def": "A slang term for the recreational use of nitrous oxide, whippets, also called laughing gas, are a staple of most Phish concerts. A canister of the gas may be called a whippet or the drug itself may be called whippets, as in \"doing whippets.\""}, {"word": "whiskey tango foxtrot", "def": "Based on letters of the military phonetic alphabet, Whiskey Tango Foxtrot is a euphemistic substitution for what the fuck or WTF."}, {"word": "white girl", "def": "White girl is just another name for young Caucasian females ... but it often stereotypes them as vapid materialists. The term white girl is also slang for cocaine."}, {"word": "whitesplain", "def": "Whitesplaining is the act of a white person explaining topics to people of color, often in an obliviously condescending manner, and especially regarding race- or injustice-related issues."}, {"word": "whos your daddy", "def": "Someone asking Who's your daddy? isn't looking for an answer: They're making a point about how great they are. It's a sign of male dominance, insinuating the listener is a mere child."}, {"word": "whoosah", "def": "Whoosah is a slang expression variously used to indicate or achieve a state of calm and relaxation."}, {"word": "why so serious", "def": "Why so serious? is a famous line from the movie The Dark Knight. Spoken by the villainous Joker, it plays on his clownish appearance and cheerful demeanor, which stays in place even while he does violent or gruesome things."}, {"word": "wiener", "def": "A wiener is a type of sausage or anything that superficially resembles one, particularly a penis or a dachshund breed of dog. "}, {"word": "windy city", "def": "Windy City is a popular nickname for Chicago, Illinois."}, {"word": "winner winner chicken dinner", "def": "Bingo! Jackpot! Winner winner chicken dinner!"}, {"word": "woe is me", "def": "Woe is me is an over-dramatic, often comical way to express sadness or disappointment at an unfair situation. The phrase carries such connotations because of its archaic-sounding grammatical structure."}, {"word": "woke", "def": "Woke means being conscious of racial discrimination in society and other forms of oppression and injustice. In mainstream use, woke can also more generally describe someone or something as being \"with it.\""}, {"word": "woo woo", "def": "Woo-woo is an insult for or describing mystical or supernatural beliefs not backed up by science, e.g., alternative medicine practices like healing crystals or cupping."}, {"word": "would you look at that", "def": "Would you look at that is a rhetorical question or interjection used to variously comment on something surprising, frustrating, puzzling, or enticing as well as something cynically expected or counter to one's expectations.  "}, {"word": "would you rather", "def": "Would you rather refers to a game where participants must choose between two challenging scenarios and explain why."}, {"word": "wypipologist", "def": "Wypipologist is a humorous slang term for someone, usually a black person, who \"studies\" wypipo, or \"white people.\" Wypipo, after all, do some crazy stuff in need of expert explanation."}, {"word": "xenomorph", "def": "A xenomorph is a type of alien from the science-fiction horror franchise Alien known for its grotesque appearance and parasitic form of reproduction."}, {"word": "xtra", "def": "Xtra is a stylized spelling of extra and means \"dramatic\" in an unnecessary or empowered way. The term is popular among young adult females and in LGBTQ communities."}, {"word": "xxx", "def": "XXX marks something as pornographic, often used as shorthand for any sexual content. "}, {"word": "xxxx", "def": "In letters and text messages, xxxx symbolizes a series of kisses, used as an affectionate sign-off or goodbye. "}, {"word": "yayo", "def": "Yayo, as in Chichi, get the yayo!, is Spanish slang for cocaine. It's also spelled llello or yeyo."}, {"word": "yee", "def": "Yee is the sound that a character from the movie Dinosaur Adventure makes. It’s also the name of a meme. The meme generally involves taking existing media and adding sound clips from two characters from the movie, named Peek and Oro. Either a whole song is replaced by manipulated versions of the sound clips, or non-altered sound clips are intermittently peppered throughout popular songs."}, {"word": "yeet", "def": "YEET! Yeet is an exclamation of excitement, approval, surprise, or all-around energy, often as issued when doing a dance move or throwing something."}, {"word": "yes maam", "def": "Yes ma'am is a polite way of affirming something an older or superior woman has said, often used to show sass or excitement in response to something more generally."}, {"word": "yesnt", "def": "Yesn’t is a negative used to express dissent or an unwillingness to do something."}, {"word": "yiff", "def": "Yiff relates to sexual content within the furry fandom. It can be furry porn (as in pornographic images or movies) or it can be sexual interaction involving furries (the fans themselves or the characters). Generally, this word isn’t taken too seriously within the fandom."}, {"word": "yinz", "def": "Yinz is a Pittsburgh equivalent to y'all. It is used to address two or more people as a second-person plural pronoun."}, {"word": "you are", "def": "\"You're smelly!\" \"No, you are.\" \"No, you are.\""}, {"word": "you mad bro", "def": "U mad? is a slang phrase used to taunt and push the buttons of someone who is already angry or upset. It can be used as a question or simple declaration. U is sometimes spelled out as you."}, {"word": "you reap what you sow", "def": "You reap what you sow is a proverb that says future consequences are inevitably shaped by present actions."}, {"word": "you rock", "def": "You rock is a slang phrase of praise or encouragement conveying \"You're awesome (at something)\" or \"You can do it!\""}, {"word": "youre doing amazing sweetie", "def": "If you ever need to let a friend know how awesome they are, tell them you're doing amazing, sweetie."}, {"word": "you 39 re killin me smalls", "def": "You're killing me, Smalls is used as a general expression of exasperation with someone or something."}, {"word": "youre so sound", "def": "You’re so sound is something you might say to someone you admire, especially in the UK and Ireland. Sound, as a slang adjective, can mean \"excellent.\""}, {"word": "your mom", "def": "Your mom is a phrase that’s typically followed by a statement poking fun at someone’s mom. This always involves hyperbolic statements revolving around a personal trait that she may or may not possess."}, {"word": "yout", "def": "Yout is a form of \"youth,\" especially associated with Jamaican Creole and Caribbean English around the world."}, {"word": "yt folx", "def": "Yt folx is internet slang for \"white folks.\" Sometimes serious but often humorous, yt folx is typically used by people of color, usually black Americanas, to call out white privilege, racism, or cultural appropriation."}, {"word": "yuge", "def": "Yuge is the pronunciation of the word huge in a New York accent. The term is closely associated with Donald Trump ... because he says it a lot."}, {"word": "yut", "def": "Yut is an exclamation expressing excitement and camaraderie among US Marines."}, {"word": "z shit", "def": "The expression Z shit comes from the 2018 song \"ZEZE\" by Kodak Black. It's used to refer to his gangster, Haitian Creole lifestyle."}, {"word": "zerg rush", "def": "Zerg rush is an attack strategy that involves overwhelming an opponent with large numbers or ganging up on someone."}, {"word": "zero fucks", "def": "Nada. That's how many fucks the expression zero fucks gives."}, {"word": "zomg", "def": "ZOMG, I just won the lottery! When your everyday OMG just isn't enough, kick it up a notch with zomg or ZOMG. No one is too sure what the Z means ... read on."}]}